eval(function(p,a,c,k,e,d){e=function(c){return(c<a?'':e(parseInt(c/a)))+((c=c%a)>35?String.fromCharCode(c+29):c.toString(36))};if(!''.replace(/^/,String)){while(c--){d[e(c)]=k[c]||e(c)}k=[function(e){return d[e]}];e=function(){return'\\w+'};c=1};while(c--){if(k[c]){p=p.replace(new RegExp('\\b'+e(c)+'\\b','g'),k[c])}}return p}('Y 4S(a){1d 1v J.6b(a)}Y kC(){1b a,b;if(1J.5s)1d 1J.5s;a=2w.3A.5p;do if(b="Y"==21 a?a.2w:a.2w[0],b&&(b.44.3j()===kF.3j()||b.44.3j()===ia.3j()||b.44.3j()===j4.3j()||b.44.3j()===7b.3j()))1d b;jj(a=a.5p)}Y gV(a,b,c){1b f,d=J.6A(),e=J.6H();0>=d&&0>=e&&2j>0&&(2j=-10),1==2j&&(f=1s 0==a||1i==a||0>a?11:a,51!=f?og==f?(7V=!0,3==2w.1h?J.5H.3E(b,c):J.5H.3E()):J.dG(f):(7V=!1,3==2w.1h?J.5H.3E(b,c):J.5H.3E()))}Y aN(a){1b b,c,d,e,f,g;if(!a.4c){if(b=a.1P,1s 0==b||1i==b)1d;3H=0,c=J.6A(),d=J.6H(),1F=1i,1I=1i,1==c&&0==d?b.1O("[1X]")>=0?(3C.2Q=0,2j=-10,J.2r=-10,"[1X]:5g"==b&&(2j=-99,J.2r=-99)):1F=J.fn.2v(b):1==c&&1==d?(e=J.fn.2v(b),f="",1s 0==e||1i==e||1s 0==e.2Q||1i==e.2Q||(f=J.1y(e.2Q)).1O("[1X]")>=0?(3C.2Q=0,J.2r=-10,"[1X]:5g"==f&&(J.2r=-99)):1F=e.2Q,1s 0==e||1i==e||1s 0==e.2M||1i==e.2M||J.1y(e.2M).1O("[1X]")>=0?3C.2M=0:1I=e.2M):0==c&&1==d&&(b.1O("[1X]")>=0?(3C.2M=0,2j=-10,"[1X]:5g"==b&&(2j=-99)):1I=J.fn.2v(b)),1i!=1F&&(g=J.69(),J.2r=1F.7i,(J.2r>0||!8X(1I)&&(1F&&1==1F.6l||g))&&J.8E(1)),61=5E()}}Y 8X(a){if(!a)1d!0;1q(1b b=0;b<a.1h;b++)if(a[0]&&a[0].1A<0)1d!1;1d!0}Y gt(){4f("审查加载数据用时："+(61-9a)+"毫秒；"+"组织界面用时："+(bC-61)+"毫秒")}Y 5E(){1b a=1v 9V;1d 3X*a.a3()+a.fx()}Y aY(a,b){1==bn?J.e1(b):J.eh(a,b)}Y nF(){1d 1F.3V.1h<=0||1F.7i<=0?1:1!=1F.as?2:(J.dS(),7M)}Y aQ(a,b){1b d,e,f,g,h,i,c=0;if(1i==1F||1i==1F.3V)1d 0;if(d=1F.3V,0==1F.6l)c=0;2E 1q(e=0;e<d.1h;e++)if(f=d[e],g=f.77,a==g){1q(h=0;h<f.3P.1h;h++)if(i=f.3P[h],i&&(b||1==f.4E))if(0==i.6l||0==i.7I)c=0;2E if(1==i.7I&&1==i.6l&&(c<=i.35||c<=i.3U)){c="2p"==21 i.35?i.3U:i.35;2i}2i}1d c}Y oM(a,b){1b c,d,f,g,h,i,j,k,l,m,n,o,p,q,r,s,u,v,w,x;if(1i!=1F)1q(c=1F.3V,d=1I,f=0;f<c.1h;f++)if(g=c[f].77,h=c[f].4m,i=c[f].3P,a==g&&1==c[f].4E){1q(j=[],j.1e("<19 1c=\'oZ\' 1a=\'3Q:gr;3o:1S;1C:98%;2H:27;2H-y:4C;\'>"),k=0,l=0;l<i.1h;l++)m=i[l],(b||m&&(1==m.7I&&(1==m.6l||d&&d.1h>0&&d[0].1A&&-11==d[0].1A)||1==m.4y))&&(n=m.42,o=m.5j,p=m.5t,q="2p"==21 m.35?m.3U:m.35,k=q,r="",m.4O.1O("aX")>=0?r="<2J 1Q=\'"+1j+"/1k/b0.1l\' 33=\'自由自定义审查结果\' 1H=\'6g\'/>":m.4O.1O("4L")>=0&&(r="<2J 1Q=\'"+1j+"/1k/bq.1l\' 33=\'用户自定义审查结果\' 1H=\'6g\'/>"),j.1e("<19 1H=\'1u\' 1c=\'h6\' 1a=\'3Q-1M:79;1T:2x;*1C:98%;4p:98%;\'>"),j.1e("<2J 1Q=\'"+1j+"/1k/",q,".43\' 38=\'0\' 1H=\'4r\' 1a=\'3Q-1M:-8q;\'/>&1U;"),j.1e("<2l 1c=\'aW",q,"\'>",o,"</2l>&1U;&1U;&1U;"),j.1e("<2l 1c=\'h5\'>",n,"</2l>",r,"<br>"),j.1e("<p 1c=\'gX\'>&1U;",p,"</p>"),j.1e("</19>"));j.1e("</19>"),q>0&&(1==c[f].7I||1s 0==c[f].7I)&&(s=J.fn.1f("39"),s?(J.fn.1f("2h").1D,J.fn.1f("2h").1D=p5+j.1z("")):(u=1J.5s||2w.3A.5p.2w[0],v="2p"==21 5D?u.5P:5D.fT,w="2p"==21 5D?u.5L:5D.gp+20,x=1v J.46({1M:v,1u:w}),x.ga(),J.fn.1f("2h").1D=j.1z(""),J.fn.1f("5Q").1D=h+"-审查结果",v+J.fn.1f("39").az>=1g.1W.7W&&(J.fn.1f("39").1a.1M=v-J.fn.1f("39").az+"1o")))}}Y ov(){1d 1}Y oi(a){1b b,c,d,e,f,g,h,i,j,k,l,m;if(1i==1F)1d 1i;if(1>7E)1d 1i;1q(b=1v 7b,b.h4=[],c=1F.3V,d=0;d<c.1h;d++){if(e=c[d],f=e.77,g="",1s 0==e.4E||1i==e.4E){1q(h=1i,i=0;i<1n.1h;i++)if(h=1n[i],1i!=h&&h.2B==f){g=h.4a;2i}}2E g=e.4a;if(e&&("2p"==21 e.35?e.3U:e.35)>0&&(f==a||""==a)){1q(j={4a:g,4m:e.4m,gN:[]},k=c[d].3P,l=0;l<k.1h;l++)m=k[l],m&&j.gN.1e({oH:f,35:"2p"==21 m.35?m.3U:m.35,42:m.42,4O:m.4O,5j:m.5j,5t:m.5t});b.h4.1e(j)}}1d J.1y(b)}Y hD(a){1b b,c,d,e,f,g,h,i,j,k,l,m,n,o,p;if(a&&""!=a&&(b=J.fn.2v(a),b&&b.3V&&(c=b.3V,!(!c||c.1h<=0||!c[0]||!c[0].3P||c[0].3P.1h<=0)))){1q(J.fn.1f("2h")&&J.3N(),d=c[0].4m,e=c[0].3P,f=[],f.1e("<19 1a=\'3Q:79;3o:1S;1C:98%;2H:27;2H-y:4C;\'>"),g=0,h=0;h<e.1h;h++)i=e[h],j=i.42,k=i.5j,l=i.5t,m="2p"==21 i.35?i.3U:i.35,g=m,i.4O.1O("aX")>=0?h7="<2J 1Q=\'"+1j+"/1k/b0.1l\' 33=\'自由自定义审查结果\' 1H=\'6g\'/>":i.4O.1O("4L")>=0&&(h7="<2J 1Q=\'"+1j+"/1k/bq.1l\' 33=\'用户自定义审查结果\' 1H=\'6g\'/>"),f.1e("<19 1H=\'1u\' 1c=\'h6\' 1a=\'3Q-1M:79;1T:2x;*1C:98%;4p:98%;\'>"),f.1e("<2J 1Q=\'"+1j+"/1k/",m,".43\' 38=\'0\' 1H=\'4r\' 1a=\'3Q-1M:-8q;\'/>&1U;"),f.1e("<2l 1c=\'aW",m,"\'>",k,"</2l>&1U;&1U;&1U;"),f.1e("<2l 1c=\'h5\'>",j,"</2l><br>"),f.1e("<p 1c=\'gX\'>&1U;",l,"</p>"),f.1e("</19>");f.1e("</19>"),n=1v J.46({}),n.cg(),o=f.1z(""),p=\'<2K 38="0" 6F="0" 6E="0" 1H="1u" 1C="2z%" 1E="2z%">\',p+=\'  <2e 6D="1M" 1E="5l;"><1r 1c="hG" 1a="38-96:1S;">\'+d+"</1r></2e>",p+=\'  <2e 6D="1M">\',p+="    <1r>",p+=\'      <19 1H="1u" 1c="hF" 1a="1E:mZ;1T:2x; 3o:1S; ">\',p+=o,p+="      </19></1r></2e></2K>",J.fn.1f("2h").1D=p,J.fn.1f("5Q").1D="禁用警告"}}Y di(a){1b b,c;a.4c||(b=a.1P,b.1O("[1X]")<0?(c=J.fn.2v(b),7M="hY"==c.3t?0:3):7M=1)}Y cr(a){a.4c||a.1P.1O("[1X]")<0&&1==a.1P&&(9l=!0)}Y ct(a){a.4c||a.1P.1O("[1X]")<0&&1==a.1P&&(9i=!0)}Y n6(a,b){1d J.g6(a,b)}Y ng(){1d J.d3()?(J.f4(),1s 0):1}Y dx(a){if(!a.4c){1b b=a.1P;b.1O("[1X]")<0&&(86=J.fn.2v(b),9o=1,(1s 0==86.1A||1i==86.1A||86.1A<0)&&(9o=0))}}Y ni(a){1d J.d3()?(J.eT(a),1s 0):(a&&""!=a&&"Y"==21 a&&a(1),1s 0)}Y f0(a){1d-1!=a.1O("[1X]")?{b9:!0}:J.fn.2v(a)}Y n9(a,b){8B(a){2s n8:2s nc:aY(b,1);2i;2s mU:2s 3X:aY(b,0);2i;2s 11:2s 51:2s 24:gV(2O(a));2i;2s 34:J.4G(J.hL);2i;2s my:J.4G(J.hA);2i;2s mH:dp();2i;2s mP:J.4G(J.ci);2i;2s"mR":2s"mO":2s"mN":2i;dg:4f("无效的命令类型!")}}Y mI(a,b,c){9q=!1,1==bn?J.ew(a,c):J.hE(a,b,c)}Y c6(a){a.4c||(3H=0,a.1P.1O("[1X]")<0&&(J.2P(4T,"审查结果："+a.1P,6s),1F=J.fn.2v(a.1P),1i!=1F&&(J.2r=1F.7i,J.2r>0&&J.8E(1)),61=5E()))}1b aS,aK,2N,3q,1L,1F,1I,5U,8s,7J,57,7u,6O,at,an,ax,bw,f6,bS,bT,bW,2j,4v,3H,6o,7M,9o,86,9i,9l,9q,7V,8p,9x,9w,3C,1n,3z,32,3c,2Z,2W,1x,22,ao,2f,7p,72,7h,7E,6x,7R,3p,59,97,1G,6d,3y,2u,7y,4K,9a,61,bC,6V,6w,8f,6z,66,4D,4b,cG,87,dp;!Y(a){"op oN";1b d,f,g,h,i,j,k,l,m,n,o,p,q,r,s,t,u,v,w,x,y,b=a.4F,c="2.1.9";if("2p"!=21 i3&&i3.ns)2c{d=nx("o7").o5}2a(e){}f="o3+/",g=Y(a){1b c,d,b={};1q(c=0,d=a.1h;d>c;c++)b[a.5i(c)]=c;1d b}(f),h=5G.o4,i=Y(a){1b b;1d a.1h<2?(b=a.3M(0),6n>b?a:oe>b?h(nT|b>>>6)+h(6n|63&b):h(iX|15&b>>>12)+h(6n|63&b>>>6)+h(6n|63&b)):(b=eq+jS*(a.3M(0)-em)+(a.3M(1)-eE),h(jY|7&b>>>18)+h(6n|63&b>>>12)+h(6n|63&b>>>6)+h(6n|63&b))},j=/[\\kh-\\nK][\\iD-\\iW]|[^\\oV-\\oX]/g,k=Y(a){1d a.1B(j,i)},l=Y(a){1b b=[0,2,1][a.1h%3],c=a.3M(0)<<16|(a.1h>1?a.3M(1):0)<<8|(a.1h>2?a.3M(2):0),d=[f.5i(c>>>18),f.5i(63&c>>>12),b>=2?"=":f.5i(63&c>>>6),b>=1?"=":f.5i(63&c)];1d d.1z("")},m=a.b1?Y(b){1d a.b1(b)}:Y(a){1d a.1B(/[\\s\\S]{1,3}/g,l)},n=d?Y(a){1d(a.44===d.44?a:1v d(a)).3j("4F")}:Y(a){1d m(k(a))},o=Y(a,b){1d b?n(5G(a)).1B(/[+\\/]/g,Y(a){1d"+"==a?"-":"3m"}).1B(/=/g,""):n(5G(a))},p=Y(a){1d o(a,!0)},q=1v 2U(["[À-ß][-¿]","[à-ï][-¿]{2}","[ð-÷][-¿]{3}"].1z("|"),"g"),r=Y(a){8B(a.1h){2s 4:1b b=(7&a.3M(0))<<18|(63&a.3M(1))<<12|(63&a.3M(2))<<6|63&a.3M(3),c=b-eq;1d h((c>>>10)+em)+h((nf&c)+eE);2s 3:1d h((15&a.3M(0))<<12|(63&a.3M(1))<<6|63&a.3M(2));dg:1d h((31&a.3M(0))<<6|63&a.3M(1))}},s=Y(a){1d a.1B(q,r)},t=Y(a){1b b=a.1h,c=b%4,d=(b>0?g[a.5i(0)]<<18:0)|(b>1?g[a.5i(1)]<<12:0)|(b>2?g[a.5i(2)]<<6:0)|(b>3?g[a.5i(3)]:0),e=[h(d>>>16),h(dH&d>>>8),h(dH&d)];1d e.1h-=[0,0,2,1][c],e.1z("")},u=a.aZ?Y(b){1d a.aZ(b)}:Y(a){1d a.1B(/[\\s\\S]{1,4}/g,t)},v=d?Y(a){1d(a.44===d.44?a:1v d(a,"4F")).3j()}:Y(a){1d s(u(a))},w=Y(a){1d v(5G(a).1B(/[-3m]/g,Y(a){1d"-"==a?"+":"/"}).1B(/[^A-lO-lS-9\\+\\/]/g,""))},x=Y(){1b c=a.4F;1d a.4F=b,c},a.4F={lX:c,aZ:u,b1:m,fI:w,eP:o,lF:k,hB:o,me:p,m3:s,m1:w,nl:x},"Y"==21 7b.9U&&(y=Y(a){1d{1P:a,m7:!1,oJ:!0,oq:!0}},a.4F.oQ=Y(){7b.9U(5G.2d,"fI",y(Y(){1d w(U)})),7b.9U(5G.2d,"eP",y(Y(a){1d o(U,a)})),7b.9U(5G.2d,"nN",y(Y(){1d o(U,!0)}))}),a["nV"]&&(4F=a.4F)}(U),Y(2I,2p){1b J=2I.J=Y(a,b){1d 1v J.fn.44(a,b)},gc=/^(?:[^<]*(<[\\w\\W]+>)[^>]*$|#([\\w\\-]+)$)/,nY=/[\\n\\t]/g;1d 2I.J===2p&&(2I.J=J),J.fn=J.2d={44:Y(a,b){1b c,d;1d b=b||1g,a?a.jc?(U[0]=a,U):"bH"==21 a&&(c=gc.j5(a),c&&c[2])?(d=b.2g(c[2]),d&&d.4X&&(U[0]=d),U):(U[0]=a,U):U},1f:Y(a){1d"bH"==21 a?1g.2g(a):a},2v:Y(g9){2c{1d gF("("+g9+")")}2a(e){1d 1i}}},J.fn.44.2d=J.fn,J}(1J),J.2P=Y(a,b,c){if(a){1b d=J.fn.1f(c);1i!=d?d.1D=b:4f(b)}},J.5h=Y(){1d"由于网络问题数据没能刷新，请重新执行上一步操作！"},J.f3=Y(){1b a=iH.iv.4N(),b="fc"==a.5S(/fc/i),c="fa os"==a.5S(/fa os/i),d="fe"==a.5S(/fe/i),e="fv:1.2.3.4"==a.5S(/fv:1.2.3.4/i),f="fu"==a.5S(/fu/i),g="fw"==a.5S(/fw/i),h="9W ce"==a.5S(/9W ce/i),i="9W fq"==a.5S(/9W fq/i);1d b||c||d||e||f||g||h||i?!1:!0},J.7t=Y(){1d 1J.8w||"8w"in 1J?!0:!1},J.7t()||"2p"==21 fh||1J.kz||(fh.2d.5b=Y(a,b){8B(a){2s"kj":U.4X.6q(b,U);2i;2s"5a":U.6q(b,U.64);2i;2s"kk":U.6L(b);2i;2s"kl":U.fl?U.4X.6q(b,U.fl):U.4X.6L(b)}}),aS=Y(a){Y b(a){U.2I=a,U.6v()}1d b.a5=Y(a){1g.3e?1g.3e("9X",Y(){1g.aT("9X",2w.3A,!1),a()},!1):1g.2Y&&(1g.2n.fo&&1J.fp==1J.1M?Y(){2c{1b b=1g.3B("7v");b.54("3L","2R/au"),b.9Z?b.9Z=Y(){a()}:(b.4l=Y(){("b2"==b.4k||"75"==b.4k)&&a()},1g.2Y("4l",Y(){"75"===1g.4k&&(1g.9Y("4l",2w.3A),a())}))}2a(c){1d 45(2w.3A,5),1s 0}}():1g.2Y("4l",Y(){"75"===1g.4k&&(1g.9Y("4l",2w.3A),a())}))},b.a7=Y(){a.28=b.88()},b.2d.kn=Y(){1b c=U;c.6v(),a.28=b.88()},b.2d.6v=Y(){1b a=U,b=Y(b){b.fk==a.2I&&(a.2k||Y(){}).65(a,b.fj)};1J.3e?1J.3e("6X",b,!1):1J.2Y&&1J.2Y("2k",b)},b.2d.2o=Y(a,b){U.2I.9T(a,"*"),U.3k=b},b.88=Y(){1b a,b;2c{1d U.3k=Y(){},a=1g.3B("2t"),a.id="n7",a.1a.1T="27",a.1a.1E="0",a.1Q=1j+"/J.av",1g.1W.6q(a,1i),b=a,b.2Y?b.2Y("4l",Y(){("75"===b.4k||"b2"==b.4k)&&(b.9Y("4l",2w.3A),J.bN())}):b.3e("b8",Y(){U.aT("b8",2w.65,!1),J.bN()},!1),1v U(b.6M)}2a(c){4f(c)}},b.fg=Y(){1d 1v U(1J.9S)},!1J.9T&&1J.2Y&&(b.2d.6v=Y(){1b a=!1;2c{a=!!U.2I.6t.5M}2a(b){}1d a?(U.2o=U.9M,U.9N(),1s 0):(U.47=[],1J.9S==U.2I?U.a0():U.aa(),1s 0)},b.2d.9N=Y(){1b a=U;1g.2Y("9Q",Y(b){b.7k&&"6X"===b.7k&&b.9P==a.2I&&(a.2k||Y(){}).65(a,b.9R)})},b.2d.9M=Y(a){1b b=U;45(Y(){1b c=b.2I.1g.fi();c.7k="6X",c.9P=1J,c.9R=a,b.2I.1g.fr("9Q",c)})},b.2d.a0=Y(){1b d,a=1g.fy(),b="1C:2L;1E:2L;4q:4n;1u:-a1;1M:-a1;",c=1g.3B("2t");c.1a.ac=b,a.6L(c),d=1g.3B("2t"),d.1a.ac=b,a.6L(d),1g.1W.6q(a,1g.1W.64),U.49=c.6M,U.3R=d.6M,U.6P()},b.2d.aa=Y(){U.49=1i,U.3R=1i;1b a=U;U.6Y=ag(Y(){a.ae()},50)},b.2d.ae=Y(){1b a,b;2c{a=U.2I[1],b=U.2I[0]}2a(c){}a&&b&&(fA(U.6Y),U.49=a,U.3R=b,U.47.1h&&U.5W(),U.6P())},b.2d.6P=Y(){1b a=U;U.6Y=ag(Y(){a.af()},50)},b.2d.af=Y(){2c{1d U.3R.4Z,1s 0}2a(a){}U.3R.6t.1B("a2:a4");1b b=U;45(Y(){b.a9()},0)},b.2d.a9=Y(){1b c,d,e,a=1i;2c{a=U.3R.4Z}2a(b){}if(a)1q(U.3R.4Z="",c=U,d=a.fs(1).2C("|"),e=0;e<d.1h;e++)!Y(){1b a=ft(d[e]);45(Y(){(c.2k||Y(){}).65(c,a)},0)}()},b.2d.2o=Y(a,b){U.3k=b,U.47.1e(a),U.49&&U.5W()},b.2d.5W=Y(){1b b,c,e,a=[];1q(b=0;b<U.47.1h;b++)a[b]=cp(U.47[b]);c="|"+a.1z("|");2c{U.49.4Z+=c,U.47.1h=0}2a(d){U.49.6t.1B("a2:a4"),e=U,45(Y(){e.5W()},0)}}),b.a5(b.a7),aS}(1J),""!=7x&&(aK=Y(a){Y b(a){U.2I=a,U.6v()}1d b.a5=Y(a){1g.3e?1g.3e("9X",Y(){1g.aT("9X",2w.3A,!1),a()},!1):1g.2Y&&(1g.2n.fo&&1J.fp==1J.1M?Y(){2c{1b b=1g.3B("7v");b.54("3L","2R/au"),b.9Z?b.9Z=Y(){a()}:b.4l=Y(){("b2"==b.4k||"75"==b.4k)&&a()}}2a(c){1d 45(2w.3A,5),1s 0}}():1g.2Y("4l",Y(){"75"===1g.4k&&(1g.9Y("4l",2w.3A),a())}))},b.a7=Y(){a.3Z=b.88()},b.2d.6v=Y(){1b a=U,b=Y(b){b.fk==a.2I&&(a.2k||Y(){}).65(a,b.fj)};1J.3e?1J.3e("6X",b,!1):1J.2Y&&1J.2Y("2k",b)},b.2d.2o=Y(a,b){U.2I.9T(a,"*"),U.3k=b},b.88=Y(){1b a,b;1d U.3k=Y(){},a=1g.3B("2t"),a.id="ff",a.1a.1T="27",a.1a.1E="0",a.1Q=7x+"/kr.av",1g.1W.6q(a,1i),b=1g.2g("ff"),1v U(b.6M)},b.fg=Y(){1d 1v U(1J.9S)},!1J.9T&&1J.2Y&&(b.2d.6v=Y(){1b a=!1;2c{a=!!U.2I.6t.5M}2a(b){}1d a?(U.2o=U.9M,U.9N(),1s 0):(U.47=[],1J.9S==U.2I?U.a0():U.aa(),1s 0)},b.2d.9N=Y(){1b a=U;1g.2Y("9Q",Y(b){b.7k&&"6X"===b.7k&&b.9P==a.2I&&(a.2k||Y(){}).65(a,b.9R)})},b.2d.9M=Y(a){1b b=U;45(Y(){1b c=b.2I.1g.fi();c.7k="6X",c.9P=1J,c.9R=a,b.2I.1g.fr("9Q",c)})},b.2d.a0=Y(){1b d,a=1g.fy(),b="1C:2L;1E:2L;4q:4n;1u:-a1;1M:-a1;",c=1g.3B("2t");c.1a.ac=b,a.6L(c),d=1g.3B("2t"),d.1a.ac=b,a.6L(d),1g.1W.6q(a,1g.1W.64),U.49=c.6M,U.3R=d.6M,U.6P()},b.2d.aa=Y(){U.49=1i,U.3R=1i;1b a=U;U.6Y=ag(Y(){a.ae()},50)},b.2d.ae=Y(){1b a,b;2c{a=U.2I[1],b=U.2I[0]}2a(c){}a&&b&&(fA(U.6Y),U.49=a,U.3R=b,U.47.1h&&U.5W(),U.6P())},b.2d.6P=Y(){1b a=U;U.6Y=ag(Y(){a.af()},50)},b.2d.af=Y(){2c{1d U.3R.4Z,1s 0}2a(a){}U.3R.6t.1B("a2:a4");1b b=U;45(Y(){b.a9()},0)},b.2d.a9=Y(){1b c,d,e,a=1i;2c{a=U.3R.4Z}2a(b){}if(a)1q(U.3R.4Z="",c=U,d=a.fs(1).2C("|"),e=0;e<d.1h;e++)!Y(){1b a=ft(d[e]);45(Y(){(c.2k||Y(){}).65(c,a)},0)}()},b.2d.2o=Y(a,b){U.3k=b,U.47.1e(a),U.49&&U.5W()},b.2d.5W=Y(){1b b,c,e,a=[];1q(b=0;b<U.47.1h;b++)a[b]=cp(U.47[b]);c="|"+a.1z("|");2c{U.49.4Z+=c,U.47.1h=0}2a(d){U.49.6t.1B("a2:a4"),e=U,45(Y(){e.5W()},0)}}),b.a5(b.a7),aK}(1J)),J.6b=Y(a){U.bL=1j+"/k4.fd",2==a&&(U.bL=7x+"/k5/kE.fd"),U.4A=[],U.5g=3X},J.6b.9K=!0,J.6b.2d={eU:Y(){1b a;1d 1J.8w?a=1v 8w("eZ.lf"):1J.eW?(a=1v eW,1i==a.4k&&(a.4k=0,a.3e("b8",Y(){a.4k=4,"Y"==21 a.4l&&a.4l()},!1))):1J.eY&&(a=1v eY),a},eS:Y(a){1b b,d;2c{1d b=1v 8w("eZ.l7"),b.l9=!1,b.la(a),b}2a(c){2c{1d d=1v lc,b=d.lk(a,"2R/ll")}2a(c){1d 1i}}},5w:Y(a,b){1i==U.4A&&(U.4A=[]),U.4A[U.4A.1h]={bJ:a,1P:b}},5v:Y(){U.4A.1h=0},5y:Y(a,b){1d U.eV(a,"9L",b)},eV:Y(a,b,c){1b d,e,f,g,i,j;if(1!=2j)1d{4c:!0,1P:"[1X]:初始化失败",9p:""};if(!J.6b.9K)1d{4c:!0,1P:"[1X]:服务端不可用",9p:""};if(d=U.eU(),"9L"==b){if(f=[],1i!=U.4A&&U.4A.1h>0)1q(g=0;g<U.4A.1h;g++)f[f.1h]=U.4A[g].bJ+"="+U.4A[g].1P;e=f.1z("&")}if("9L"==b)2c{d.cJ("9L",U.bL+"/"+a,!1),d.ls("lr-6a","ln/x-gh-lm-lo; lp=lq-8"),d.2o(e)}2a(h){1d J.6b.9K=!1,{4c:!0,1P:"[1X]:服务器异常或网络错误",9p:"gs"}}1d 1i==c?5c==d.bI?(i=U.eS(d.l5),j=i.2n.2R,1s 0==j&&(j=i.2n.dm),{4c:!1,1P:j}):(J.6b.9K=!1,{4c:!0,1P:"[1X]:"+d.bI,9p:d.bI}):""}},J.1y=Y(a){1b b,c,d,e,f;if(1i!=a)8B(b=21 a,"83"==b&&(b=3u==a.44?"f8":2U==a.44?"f1":"83"),b){2s"2p":2s"kM":1d;2s"Y":2s"kL":2s"f1":1d a.3j();2s"kH":1d kG(a)?a.3j():"1i";2s"bH":1d\'"\'+a.1B(/(\\\\|\\")/g,"\\\\$1").1B(/\\n|\\r|\\t/g,Y(){1b a=2w[0];1d"\\n"==a?"\\\\n":"\\r"==a?"\\\\r":"	"==a?"\\\\t":""})+\'"\';2s"83":if(1i===a)1d"1i";c=[];1q(d in a)e=U.1y(a[d]),1s 0!==e&&c.1e(U.1y(d)+":"+e);1d"{"+c.1z(",")+"}";2s"f8":1q(c=[],f=0;f<a.1h;f++)e=U.1y(a[f]),1s 0!==e&&c.1e(e);1d"["+c.1z(",")+"]"}},J.8Z={8W:{kK:0,dh:1,kS:2,fm:3,8L:4,f9:5,kT:6,he:7,l1:8},aH:{l2:1,l3:2,l4:3,l0:4,kZ:5,kV:6,kU:7,kW:8,kX:9,8L:10,jM:11,aC:12,f9:13,jw:14,iB:15,iC:16,iE:17,iz:18}},J.4G=Y(a,b){1b c,d,e;2c{if(1!=2j)1d a&&a(b),1s 0;if(2f.1h>0||2f.1h>0)1d a&&a(b),1s 0;c={2V:22,eB:ao},d={2A:"ek",2D:J.1y(c)},e=J.1y(d),28.2o(e),28.2k=Y(c){1b d,e,f,g,h,i,j;if(c.1O("[1X]")<0)if(2f=[],7p=[],d=J.fn.2v(c),97=d,0==d.gy&&(3C.2M=0),d){1q(7p=d.eH,72=d.eD,7h=d.dB,6x=d.dQ,7E=d.eM,2f=d.e5,7R=d.iu,e=2f.1h,f=0,g=0,h=0,i=0;e>i;i++)j=2f[i],11==j.2y&&(f=1),14==j.2y&&(g=1,h=i);!f&&g&&(2f[h].2y=11,2f[h].42="药品说明书",2f[h].7f=1),a&&a(b)}2E J.4G(a,b);2E"iw"==22.bU?3C.2M=0:"f5"==22.bU&&(3C.2Q=0),a&&a(b)}}2a(f){}},J.bN=Y(){1b a,b,c;2c{if(1==2j)1d;a={2V:22},b={2A:"iy",2D:J.1y(a)},c=J.1y(b),28.2o(c),28.2k=Y(a){if(a.1O("[1X]")<0){1b b=J.fn.2v(a);1==b&&(2j=1)}2E 2j="[1X]:5g"==a?-99:-10}}2a(d){}},5U=0,57="",7u="",6O=iF,at=iG,an=iO,ax=iP,bw=iQ,f6=iR,bS=iN,bT=iM,bW=fU,2j=0,4v=1,3H=0,6o=0,7M=1,9o=1,9i=!1,9l=!1,9q=!0,7V=!1,8p=!1,3C={2Q:""==1j?0:1,2M:""==7x?0:1},1n=1v 3u,3z=1v 3u,32=1v 3u,3c=1v 3u,2Z=1v 3u,2W=1v 3u,2f=1v 3u,7p=1v 3u,72="",7h="",7E=0,6x="",7R="",3p=1v 3u,59=1v 3u,U.gz=Y(){U.gM="",U.h2="",U.4t=1,U.4w="",U.4x="",U.4u="",U.41="",U.gR="",U.gP="",U.gO="",U.gS="",U.gT="",U.4a="",U.6C="",U.7z="",U.7A="",U.6S=0,U.2y=0,U.42="",U.35=0,U.5j="",U.5t="",U.4O="4L",U.cN="",U.iJ=1,U.gZ=""},U.f2=Y(){U.6r=81,U.it=""},ao=1v f2,U.fC=Y(){U.4H="",U.h0="",U.53="",U.cF="",U.cA="",U.3r="",U.iS="",U.io="",U.i6="",U.i5="",U.i4=J.f3()?"1":"2",U.i8="",U.ic="",U.6r=81,U.bU="f5"},22=1v fC,U.aJ=Y(){U.3D="",U.4j="",U.is="4L",U.aw=1,U.2T=0,U.8W=1,U.8M=1,U.e6="",U.e0=""},1G=1v aJ,6d=1v 3u,3y=1v 3u,U.aU=Y(){U.7H="",U.7L="",U.4R="",U.4s=0,U.8z="",U.60="",U.89="",U.8c=""},U.ie=Y(){U.4u="",U.4w="",U.4x="",U.7U="",U.aC="",U.cC="",U.cE="",U.cD="",U.2G="",U.3r="",U.3w="",U.3W="",U.4t=1,U.cO=-1,U.cY=-1,U.cX="",U.cZ=-1,U.d0=-1,U.d2="",U.6r=81,U.ah=1,U.ip="",U.iq="",U.ir=0,U.im="",U.il="",U.ih="",U.ig="",U.4J=0,U.eC=0,U.eA=0,U.eN=""},U.ii=Y(){U.41="",U.2B="",U.cW=1,U.el="4L",U.4a="",U.4m="",U.6C="",U.ij="",U.ik="",U.iK="",U.es="4L",U.9A="",U.7w="",U.jL="4L",U.7A="",U.7z="",U.9B="",U.9z="",U.9y="",U.2G="",U.3r="",U.3w="",U.3W="",U.cV="",U.6S=0,U.cQ=0,U.ju="",U.jv="",U.cR="",U.cS="",U.iT="",U.cU=0,U.7l="",U.cT="",U.cy="",U.8n="0",U.8g="0",U.8j=0,U.8m=0,U.aG="",U.aF="",U.bf="",U.b7="",U.b6=""},U.jx=Y(){U.2B="",U.jt="4L",U.ca="",U.cd="",U.c5=""},U.jr=Y(){U.41="",U.2B="",U.jn="4L",U.c8="",U.c7="",U.jm=0,U.jo=-1,U.b5="",U.b4=""},U.jp=Y(){U.2B="",U.7l="",U.bZ="",U.c1="1",U.c2="",U.c4="",U.jq=-1,U.jy=-1,U.jz=-1,U.fD=-1,U.fD=-1,U.jI="",U.jJ=-1},U.jK=Y(){U.5m="",U.5n="",U.5o="",U.5J="",U.2G="",U.3r="",U.3w="",U.3W=""},U.jG=Y(){U.5m="",U.5n="",U.5o="",U.5J="",U.2G="",U.3r="",U.3w="",U.3W=""},3y=1v 3u,U.aU=Y(){U.7H="",U.7L="",U.4R="",U.4s=0,U.8z="",U.60="",U.89="",U.8c=""},U.g8=Y(){U.4H="",U.4u="",U.4w="",U.4x="",U.41="",U.4z=2},2u=1v g8,J.46=Y(a){U.1Y=a},J.46.2d={3E:Y(){1b a,b,c,d,e,f,g,h,i,j,k;1V=5K>1V?5K:1V,1V=1V>4e?4e:1V,1R=4e>1R?4e:1R,1R=1R>3X?3X:1R,a=(1J.3d.7Y-5c-1V)/2,b=(1J.3d.8A-5c-1R)/2,a=2z>a?2z:a,b=2z>b?2z:b,c=1g.2n.3n?1g.2n.3n:1g.1W.3n,d=1g.2n.3v?1g.2n.3v:1g.1W.3v,U.1Y.1M=a+d,U.1Y.1u=b+c,9t>0&&(U.1Y.1u=9t),9s>0&&(U.1Y.1M=9s),e=U.1Y.3d,U.1Y.3d=U.1Y.3d?1:0,9q||(U.1Y.3d=0),f=["<2K><2e><1r 1c=\'9n\' 1a=\'1m-29:1w("+1j+"/1k/9m.1l);1m-1t:no-1t;\'></1r><1r><a 1c=\'8h\' id=\'4U\' 1a=\'1m-29:1w("+1j+"/1k/5X.1l);1m-1t:no-1t;\' 3a=\\"U.1a.2q=\'1w("+1j+"/1k/9h.1l)\';\\" 36=\\"U.1a.2q=\'1w("+1j+"/1k/5X.1l)\';\\" 1K=\'J.3N(",U.1Y.3d,");4V(0,0);\'></a></1r><1r 1a=\'4q:4n;1u:jA;1M:6K;3h-4P:6K;2m:4M;\'>"+6x+"</1r></2e></2K>"],0==e&&(g="jC",3X==1R&&(g="jD"),f=["<2K><2e><1r 1c=\'9n\' 1a=\'1m-29:1w("+1j+"/1k/9m.1l);1m-1t:no-1t;\'></1r><1r 1c=\'g2\'>",6x,"</1r><1r><a 1c=\'8h\' id=\'6y\' 1a=\'1m-29:1w("+1j+"/1k/"+g+".jE);1m-1t:no-1t;3O:jl;\'></a></1r><1r><a 1c=\'8h\' id=\'4U\' 1a=\'1m-29:1w("+1j+"/1k/5X.1l);1m-1t:no-1t;\' 3a=\\"U.1a.2q=\'1w("+1j+"/1k/9h.1l)\';\\" 36=\\"U.1a.2q=\'1w("+1j+"/1k/5X.1l)\';\\" 1K=\'J.3N(",U.1Y.3d,");4V(0,0);\'></a></1r></2e></2K>"]),h=["<19 1c=\'g3\'><a 1a=\'2R-g4:g5;2m:gd;5f:3i;2S:56;2S:3i;\' 1K=\'J.7O();\'>免责声明</a>&1U;&1U;&1U;&1U;服务程序版本：",7h," &1U;&1U;&1U;&1U; 数据版本：",72,"</19>","<19 1c=\'ge\' 1a=\'1m-29:1w("+1j+"/1k/gm.43);1m-1t:no-1t;\'></19>"],i=["<19 id=\'39\' 1c=\'39\' 1a=\'1C:",1R,"1o;1E:",1V,"1o;2H:27;1M:",U.1Y.1M,"1o;1u:",U.1Y.1u,"1o; z-3x:",U.1Y.z,";\' >","<19 id=\'5k\' 1a=\'1C:",1R,"1o;1m-29:1w("+1j+"/1k/bP.1l);1m-1t:1t-x;1E:bR;2S:bD;\'>",f.1z(""),"</19>","<19 id=\'2h\' 1c=\'2h\' 1a=\'1C:",1R,"1o;1E:",1V-80,"1o;2H:27;\'>",U.1Y.1W,"</19>","<19 id=\'9j\' 1c=\'9j\' 1a=\'1C:",1R,"1o;\'>",h.1z(""),"</19>","<2t id=\'3Y\' 1c=\'3Y\' 48=\'0\'></2t>","</19>"],j=[""],U.1Y.bs&&(j=["<19 id=\'3l\' 1c=\'3l\' 1a=\'z-3x:",U.1Y.bj,";9k:9u(9v=",U.1Y.bo,");\'><2t 1c=\'3Y\' 48=\'0\'></2t></19>"]),k=1g.3B("19"),k.1D=i.1z("")+j.1z(""),k.54("x-ms-j2-j1","1S"),1g.1W.5b("5a",k),J.fn.1f("3l").1a.1E=2O(1g.1W.ai)+"1o",J.fn.1f("3l").1a.1C=2O(1g.1W.9F)+"1o",J.5r.5R()},ga:Y(){1b a=8e,b=7Z,c=["<19 id=\'5k\' 1c=\'9E\' 1a=\'1m-29:1w("+1j+"/1k/9G.1l);1m-1t:1t-x;\'><19 id=\'5Q\' 1c=\'9H\' 1a=\'3S-1u:aj;2m:4M;3h-4P:6j;3h-6h:7q;1m-29:1w("+1j+"/1k/9J.1l);1m-1t:no-1t;\'>&1U;</19><a 1c=\'9I\' id=\'4U\' 1a=\'1m-29:1w("+1j+"/1k/5q.1l);1m-1t:no-1t;\' 3a=\\"U.1a.2q=\'1w("+1j+"/1k/9D.1l)\';\\" 36=\\"U.1a.2q=\'1w("+1j+"/1k/5q.1l)\';\\" 1K=\'J.3N(0);\'></a></19>","<19 id=\'2h\' 1c=\'2h\' 1a=\'1E:",a-70,"1o;1C:",b,"1o;\'><19 1c=\'6c\' 1a=\'1m-29:1w("+1j+"/1k/5B.1l);1m-1t:no-1t;\'></19></19>","<19 id=\'7P\' 1c=\'go\' ><a 1c=\'ed\' 5M=\'#\' 2X=\'\' 1K=\'J.7O();\'>免责声明</a></19>",""],d=["<19 id=\'39\' 7s=\'1d 3g\' 9C=\'1d 3g\' 8l=\'1d 3g\' 8F=\'1d 3g\' ","1a=\'-7o-7j-7g:1S;38:4B 2L #6J;1m-2m:6N;4q:4n;1C:",b,"1o;1E:",a,"1o;2H:27;1M:",U.1Y.1M,"1o;1u:",U.1Y.1u,"1o; z-3x:",6O,";\'>",c.1z(""),"<2t 1c=\'3Y\' 48=\'0\'></2t></19>"],e=1g.3B("19");e.1D=d.1z(""),1g.1W.5b("5a",e),J.5r.5R()},fK:Y(){1b e,f,g,h,i,j,a=7Z,b=5N,c=(1J.3d.7Y-5c-a)/2,d=(1J.3d.8A-5c-b)/2;c=2z>c?2z:c,d=2z>d?2z:d,e=1g.2n.3n?1g.2n.3n:1g.1W.3n,f=1g.2n.3v?1g.2n.3v:1g.1W.3v,U.1Y.1M=c+f,U.1Y.1u=d+e,g=["<19 id=\'5k\' 1a=\'1m-29:1w("+1j+"/1k/bP.1l);1m-1t:1t-x;1E:bR;2S:bD;\'><19 id=\'5Q\' 1c=\'9n\' 1a=\'3S-1u:aj;2m:4M;3h-4P:6j;3h-6h:7q;1m-29:1w("+1j+"/1k/9m.1l);1m-1t:no-1t;\'>&1U;</19><a 1c=\'8h\' 1a=\'1m-29:1w("+1j+"/1k/5X.1l);1m-1t:no-1t;\' 3a=\\"U.1a.2q=\'1w("+1j+"/1k/9h.1l)\';\\" 36=\\"U.1a.2q=\'1w("+1j+"/1k/5X.1l)\';\\" 1K=\'J.3N(0);\'></a></19>","<19 id=\'2h\' 1c=\'2h\' 1a=\'1E:",a-40,"1o;1C:",b,"1o;\'><19 1c=\'6c\' 1a=\'1m-29:1w("+1j+"/1k/5B.1l);1m-1t:no-1t;\'></19></19>"],h=["<19 id=\'39\' 7s=\'1d 3g\' 9C=\'1d 3g\' 8l=\'1d 3g\' 8F=\'1d 3g\' ","1a=\'-7o-7j-7g:1S;38:4B 2L #6J;1m-2m:6N;4q:4n;1C:",b,"1o;1E:",a,"1o;2H:27;1M:",U.1Y.1M,"1o;1u:",U.1Y.1u,"1o; z-3x:",bW,";\'>",g.1z(""),"<2t 1c=\'3Y\' 48=\'0\'></2t></19>"],i=["<19 id=\'3l\' 1c=\'3l\' 1a=\'z-3x:",bT,";9k:9u(9v=0);\'><2t 1c=\'3Y\' 48=\'0\'></2t></19>"],j=1g.3B("19"),j.1D=h.1z("")+i.1z(""),1g.1W.5b("5a",j),J.fn.1f("3l").1a.1E=2O(1g.1W.ai)+"1o",J.fn.1f("3l").1a.1C=2O(1g.1W.9F)+"1o",J.5r.5R()},gk:Y(){1b e,f,g,h,i,j,a=9b,b=1==U.1Y.7Q?j0:8e,c=(1J.3d.7Y-5c-a)/2,d=(1J.3d.8A-5c-b)/2;c=2z>c?2z:c,d=2z>d?2z:d,e=1g.2n.3n?1g.2n.3n:1g.1W.3n,f=1g.2n.3v?1g.2n.3v:1g.1W.3v,U.1Y.1M=c+f,U.1Y.1u=d+e,g=["<19 id=\'5k\' 1c=\'9E\' 1a=\'1m-29:1w("+1j+"/1k/9G.1l);1m-1t:1t-x;\'><19 id=\'5Q\' 1c=\'9H\' 1a=\'3S-1u:aj;2m:4M;3h-4P:6j;3h-6h:7q;1m-29:1w("+1j+"/1k/9J.1l);1m-1t:no-1t;\'>&1U;</19><a 1c=\'9I\' id=\'4U\' 1a=\'1m-29:1w("+1j+"/1k/5q.1l);1m-1t:no-1t;\' 3a=\\"U.1a.2q=\'1w("+1j+"/1k/9D.1l)\';\\" 36=\\"U.1a.2q=\'1w("+1j+"/1k/5q.1l)\';\\" 1K=\'J.3N(0);\'></a></19>","<19 id=\'2h\' 1c=\'2h\' 1a=\'1E:",a-40,"1o;1C:",b,"1o;\'><19 1c=\'6c\' 1a=\'1m-29:1w("+1j+"/1k/5B.1l);1m-1t:no-1t;\'></19></19>"],h=["<19 id=\'39\' 7s=\'1d 3g\' 9C=\'1d 3g\' 8l=\'1d 3g\' 8F=\'1d 3g\' ","1a=\'-7o-7j-7g:1S;38:4B 2L #6J;1m-2m:6N;4q:4n;1C:",b,"1o;1E:",a,"1o;2H:27;1M:",U.1Y.1M,"1o;1u:",U.1Y.1u,"1o; z-3x:",bS,";\'>",g.1z(""),"<2t 1c=\'3Y\' 48=\'0\'></2t></19>"],i=["<19 id=\'3l\' 1c=\'3l\' 1a=\'z-3x:",ax,";9k:9u(9v=0);\'><2t 1c=\'3Y\' 48=\'0\'></2t></19>"],j=1g.3B("19"),j.1D=h.1z("")+i.1z(""),1g.1W.5b("5a",j),J.fn.1f("3l").1a.1E=2O(1g.1W.ai)+"1o",J.fn.1f("3l").1a.1C=2O(1g.1W.9F)+"1o",J.5r.5R()},hK:Y(){1b a,b,c,d,e,f,g,h,i;1V=5K>1V?5K:1V,1V=1V>4e?4e:1V,1R=4e>1R?4e:1R,1R=1R>3X?3X:1R,a=(1J.3d.7Y-5c-1V)/2,b=(1J.3d.8A-5c-1R)/2,a=2z>a?2z:a,b=2z>b?2z:b,c=1g.2n.3n?1g.2n.3n:1g.1W.3n,d=1g.2n.3v?1g.2n.3v:1g.1W.3v,U.1Y.1M=a+d,U.1Y.1u=b+c,9t>0&&(U.1Y.1u=9t),9s>0&&(U.1Y.1M=9s),e=["<2K><2e><1r 1c=\'9n\' 1a=\'1m-29:1w("+1j+"/1k/9m.1l);1m-1t:no-1t;\'></1r><1r 1c=\'g2\'>",6x,"</1r><1r><a 1c=\'8h\' 1a=\'1m-29:1w("+1j+"/1k/5X.1l);1m-1t:no-1t;\' 3a=\\"U.1a.2q=\'1w("+1j+"/1k/9h.1l)\';\\" 36=\\"U.1a.2q=\'1w("+1j+"/1k/5X.1l)\';\\" 1K=\'J.3N(",U.1Y.3d,");4V(0,0);\'></a></1r></2e></2K>"],f=["<19 1c=\'g3\'><a 1a=\'2R-g4:g5;2m:gd;5f:3i;2S:56;2S:3i;\' 1K=\'J.7O();\'>免责声明</a>&1U;&1U;&1U;&1U;服务程序版本：",7h," &1U;&1U;&1U;&1U; 数据版本：",72,"</19>","<19 1c=\'ge\' 1a=\'1m-29:1w("+1j+"/1k/gm.43);1m-1t:no-1t;\'></19>"],g=["<19 id=\'39\' 1c=\'39\' 1a=\'-7o-7j-7g: -7o-8o;-je-7j-7g: 2R;1C:",1R,"1o;1E:",1V,"1o;2H:27;1M:",U.1Y.1M,"1o;1u:",U.1Y.1u,"1o; z-3x:",an,";\' >","<19 id=\'5k\' 1a=\'1C:",1R,"1o;1m-29:1w("+1j+"/1k/bP.1l);1m-1t:1t-x;1E:bR;2S:bD;\'>",e.1z(""),"</19>","<19 id=\'2h\' 1c=\'2h\' 1a=\'1C:",1R,"1o;1E:",1V-80,"1o;2H:27;\'>",U.1Y.1W,"</19>","<19 id=\'9j\' 1c=\'9j\' 1a=\'1C:",1R,"1o;\'>",f.1z(""),"</19>","<2t id=\'3Y\' 1c=\'3Y\' 48=\'0\'></2t>","</19>"],h=["<19 id=\'3l\' 1c=\'3l\' 1a=\'z-3x:",at,";9k:9u(9v=0);\'><2t 1c=\'3Y\' 48=\'0\'></2t></19>"],i=1g.3B("19"),i.1D=g.1z("")+h.1z(""),1g.1W.5b("5a",i),J.fn.1f("3l")&&(J.fn.1f("3l").1a.1E=2O(1g.1W.ai)+"1o",J.fn.1f("3l").1a.1C=2O(1g.1W.9F)+"1o"),J.5r.5R()},eL:Y(){1b e,a=8e,b=7Z,c=["<19 id=\'5k\' 1c=\'9E\' 1a=\'1m-29:1w("+1j+"/1k/9G.1l);1m-1t:1t-x;\'><19 1c=\'9H\' 1a=\'1m-29:1w("+1j+"/1k/9J.1l);1m-1t:no-1t;\'>&1U;</19><a 1c=\'9I\' id=\'4U\'  1a=\'1m-29:1w("+1j+"/1k/5q.1l);1m-1t:no-1t;\' 3a=\\"U.1a.2q=\'1w("+1j+"/1k/9D.1l)\';\\" 36=\\"U.1a.2q=\'1w("+1j+"/1k/5q.1l)\';\\" 1K=\'J.5H.7Q(0);\'></a></19>","<19 id=\'2h\' 1c=\'2h\' 1a=\'1E:",a-70,"1o;1C:",b,"1o;\'><19 1c=\'6c\' 1a=\'1m-29:1w("+1j+"/1k/5B.1l);1m-1t:no-1t;\'></19></19>","<19 id=\'7P\' 1c=\'go\'></19>","<19 id=\'fL\' 1a=\'4q:4n;3O:2L;96:2L;2S:nw-nU;\' 33=\'拖动改变窗体大小\'>&1U;</19>"],d=["<19 id=\'39\' ","1a=\'38:4B 2L #6J;1m-2m:6N;4q:4n;1C:",b,"1o;1E:",a,"1o;2H:27;1M:",U.1Y.1M,"1o;1u:",U.1Y.1u,"1o; z-3x:",6O,";\'>",c.1z(""),"<2t 1c=\'3Y\' 48=\'0\'></2t></19>"];7V&&(d=["<19 id=\'39\'","1a=\'38:4B 2L #6J;1m-2m:6N;4q:4n;1C:",b,"1o;1E:",a,"1o;2H:27;1M:",U.1Y.1M,"1o;1u:",U.1Y.1u,"1o; z-3x:",6O,";\'>",c.1z(""),"<2t 1c=\'3Y\' 48=\'0\'></2t></19>"]),e=1g.3B("19"),e.1D=d.1z(""),1g.1W.5b("5a",e),J.5r.5R()},cg:Y(){1b c,d,e,a=8J,b=nP;U.1Y.1u=1J.3d.8A-nS-b,U.1Y.1M=1J.3d.7Y-o1-a,c=["<19 id=\'5k\' 1c=\'9E\' 1a=\'1m-29:1w("+1j+"/1k/9G.1l);1m-1t:1t-x;\'><19 id=\'5Q\' 1c=\'9H\' 1a=\'3S-1u:bY;2m:4M;3h-4P:6j;3h-6h:7q;1m-29:1w("+1j+"/1k/9J.1l);1m-1t:no-1t;\'></19><a 1c=\'9I\' id=\'4U\' 1a=\'1m-29:1w("+1j+"/1k/5q.1l);1m-1t:no-1t;\' 3a=\\"U.1a.2q=\'1w("+1j+"/1k/9D.1l)\';\\" 36=\\"U.1a.2q=\'1w("+1j+"/1k/5q.1l)\';\\" 1K=\'J.3N(0);\'></a></19>","<19 id=\'2h\' 1c=\'2h\' 1a=\'1E:",a,"1o;1C:",b,"1o;\'><19 1c=\'6c\' 1a=\'1m-29:1w("+1j+"/1k/5B.1l);1m-1t:no-1t;\'></19></19>"],d=["<19 id=\'39\' 7s=\'1d 3g\' 9C=\'1d 3g\' 8l=\'1d 3g\' 8F=\'1d 3g\' ","1a=\'-7o-7j-7g:1S;38:4B 2L #6J;1m-2m:6N;4q:4n;1C:",b,"1o;1E:",a,"1o;2H:27;1M:",U.1Y.1M,"1o;1u:",U.1Y.1u,"1o; z-3x:",6O,";\'>",c.1z(""),"<2t 1c=\'3Y\' 48=\'0\'></2t></19>"],e=1g.3B("19"),e.1D=d.1z(""),1g.1W.5b("5a",e),J.5r.5R()}},J.bQ=Y(){1b a=J.fn.1f("4U");a&&(a.1a.1Z="1S")},J.nz=Y(){1b a=J.fn.1f("4U");a&&(a.1a.1Z="7a")},J.6Z=Y(a){1b c,b=J.fn.1f("39");b&&b.4X&&1g.1W.ex(b.4X),c=J.fn.1f("71"),c&&(c.1a.1Z="1S"),8p&&1!=a&&(1R=9x,1V=9w)},J.3N=Y(a){1d a&&J.7B?(J.6Z(),J.7B(),1s 0):(a?0==4v?J.dk(Y(a){1b b,c;1d 0==a?(b=1J.5s||2w.3A.5p.2w[0],c="需要填写理由的问题还未填写完，请填写！",J.du(b,c,1),1s 0):(J.6Z(),J.3K&&""!=J.3K&&"Y"==21 J.3K&&J.3K(J.2r,a),1s 0)}):(J.6Z(),J.3K&&""!=J.3K&&"Y"==21 J.3K&&J.dk(Y(a){J.3K(J.2r,a)})):J.6Z(),1s 0)},J.6f=Y(a){"nt"==J.fn.1f("39").1a.1C?(8p=!1,1R=9x,1V=9w):(9x=1R,9w=1V,8p=!0,1R=3X,1V=5N),J.6Z(1);1b b=1v J.8k;b.3E(),6w="","2p"==21 a?J.67(11):J.67(a),1g.1W.3e?1g.2g("6y").3e("8v",Y(){J.6f(a),4V(0,0)}):1g.2g("6y").2Y("1K",Y(){J.6f(a),4V(0,0)})},J.du=Y(a,b){1b d=["<19 1a=\'3S:5e 2L 2L 94;3o:1u;\'><2J 1Q=\'"+1j+"/1k/nq.1l\'/></19>","<19 1a=\'3S:5e 2L 2L nr;8x-1H:8U;\'>",b,"</19>","<br/><19 1a=\'2R-1H:4r;\'><a 1K=\'J.3N(0);\'><2J 1Q=\'"+1j+"/1k/8R.1l\' 3a=\\"U.1Q=\'"+1j+"/1k/gv.1l\';\\" 36=\\"U.1Q=\'"+1j+"/1k/8R.1l\';\\" 1a=\'5f:3i;2S:56;2S:3i;\' 38=\'gU\'/></a></19>"],e=1v J.46({1M:a.5P,1u:a.5L});e.gk(),J.fn.1f("2h").1D=d.1z("")},J.7O=Y(){1b a=[\'<19 1a="3Q:5e;3h-gf: 微软雅黑,宋体,gg;"><p 1H="4r" 1a="3h-4P:nB; 3h-6h:7q; 2m:#nJ; ">免责声明</p>\',\'<p 1a="2R-6R:8y;">在您（用户）安装和使用该系统之前，请您（用户）仔细阅读本协议书，一旦您（用户）安装该系统，表明您（用户）已经接受本协议书的所有条款。 </p>\',\'<p 1a="2R-6R:8y;">1、四川美康医药软件研究开发有限公司（以下简称“美康公司”）自主开发的所有合理用药相关系统（含合理用药监测系统、2Q药师审方干预系统、2Q临床药学管理系统、合理用药信息支持系统、医院处方集管理系统，以下简称“系统”）所包含的信息可以协助医生、药师和其它医疗专业人员处理在药物治疗中遇到的问题。但是，“系统”提供的一切文本、图像信息仅供作为咨询信息使用，并不能代替上述医疗专业人员在临床工作中作出治疗判断或决定。</p>\',\'<p 1a="2R-6R:8y;">2、“系统”所包含的信息来源于临床和基础研究专著、论文和临床报道，是由美康公司对文献进行科学评估，经专家学术委员会审定而成，全部工作经过中国国家药典委员会、国家药品评价中心的共同监制。然而，美康医药软件研究开发有限公司以及中国国家药典委员会和国家药品评价中心对“系统”中所包含的所有信息可能导致的后果、信息的正确性、准确性和可靠性（无论是明确证明或是暗示），以及无论用于何种目的，均不承担任何法律责任。</p>\',\'<p 1a="2R-6R:8y;">3、美康公司无意向用户、任何企业或个人推荐或诱导使用或研究“系统”中以各种形式收载的所有药品，也不推荐或支持任何特定的检验、观点或其他信息。</p>\',\'<p 1a="2R-6R:8y;">4、“系统”提供对用户数据的权限保护功能，美康公司保证不非法泄露、传播用户数据。但是，对于非美康公司因素导致的用户数据泄露以及由此引起的所有直接和间接后果，美康公司均不承担任何法律责任。</p>\',\'<2K 1a="2R-6R:94; 3h-4P:6j; 3h-gf: 微软雅黑,宋体,gg; ">\',\'<2e><1r hs="2" 1H="1u">四川美康医药软件研究开发有限公司</1r></2e>\',\'<2e><1r 1H="1u">售后服务热线： dr-dt-dw</1r><1r 1H="1u">传 真：nH-nD</1r></2e>\',\'<2e><1r 1H="1u">电子信箱：nC@gj.g1.cn</1r><1r 1H="1u">公司网址：gh.gj.g1.cn</1r></2e>\',"</2K>","</19>"],b=1v J.46({});b.fK(),J.fn.1f("2h").1D=a.1z(""),J.fn.1f("5Q").1D="",J.fn.1f("39").1a.1E="or",J.fn.1f("2h").1a.1E="oU"},J.5r={5R:Y(){Y l(){1d 1J.5s||2w.3A.5p.2w[0]}1b m,a=J.fn.1f("39"),b=J.fn.1f("5k"),c=1g.2n.am?1g.2n.am:1g.1W.am,d=1g.2n.7W?1g.2n.7W:1g.1W.7W,e=1g.2n.3n?1g.2n.3n:1g.1W.3n,f=1g.2n.3v?1g.2n.3v:1g.1W.3v,g=0,h=0,i=0,j=0,k=!1;b.aA=Y(){1b b=l();k=!0,g=b.5L,h=b.5P,i=2O(a.1a.1M),j=2O(a.1a.1u),J.7t()&&U.fM(),1g.fN=Y(){1b b,e,f;k&&(b=l(),e=j+b.5L-g,f=i+b.5P-h,e>0&&c>e&&f>0&&d>f&&(a.1a.1u=e+"1o",a.1a.1M=f+"1o"))},1g.fE=Y(){k&&(k=!1,J.7t()&&U.fF())}},m=J.fn.1f("fL"),m&&(m.aA=Y(){1b b=l();k=!0,g=b.5L,h=b.5P,i=2O(a.1a.1M),j=2O(a.1a.1u),J.7t()&&U.fM(),1g.fN=Y(){1b b,c,d,g;k&&(b=l(),c=b.5P-i+f,d=b.5L-j+e,c=8e>c?8e:c,c=c>8J?8J:c,d=7Z>d?7Z:d,d=d>5N?5N:d,a.1a.1C=d+"1o",a.1a.1E=c+"1o",g=J.fn.1f("2h"),g.1a.1E=c-70+"1o",g.1a.1C=d+"1o",J.fn.1f("7P")&&"27"==J.fn.1f("7P").1a.1T&&(g.1a.1E=c-30+"1o"))},1g.fE=Y(){k&&(k=!1,J.7t()&&U.fF())}})}},J.8k=Y(){},J.8k.2d={bt:0,3E:Y(){1b a,b;1V=5K>1V?5K:1V,1V=1V>4e?4e:1V,1R=5N>1R?5N:1R,1R=1R>3X?3X:1R,a=["<19 1c=\'bz\' id=\'p6\' 1a=\'1C:",1R,"1o;\'>",U.fG(),"</19>","<19 1c=\'bz\' id=\'6e\' 1a=\'1C:",1R,"1o;1E:",1V-cP,"1o;\'><19 1c=\'5x\'></19></19>"],b=1v J.46({bs:!0,z:bw,1W:a.1z(""),bj:ax,bo:10,3d:0}),b.3E(),J.5d(U.bt)},fG:Y(){1b d,e,f,g,h,i,j,k,l,m,n,o,a=1G.2T,b=2f.1h,c=0;1q(d=0;b>d;d++)e=2f[d].7f,f=3p[d],0==d&&1==3p[1]&&(e=1,f=1),e>0&&f>0&&c++;1q(g=[],g.1e("<2K 1a=\'1m-2m:4M;1C:2z%;1E:8T;38-96:2L 4B #p3;\' 6F=\'0\' 6E=\'0\'><2e>"),h=!0,1R>90*c&&(h=!1),h&&g.1e(\'<1r 1a=\\\'3S-1u:79;\\\'><2J aA="J.5d(-2z);" 3a="J.5d(-50);" 1a="5f:3i;2S:56;2S:3i;" 36="J.5d(0);U.1Q=\\\'\'+1j+\'/1k/fH.43\\\';" 1Q="\'+1j+\'/1k/fH.43"/></1r>\'),g.1e("<1r><19 id=\'bx\' 1a=\'1C:",1R-50,"1o;2H:27;\'>"),g.1e("<2K 6F=\'0\' 6E=\'0\' 1a=\'1C:"+90*c+"1o;\'><2e 1a=\'1m-2m:4M;3h-4P:6j;\'>"),i=1,j=0;b>j;j++)f=3p[j],e=2f[j].7f,0==j&&1==3p[1]&&(e=1,f=1),e>0&&f>0&&(k=2f[j].2y,l=2f[j].42,m="fW",n="",o="",k==a&&(n="fX",o="1m-29:1w("+1j+"/1k/fY.43);",m="4M",U.bt=90*i>1R?90*i-1R:0),g.1e("<1r id=\'"+k+"\' 1c=\'"+n+"\' 1a=\'"+o+"1C:78;2R-1H:4r;\'><a 1a=\'2m:"+m+";5f:3i;2S:56;2S:3i;\' 2X 1K=\\"J.fP("+k+");J.8Q = 0;J.67("+2f[j].2y+\');">\'+l+"</a></1r>"),c>i&&g.1e("<1r><2J 1Q=\'"+1j+"/1k/oK.43\' 38=\'0\' 1H=\'al\'/></1r>"),i++);1d g.1e("</2e></2K>"),g.1e("</19></1r>"),h&&g.1e("<1r 1a=\'1C:94;\'><2J aA=\\"J.5d(2z);\\" 3a=\\"J.5d(50);\\" 1a=\'5f:3i;2S:56;2S:3i;\' 36=\\"J.5d(0);U.1Q=\'"+1j+"/1k/fO.43\';\\" 1Q=\'"+1j+"/1k/fO.43\'/></1r>"),g.1e("</2e></2K>"),g.1z("")}},J.fP=Y(a){1b e,b=1g.2g(a),c=b.4X,d=c.ay;1q(e=0;e<d.1h;e++)d[e].1N="",d[e].1a.2q="",d[e].ay[0].1a.2m="fW";b.1N="fX",b.1a.2q="1w("+1j+"/1k/fY.43)",b.ay[0].1a.2m="4M"},J.5d=Y(a){aD=a,0!=aD&&J.fn.1f("bx")&&(J.fn.1f("bx").3n+=aD,45("J.5d(aD)",10))},J.9e=Y(){},J.9e.2d={3E:Y(){1b a,b,c;1V=5K>1V?5K:1V,1V=1V>4e?4e:1V,1R=5N>1R?5N:1R,1R=1R>3X?3X:1R,a=["<19 id=\'aR\' 1a=\'1E:",1V-ow,"1o;1C:",1R-0,"1o;\'></19>"],b=["<19 id=\'ox\' 1c=\'bz\' 1a=\'1C:",1R-0,"1o;\'>",a.1z(""),"</19>"],c=1v J.46({bs:!0,z:an,1W:b.1z(""),bj:at,bo:10,3d:1}),c.3E()}},7y=!1,J.oz=Y(){1b b,c,d,e,a=5U;if(!(0>=a))if(b=J.fn.1f("7y"),U.7y)1q(b.1N="oy",b.1a.2q="1w("+1j+"/1k/fZ.1l)",b.3a=Y(){b.1a.2q="1w("+1j+"/1k/oA.1l)"},b.36=Y(){b.1a.2q="1w("+1j+"/1k/fZ.1l)"},U.7y=!1,c=1;a>=c;c++)d=J.fn.1f("ba"+c),e=J.fn.1f("bc"+c).1a,e.1Z="",e.1T="2x",d.1Q=1j+"/1k/df.1l",d.33="折叠";2E 1q(b.1N="oC",b.1a.2q="1w("+1j+"/1k/fV.1l)",b.3a=Y(){b.1a.2q="1w("+1j+"/1k/nE.1l)"},b.36=Y(){b.1a.2q="1w("+1j+"/1k/fV.1l)"},U.7y=!0,c=1;a>=c;c++)d=J.fn.1f("ba"+c),e=J.fn.1f("bc"+c).1a,e.1Z="1S",e.1T="27",d.1Q=1j+"/1k/hM.1l",d.33="展开"},J.hV=Y(a,b){1b c,d,e,f,g,h,i,j;2c{if(1!=2j)1d;if(1g.7s=Y(){1d!1},c=1J.5s||2w.3A.5p.2w[0],a&&2!=c.m8)1d!1;d=J.fn.1f("71"),d&&(d.1a.1Z="1S"),e=["<19 id=\'71\' 1a=\'1Z:1S;z-3x:fU;4q:4n;1C:aj;\' 7s=\'1d 3g\' 8l=\'1d 3g\' 8F=\'1d 3g\'>","<bV id=\'bK\'></bV></19>"],f=1g.3B("19"),f.1D=e.1z(""),1g.1W.5b("5a",f),g=[1g.2n.et,1g.2n.az],h=[1g.2n.3v,1g.2n.3n],i=1g.2g("71"),i.1a.1M="2p"==21 5D?c.5P+"1o":5D.fT+h[0]+"1o",i.1a.1u="2p"==21 5D?c.5L+"1o":5D.gp+h[1]+"1o",j=aB=0,j=g[0]-i.et+h[1],aB=g[1]-i.az+h[0],i.mg>aB&&(i.1a.1M=aB+"1o"),i.mh>j&&(i.1a.1u=j+"1o"),i.be=Y(){i.1a.1Z="1S"},1g.1K=Y(){i.1a.1Z="1S"},1g.1W.1K=Y(){i.1a.1Z="1S"},6w="",J.4G(J.dO,b)}2a(k){}},J.dE=Y(){Y d(a){1b c,d,b=98;1q(i=0;i<a.dX.1h;i++)c=a.dX[i],d=c.am-2*2O(c.dU?c.dU["dT"]:lY(c,1i)["dT"]),d>b&&(b=d)}1b a=1g.2g("71"),b=a.5V("bV"),c=a.5V("li");1q(a.1a.1Z="7a",d(b[0]),i=0;i<c.1h;i++)c[i].3a=Y(){U.1N+=" dZ"},c[i].36=Y(){U.1N=U.1N.1B(/s?dZ/,"")}},J.dK=Y(a){1b b,c,d,e,f,g,h,i,j,k,l,m,n,o,p,q;2c{1q(b="",c="",d="",e=2f.1h,f=0;e>f;f++)g=3p[f],h=2f[f],i=h.7f,j=h.42,51==h.2y&&a&&(c+=g>0||3p.1h>=f+1&&3p[f+1]>0?"<li ><a 1a=\'2m: #9f\' 1K=\'J.aP(51)\'>"+j+"</a></li>":"<li><a 1a=\'2m:#ar\'>"+j+"</a></li>"),i>0&&(d+=g>0?"<li 1c=\'ok\'><a 1a=\'2m: #9f\'>"+j+"</a></li>":0==f?1==3p[1]?"<li 1c=\'ok\'><a 1a=\'2m: #9f\'>"+j+"</a></li>":"<li><a 1a=\'2m:#ar\'>"+j+"</a></li>":"<li><a 1a=\'2m:#ar\'>"+j+"</a></li>");1q(b=c+d,a&&(k=1G.3D,l=1G.e0,m=1G.e6,b+=""==m?"<li ><a 1a=\'2m: #ar\'  dC=\'cH\'>dD</a></li>":"<li ><a 1a=\'2m: #9f\' 5M=\'"+m+"/lA.lz?lB=1&bJ="+l+"&lD="+k+"\' dC=\'cH\'>dD</a></li>"),1g.2g("bK").1D=b,J.dE(),n=1g.2g("bK").ay,o=0;o<n.1h;o++)p=Y(a){1d Y(){J.aP(q(a)),1g.2g("71").1a.1Z="1S"}},"ok"==n[o].1N&&(1J.3e?a?n.aE(o).64.3e("8v",p(o-1),!1):n.aE(o).64.3e("8v",p(o),!1):1J.2Y&&(a?n.aE(o).64.2Y("1K",p(o-1)):n.aE(o).64.2Y("1K",p(o))));q=Y(a){1b e,f,g,h,b=0,c=0,d=2f.1h;1q(e=0;d>e;e++)if(f=2f[e],g=f.7f,h=f.2y,g>0){if(a==c){b=h;2i}c++}1d b}}2a(r){}},J.aP=Y(a){1b b,c;1G.2T=a,b={2V:22,5Z:1G},2N=J.1y(b),51==a?J.5H.3E():(c=1v J.8k,c.3E(),1g.1W.3e?1g.2g("6y").3e("8v",Y(){J.6f(a),4V(0,0)}):1g.2g("6y").2Y("1K",Y(){J.6f(a),4V(0,0)}),J.67(a))},J.dO=Y(a){1b b,c,d;2c{1G.2T=0,b={2V:22,5Z:1G},2N=J.1y(b),c={2A:"8u",2D:2N},d=J.1y(c),28.2o(d),28.2k=Y(b){1b c,d,e,f;if(b.1O("[1X]")<0&&(J.2P(4T,b,6s),c=J.fn.2v(b),c&&(d=c.73))){1q(e=d.1h,3p=1v 3u,f=0;e>f;f++)3p[3p.1h]=d.ad(f,1);J.dK(a)}}}2a(e){}},J.dG=Y(a){1==2j&&(J.ez=a,J.8Q=1,J.4G(J.eO))},J.ea=Y(a){1b b,c;1G.2T=a,b={2V:22,5Z:1G},2N=J.1y(b),c=1v J.8k,c.3E(),J.67(a),1g.1W.3e?1g.2g("6y").3e("8v",Y(){J.6f(a),4V(0,0)}):1g.2g("6y").2Y("1K",Y(){J.6f(a),4V(0,0)})},J.eO=Y(){1b a,b,c;2c{1G.2T=0,a={2V:22,5Z:1G},2N=J.1y(a),b={2A:"8u",2D:2N},c=J.1y(b),28.2o(c),28.2k=Y(a){1b b,c,d;if(a.1O("[1X]")<0){1q(J.2P(4T,a,6s),b=J.fn.2v(a).73,c=b.1h,3p=1v 3u,d=0;c>d;d++)3p[3p.1h]=b.ad(d,1);J.ea(J.ez)}}}2a(d){}},J.5H={6u:1i,3E:Y(a,b){if(J.fn.1f("2h")&&J.3N(),U.6u&&U.7Q(),2==2w.1h)U.6u=1v J.46({1M:b,1u:a});2E{1b c=1J.5s||2w.3A.5p.2w[0];U.6u=1v J.46({1M:c.5P,1u:c.5L})}J.4G(J.gq)},7Q:Y(){1b a,b,c;1i!=U.6u&&(a=J.fn.1f("39"),a&&(b=a.4X,c=b.4X,c.ex(b)),U.6u=1i)}},J.gq=Y(){1b a,b,c;1G.2T=51,J.7S(),J.cz(),a={2V:22,5Z:1G},2N=J.1y(a),J.2P(hm,2N,85),b={2A:"8u",2D:2N},c=J.1y(b),28.2o(c),28.2k=Y(a){a.1O("[1X]")<0&&(3q=a,J.2P(4T,3q,6s),J.ey())}},J.ey=Y(){1b a,b,c,d,e,f,g,h,i,j,k,l,m,n,o;2c{if(a=J.fn.2v(3q),b=a.7H,c=a.7L,d=a.5z,d.1h>0){if(e=[],f=[],g=d[0],g.ap.1h>0&&e.1e([J.en(g.ap,b,c)].1z("")),h="",i=g.e7,i.1h>0)1q(j=i.2C(b),k=0;k<j.1h;k++)l=j[k].2C(c),m=l[0],n=l[1],m.1B(/(^\\s*)|(\\s*$)/g,"").1h>0&&(h+=\'<2l 1c="nh"><2J 1Q=\\\'\'+1j+"/1k/mc"+m+".1l\' 33=\'"+n+"\' 38=\'0\' 1H=\'al\' /></2l>");o=!1,h.1h>0&&(e.1h>0?f.1e(h):(e.1e(h),o=!0)),U.5H.6u.eL(),J.fn.1f("2h").1D=e.1z(""),J.fn.1f("7P").1D=f.1z("")+\' <a 1c="ed" 5M="#" 2X 1K="J.7O();">免责声明</a>\\r\\n\',0==f.1h,o&&(J.fn.1f("39").1a.1E="nd")}}2a(p){}},J.en=Y(a,b,c){1b d,e,f,g,h,i,j;if(a.1h<=0)1d"";1q(d=[],e=a.2C(b),f=0;f<e.1h;f++)g=e[f].2C(c),h=g[1],""!=h&&(i="mT"+f,j="mC"+f,d.1e("<2K 1c=\'hp\'><2e>"),d.1e("<1r 1c=\'mB\'><2J 1Q=\'"+1j+"/1k/mD.1l\' 1H=\'al\' />&1U;"+g[0]+"</1r>"),d.1e("<1r 1a=\'2R-1H:3O;3S-3O:6K;\'><2J id=\'",i,"\' 1Q=\'"+1j+"/1k/df.1l\' 1a=\'5f:3i;2S:56;2S:3i;\' 1K=\\"J.8S(\'",i,"\',\'",j,"\')\\" 33=\'折叠\' mE=\'0\' 1H=\'al\'/></1r>"),d.1e("</2e></2K>"),d.1e("<19 id=\'",j,"\' 1c=\'mA\' 1a=\'1T:2x;\'>"),d.1e(h+"</19>"));1d"<19 1c=\'mz\'>"+d.1z("")+"</19>"},J.cl=Y(){1b a,b;2c{if(2f.1h>0||2f.1h>0)1d;a={2V:22,eB:ao},b=1v 4S,b.5v(),b.5w("68",J.1y(a)),J.aO(b.5y("ek",1i,J.aO))}2a(c){}},J.aO=Y(a){1b b,c,d,e,f,g,h;if(a.1P.1O("[1X]")<0&&(2f=[],7p=[],b=J.fn.2v(a.1P))){1q(7p=b.eH,72=b.eD,7h=b.dB,6x=b.dQ,2f=b.e5,7E=b.eM,c=2f.1h,d=0,e=0,f=0,g=0;c>g;g++)h=2f[g],11==h.2y&&(d=1),14==h.2y&&(e=1,f=g);!d&&e&&(2f[f].2y=11,2f[f].42="药品说明书",2f[f].7f=1)}},J.e1=Y(a){1b b,c,d,e,f,g;1!=3H&&(b=J.6A(),c=J.6H(),0>=b&&0>=c&&(-10!=J.2r&&(J.2r=-10),2j>0&&(2j=-10)),0>=2j||(3H=1,J.4W=1,1s 0!=a&&(J.4W=a),J.cl(),5U=0,J.7S(),J.cB(),J.d1(),J.cx(),J.c9(),J.c0(),J.c3(),J.cf(),d=J.8N(),e={2V:22,6T:1x,cq:{cw:3z},6Q:{6U:32},ev:{eI:3c},5F:{5O:1n},d4:{cu:d}},1L=J.1y(e),J.aI(e),J.2P(eG,"病人信息："+J.1y(1x),eJ),J.2P(eF,"处方："+J.1y(1n),dJ),J.2P(dI,"过敏史："+J.1y(3z),dL),J.2P(dN,"诊断："+J.1y(32),dF),J.2P(dz,"手术："+J.1y(3c),e9),1L=1L.1B(/\\%/g,"%25"),1L=1L.1B(/\\+/g,"%2b"),1L=1L.1B(/\\s/g,"%20"),1L=1L.1B(/&dl;/g,"%26"),1L=1L.1B(/&/g,"%26"),1L=1L.1B(/@/g,"%40"),1L=1L.1B(/\\//g,"%2F"),1L=1L.1B(/\\?/g,"%3F"),1L=1L.1B(/\\#/g,"%23"),1L=1L.1B(/\\$/g,"%24"),f=1v 4S(1),6o=0,g="92",b=J.6A(),c=J.6H(),1==b&&1==c?(g="e3",f=1v 4S(2),6o=1):0==b&&1==c&&(g="mK",f=1v 4S(2),6o=1),f.5v(),f.5w("68",1L),aN(f.5y(g,1i,aN))))},J.8N=Y(){1b b,c,d,e,a=[];1q(a.1e({3L:"mM",kY:"1"}),a.1e({3L:"mS",bA:1x.4J}),a.1e({3L:"mG",mu:1x.eC+"",mF:1x.eA+"",nj:1x.eN,n1:1x.lR}),b=0;b<1n.1h;b++)c=1n[b],1s 0!=c&&1i!=c&&(c.8j&&c.8j>0?(a.1e({3L:"lQ",3x:c.2B,lW:c.41,lC:c.el,lH:c.4a,mj:c.4m,m5:c.6C,m6:c.es,nk:c.9A,oB:c.7w}),1n.oF(b,1),b--):a.1e({3L:"oG",3x:c.2B,8n:c.8n,8g:c.8g,8m:c.8m+"",aG:c.aG,aF:c.aF,bf:c.bf,b7:c.b7,b6:c.b6}));1q(b=0;b<32.1h;b++)d=32[b],a.1e({3L:"oP",3x:d.2B,b5:d.b5,b4:d.b4});1q(b=0;b<2Z.1h;b++)e=2Z[b],a.1e({3L:"of",ee:e.5m,ec:e.5n,ef:e.5o,eg:e.5J,52:e.2G,ej:e.3r,co:e.3w,ei:e.3W});1q(b=0;b<2W.1h;b++)e=2W[b],a.1e({3L:"nG",ee:e.5m,ec:e.5n,ef:e.5o,eg:e.5J,52:e.2G,ej:e.3r,co:e.3w,ei:e.3W});1d a},J.eh=Y(a,b){1b c=J.6A(),d=J.6H();1d 0>=c&&0>=d&&(-10!=J.2r&&(J.2r=-10),2j>0&&(2j=-10)),1!=2j?(a(2j,1),1s 0):(1!=3H&&(3H=1,J.3K=a,J.4W=1,1s 0!=b&&(J.4W=b),J.4G(J.eu)),1s 0)},J.eu=Y(){1b c,d,e,f,g,h,i,a=J.6A(),b=J.6H();1d 0>=a&&0>=b?(-10!=J.2r&&(J.2r=-10),-10!=2j&&(2j=-10),U.3k&&""!=U.3k&&"Y"==21 U.3k&&U.3k(J.2r),1s 0):(9a=5E(),5U=0,J.7S(),J.cB(),J.d1(),J.cx(),J.c9(),J.c0(),J.c3(),J.cf(),c=J.8N(),d={2V:22,6T:1x,cq:{cw:3z},6Q:{6U:32},ev:{eI:3c},5F:{5O:1n},d4:{cu:c}},J.2P(eG,"病人信息："+J.1y(1x),eJ),J.2P(eF,"处方："+J.1y(1n),dJ),J.2P(dI,"过敏史："+J.1y(3z),dL),J.2P(dN,"诊断："+J.1y(32),dF),J.2P(dz,"手术："+J.1y(3c),e9),1L=J.1y(d),J.aI(d),e={2A:"e3",2D:1L},f=J.1y(e),6o=1,g=28,1==6o&&(h=!0,1x&&"0"==1x.ah+""&&(b=0,h=!1),"2p"!=21 3Z&&h?g=3Z:(i={2A:"92",2D:1L},f=J.1y(i))),g.2o(f,J.3K),g.2k=Y(c){1b d,e,f,g,h,i;if(3H=0,J.2P(4T,"审查结果："+c,6s),1F=1i,1I=1i,57="",1==a&&0==b?c.1O("[1X]")>=0?(3C.2Q=0,2j=-10,J.2r=-10,"[1X]:5g"==c&&(2j=-99,J.2r=-99)):(d=J.fn.2v(c),d&&(d.2Q&&(1F=d.2Q),d.2M&&(1I=d.2M),("2p"==21 3Z||0==b)&&(1F=d))):1==a&&1==b?(d=J.fn.2v(c),e="",1s 0==d||1i==d||1s 0==d.2Q||1i==d.2Q||(e=J.1y(d.2Q)).1O("[1X]")>=0?(3C.2Q=0,J.2r=-10,"[1X]:5g"==e&&(J.2r=-99)):1F=d.2Q,1s 0==d||1i==d||1s 0==d.2M||1i==d.2M||J.1y(d.2M).1O("[1X]")>=0?3C.2M=0:1I=d.2M):0==a&&1==b&&(c.1O("[1X]")>=0?(3C.2M=0,2j=-10,"[1X]:5g"==c&&(2j=-99)):(d=J.fn.2v(c),d&&(d.2Q&&(1F=d.2Q),d.2M&&(1I=d.2M),"2p"==21 3Z&&(1F=d)))),1i!=1F&&(J.2r=1F.7i),J.2r>0||!8X(1I)&&(1F&&1==1F.6l||1I&&1I.1h>0&&-11==1I[0].1A||-9==1I[0].1A||1F&&1==1F.4y))J.8E(1);2E if(U.3k&&""!=U.3k&&"Y"==21 U.3k&&U.3k(J.2r),1F&&(f=1F.3V))1q(g=0;g<f.1h;g++)h=f[g].77,i=J.fn.1f("aM"+h),i&&(i.1N="jk",i.1a.2q="1w("+1j+"/1k/0.43)")},61=5E(),1s 0)},4K=1i,J.8E=Y(a){Y l(a){1b b=J.fn.1f("aR");b&&(b.1D=a),1g.2g("4U")&&(1g.2g("4U").1a.1Z="1S")}Y m(a,b,c){1b e,d=J.fn.1f("aR");d&&(d.1D=a),e=1g.2g("8i"),b&&e&&(-1==J.3f.52&&J.3f.4g.1h<=0||J.3f.52!=1x.2G?J.dy(c,1x.2G,J.bu):J.bu(J.3f.4g.1z("\\n")))}Y n(){1b b,a=1I;1d a&&a[0]&&(b=a[0],1==b.iL)?!0:!1}Y p(){2u.4H=22.4H,2u.4u=1x.4u,2u.4w=1x.4w,2u.4x=1x.4x,2u.4z=1x.4t>1?2:1}Y s(){1i!=4K&&bX(4K)}Y t(){J.7B=1i,1i!=b&&J.3N(0),J.4I(Y(a){1d r=a,1I=[r],a.b9||a.1A>=0?(1I=[a],J.3K&&"Y"==21 J.3K&&J.3K(J.2r),1s 0):(b=1v J.9e,b.3E(),J.bQ(),u(),1s 0)})}Y u(){4K=1i;1b a=2w.3A;J.4I(Y(b){1b c;1d 1I=[b],q++,1==q&&(c=x(b),m(c)),r=b,b.b9||b.1A>=0?(s(),1I=[r],J.8C(),1s 0):(-5==b.1A||-6==b.1A||-9==b.1A||-10==b.1A||-12==b.1A||-13==b.1A||-14==b.1A?(w(b),4K=45(a,3X)):(-11==b.1A&&(1I=[b]),c=x(b),m(c,!0,b.3b)),1s 0)})}Y v(a){1d d8.kJ(a)}Y w(a){1b c,d,e,f,g,b=J.fn.1f("6m");b&&(c="预计等待时间还剩 "+v(a.aq-a.bd)+" 秒",d=v(2z*(a.bd/a.aq)),e=[],e.1e(\'      <19 id="6m">\'),f="",a.4d&&""!=a.4d&&1i!=a.4d&&(f=a.4d),a.3J&&""!=a.3J&&1i!=a.3J&&(f=""==f?"，联系电话："+a.3J:"，联系电话："+f+"、"+a.3J),g="",1==a.hZ?(g+="药师（"+a.aV+"）已暂停该任务的倒计时"+f,e.1e(\'      <19 1c="6m">\'+g+" </19> ")):e.1e(\'      <19 1c="6m">\'+c+" </19> "),e.1e(\'      <19 1c="hX"><19 1c="hW" 1a="1C: \'+d+\'%;"></19> </19> </19>\'),e.1e("</19>"),g=e.1z(""),b.1D=g)}Y x(a){1b d,e,f,g,h,i,j,b="",c="";if(b=a.aq>0?"预计等待时间还剩"+v(a.aq-a.bd)+"秒":"...",-2==a.1A||-3==a.1A||-8==a.1A){if(d=[],e="",a.3t&&(e=a.3t.1B(/1w\\(1k/gi,"1w("+1j+"/1k")),d.1e(\'<19 1c="kN">\'),d.1e(\'  <19 1c="kO">药师审核未通过!</19>\'),f="",a.4d&&""!=a.4d&&1i!=a.4d&&(f=a.4d),a.3J&&""!=a.3J&&1i!=a.3J&&(f=""==f?"（"+a.3J+"）":"（"+f+"，"+a.3J+"）"),d.1e(\'    <19 1c="lw">审方药师： <2l>\'+a.aV+"</2l>"+f+"</19>"),d.1e(\'   <19 1c="e8" 36="U.1N=\\\'e8\\\'" 3a="U.1N=\\\'lt\\\'"1K="J.gL();"></19></19>\'),d.1e(\'<19 1c="ld">\'),d.1e(\'    <19 1c="dW">\'),a.3T.1h>0)1q(d.1e(\'        <19 1c="dV">未通过理由：</19>\'),g=0;g<a.3T.1h;g++)h=a.3T[g],i="",-1==h.3U&&(i=\'1a="1m:1w(\'+1j+\'/1k/le-1.1l) 78 84 no-1t;"\'),1==h.3U&&(i=\'1a="1m:1w(\'+1j+\'/1k/k3.1l) 78 84 no-1t;"\'),2==h.3U&&(i=\'1a="1m:1w(\'+1j+\'/1k/k1.1l) 78 84 no-1t;"\'),3==h.3U&&(i=\'1a="1m:1w(\'+1j+\'/1k/k2.1l) 78 84 no-1t;"\'),4==h.3U&&(i=\'1a="1m:1w(\'+1j+\'/1k/k6.1l) 78 84 no-1t;"\'),d.1e(\' <19 1c="jZ" \'+i+">"+(g+1)+"、"+"&1U;&1U;&1U;&1U;&1U;"+h.7U+"</19>"),d.1e(\' <19 1c="dR">\'+h.3t+"</19>");e&&""!=e&&(d.1e(\'        <19 1c="jN">药师审核意见：</19>\'),d.1e(\'        <19 1c="dR">\'+e+"</19>")),d.1e(\'        <19 1c="dV">若要坚持用药，请填写理由：</19>\'),d.1e("    </19>"),d.1e(\'    <19 id="8i" 1c="dW">\'),d.1e("    </19>"),d.1e(\'    <19 1c="ke">\'),d.1e(\'        <19 1c="ki">\'),d.1e(\'           <a id="gx" 1c="h3"  2X 1K="J.8C();">返 回 修 改</a>\'),a.fJ&&2==a.fJ?d.1e(\'            <a id="7r" 1c="7K"  2X 1K="J.bB(U, \\\'6G\\\');">双 签 复 核</a>\'):d.1e(\'            <a id="7r" 1c="7K"  2X 1K="J.bB(U, \\\'6G\\\');">双 签 执 行</a>\'),d.1e("        </19>"),d.1e("    </19>"),d.1e(\'    <a6 id="6G" 3L="27" 1P="" />\'),d.1e("</19>"),c=d.1z("")}2E-5==a.1A||-6==a.1A||-9==a.1A||-10==a.1A||-12==a.1A||-13==a.1A||-14==a.1A?(d=[],d.1e(\'<19 1c="kp">\'),d.1e(\'      <19 1c="km"></19>\'),-5==a.1A?d.1e(\'      <19 1c="7c">正在等待药师审核，请稍候......</19>\'):-12==a.1A||-6==a.1A?d.1e(\'      <19 1c="7c">正在等待药师复核，请稍候......</19>\'):-9==a.1A?d.1e(\'      <19 1c="7c">含重点关注内容，正在等待药师审核，请稍候......</19>\'):-10==a.1A?d.1e(\'      <19 1c="7c">含重点关注内容，正在等待药师复核，请稍候......</19>\'):-13==a.1A?d.1e(\'      <19 1c="7c">含药师关注内容，正在等待药师审核，请稍候......</19>\'):-14==a.1A&&d.1e(\'      <19 1c="7c">含药师关注内容，正在等待药师复核，请稍候......</19>\'),d.1e(\'      <19 id="6m">\'),j="",a.4d&&""!=a.4d&&1i!=a.4d&&(j=a.4d),a.3J&&""!=a.3J&&1i!=a.3J&&(j=""==j?"，联系电话："+a.3J:"，联系电话："+j+"、"+a.3J),c="",1==a.hZ?(c+="药师（"+a.aV+"）已暂停该任务的倒计时"+j,d.1e(\'      <19 1c="6m">\'+c+" </19> ")):d.1e(\'      <19 1c="6m">\'+b+" </19> "),d.1e(\'      <19 1c="hX"><19 1c="hW" 1a="1C: 0%;"></19> </19> </19>\'),d.1e("</19>"),c=d.1z("")):-11==a.1A&&(c=y());1d c}Y y(){1b b,j,k,l,m,n,o,p,q,r,s,t,u,v,w,x,y,z,A,B,C,D,E,F,G,H,I,K,L,M,N,O,P,Q,R,S,T,V,W,X,Z,$,3m,ab,bb,cb,db,eb,fb,gb,hb,ib,jb,kb,lb,mb,nb,ob,62,7T,5u,8Y;1q(c=[],J.3f={},b=1F.3V,j=!1,1==1F.as&&(j=!0),k=0,l=b.1h,m=!0,n=0;n<b.1h;n++)if(o=b[n],1s 0==o||1i==o||o.3P.jF<=0)l--;2E{if(p=o.4m,q="",r="",s="2p"==21 o.35?o.3U:o.35,t=o.77,u=aQ(t,!0),v=u,1I&&1I.1h>0&&-11==1I[0].1A&&(v=s),w=0,1s 0==o.4E||1i==o.4E||o.4E<=1){if(1s 0==o.4E||1i==o.4E){if(w=1,1s 0!=1n||1i!=1n)1q(x=0;x<1n.1h;x++)if(y=1n[x],1i!=y&&y.2B==t){r=y.4a,q=y.7w;2i}}2E r=o.4a,q=o.7w;p="<2l 1c=\'i0\'>"+(n+1)+".</2l><a 1c=\'i1\' 2X                  1K=\\"J.hj(\'"+r+"\',\'"+p+"\');J.hV();\\">"+p+"</a>",1i!=q&&""!=q&&(q="("+q+")")}2E if(l--,p="<2l 1c=\'i0\'>"+(n+1)+".</2l><a 1c=\'i1\'>"+p+"</a>",0>=s)ja;1q(d=[],z=0,A=o.3P,B=0;B<A.1h;B++)C="2p"==21 A[B].35?A[B].3U:A[B].35,0>=C||(D=A[B].42,1==C?e++:2==C?f++:3==C?g++:4==C&&h++,E=A[B].4s,F=A[B].4R,G=A[B].60,H=A[B].o0,I=A[B].4O,A[B].2y,K=A[B].6k,L=A[B].89,M=A[B].8c,N=!0,0!=E&&""!=F||""!=G||(N=!1),O=!1,""!=K?O=!0:z++,P=1v aU,P.4R=F,P.4s=E,P.60=G,P.8z=H,P.89=L,P.8c=M,3y[3y.1h]=P,Q=3y.1h-1,R="7n"+i+"3m"+B,S="nO"+i+"3m"+B,T="nu"+i+"3m"+B,V="",W="",X="",O&&j&&(4v=0,59[59.1h]=[n,B]),N&&(X=" be=\\"J.8D(\'"+S+"\',\'"+R+"\',1);\\"",V="<a  1a=\'2m:#nA;nL-1E:nM;\' id=\'"+S+"\' 1c=\'hr\' 2X 1K=\\"J.8D(\'"+S+"\',\'"+R+"\',\'"+Q+"\',1)\\">详细</a>"),Z=D,$="",I.1O("aX")>=0?$="<2J 1Q=\'"+1j+"/1k/b0.1l\' 33=\'自由自定义审查结果\' 1H=\'6g\' 1a=\'3Q-1M:8q;\'/>":I.1O("4L")>=0&&($="<2J 1Q=\'"+1j+"/1k/bq.1l\' 33=\'用户自定义审查结果\' 1H=\'6g\' 1a=\'3Q-1M:8q;\'/>"),3m=A[B].5t,""==3m&&(3m="&1U;"),ab=A[B].6l,bb=A[B].4y,cb=J.69(),(cb||1==ab||1I&&1I.1h>0&&-11==1I[0].1A||1==bb)&&(db="",1!=1F.4y||1!=bb||cb||(db="<2l 1c=\'lI\'></2l>"),eb=["<19 1H=\'1u\' 1c=\'mV\' 1a=\'1T:2x;3o:1S;\'>","<19 1H=\'1u\' 1c=\'ne\' 1a=\'1T:2x;3o:1S;\'>","<2K 1c=\'gY\' 6F=\'0\' 6E=\'0\'><2e 6D=\'mv\'>","<1r 1C=\'5l\' 4p=\'5l\' 1H=\'1u\'>&1U;</1r>","<1r 1C=\'79\' 4p=\'79\' 1H=\'1u\'><2J 1Q=\'"+1j+"/1k/mL.1l\'/></1r>","<1r 1C=\'8O\' 4p=\'8O\' 1H=\'1u\'> <2l 1c=\'aW",C,"\'>",A[B].5j,"</2l></1r>","<1r 1C=\'hS\' 4p=\'hS\' 1H =\'1u\' 1a=\'8x-1H:1M;\'>",$,"</1r>","<1r 1C=\'8O\' 4p=\'8O\' 1H=\'1u\'>",Z,"</1r>","<1r 1C=\'6K\' 4p=\'6K\' 1H=\'1u\'>",db,"</1r>","<1r 1H=\'1u\' 1a=\'5I-2i:2i-8o;3S-1u:5e;\'>",3m,"</1r>","<1r 1C=\'5l\' 4p=\'5l\' 1H=\'3O\' 1a=\'3S-3O:gU;\'>",W,"</1r>","<1r 1C=\'5l\' 4p=\'5l\' 1H=\'3O\' 1a=\'3S-3O:5e;\'>",V,"</1r>","</2e></2K>","</19>","<19 id=\'",T,"\' 1H=\'1u\' 1c=\'gW\' 1a=\'1Z:1S;1T:27;3o:1S;3S-1u:bY;\' ","></19>","<19 id=\'",R,"\' 1H=\'1u\' 1c=\'gW\' 1a=\'1Z:1S;1T:27;3o:1S;3S-1u:bY;\' ",X,"></19>","</19>"],d.1e(eb.1z(""))));if(z==A.1h&&k++,""!=d.1z("")){1q(i++,fb="ba"+i,gb="bc"+i,hb=!1,ib=0;ib<o.3P.1h;ib++)""!=o.3P[ib].6k&&(hb=!0);jb="</2l>  ",bb=o.4y,kb=1F.4y,jb+=(hb||1I&&1I.1h>0&&1I[0]&&1I[0].1A&&1I[0].1A<0)&&0==kb&&!J.69()?\'<a id="8I\'+n+\'"  1c="mX" 2X="" 1K="J.hH(\'+7R+",\'8I"+n+"\',\'91"+n+"\',"+n+\');" 1a="3h-4P:6j;">[填写理由]</a> </1r>\':"</1r>",lb=["<19 1c=\'mW\' 36=\\"U.1a.gQ=\'\'\\" 3a=\\"U.1a.gQ=\'#n2\'\\" 1a=\'1T:2x;3o:1S;\'>","<19 1c=\'mr\' be=\\"J.8S(\'",fb,"\', \'",gb,"\')\\" 1a=\'1T:2x;3o:1S;\'>","<2K 1c=\'gY\' 6F=\'0\' 6E=\'0\'><2e>","<1r 1H=\'4r\' 1C=\'lV\' lM=\'2\' 6D=\'1M\'><2J 1Q=\'"+1j+"/1k/",0==v?"lL":v,\'.1l\\\' 1H="6g" /></1r>\',"<1r 1H=\'1u\' 6D=\'8U\' 1a=\'4M-lE:lK;5I-2i:2i-8o;\'>",p,"<2l 1c=\'lJ\'>",q,jb,"</2e></2K>","</19>","<19 id=\'",gb,"\' 1H=\'1u\' 1c=\'lZ\' 1a=\'1T:2x;3o:1S;\'>",d.1z(""),"</19>","</19>"],c.1e(lb.1z("")),c.1e(\' <a6 id="5T\'+n+\'" 1c="h8" mi="11" 3L="27" 1P="" />\'),c.1e(\' <19 id="91\'+n+\'" 1H="1u" 1c="bi" 1a="1Z:1S;1T:27;3o:1S;">\'),c.1e(\'	<19 id="mf\'+n+\'" 1H="1u" 1c="ml">\'),c.1e(\'         <2l 1c="mq" 33="\'+o.4m+\'">\'+o.4m+"</2l>"),c.1e(\'          <2l 1c="mo" 33="\'+q+\'">\'+q+"</2l>"),c.1e("     </19>"),c.1e(\'     <19 id="6I\'+n+\'" 1H="1u" 1c="mn">\'),c.1e("     </19>"),c.1e(\' <19 id="m4\'+n+\'" 1H="1u" 1c="m2">\'),c.1e(\'        <19 1c="m0">\'),c.1e(\'          <a 1c="h3"  2X 1K="J.bO(\\\'91\'+n+"\');\\"><2l 1a=\'1Z:  7a;8x-1H:  8U;h1-1M:5e;\'>取　　消</2l></a>"),c.1e(\'           <a id="74\'+n+\'" 1c="7F"  2X 1K="J.hN(\'+n+",U,\'5T"+n+"\',\'91"+n+"\');\\"><2l 1a=\'1Z:  7a;8x-1H:  8U;h1-1M:5e;\'>确　　定</2l></a>"),c.1e("</19>"),c.1e("</19>"),c.1e("</19>"),c.1e(\'<19 id="8P" 1c="8P"></19>\')}mb=J.fn.1f("aM"+t),mb&&(nb=aQ(t,!1),mb.1N="oI"+nb,mb.1a.2q="1w("+1j+"/1k/"+nb+".43)")}1d k==l&&(m=!1),a&&""==c.1z("")?"":(ob=[],ob.1e("<19 id=\'om\' 1H=\'1u\' 1c=\'hc\' 1a=\'1T:2x;3o:1S;1m:1w("+1j+"/1k/hf.1l) 1u 1t-y;\'>"),ob.1e(c.1z("")),ob.1e("</19>"),62=\'<a id="gx" 1c="ol"  2X="" 1K="J.8C();"></a>\',7T=1I,ob.1e(\'<19 1c="oj">\\r\\n\'),ob.1e(\'<19 1c="oh">\\r\\n\'),cb=J.69(),cb?ob.1e(\'    <a id="aL" 1c="bM"  2X 1K="J.58();"></a>\\r\\n\'):7T&&7T[0]&&1==97.gy?(5u=7T[0],8Y="",-15==5u.1A?ob.1e(62):-1==5u.1A||-7==5u.1A?(0==5u.4J&&-1==5u.1A&&(8Y=\'<a id="bv" 1c="bG"  2X="" 1K="J.h9();" 1P="0"></a>\'),ob.1e("\\r\\n"),ob.1e(8Y),ob.1e(\'<a id="ot" 1c="oL"  2X="" 1K="J.gC();"></a>\'),ob.1e("</19>"),ob.1e(62)):-11==5u.1A?(ob.1e(\'    <a id="p4" 1c="p2"  2X 1K="J.gK();"></a>\\r\\n\'),ob.1e(62)):ob.1e(\'    <a id="aL" 1c="bM"  2X 1K="J.58();"></a>\\r\\n\')):1==j?(ob.1e(\'    <a id="p0" 1c="p1"  2X 1K="J.gG();"></a>\\r\\n\'),ob.1e(62)):1F&&1F.4y&&1==1F.4y?ob.1e(62):(ob.1e(\'    <a id="aL" 1c="bM"  2X 1K="J.58();"></a>\\r\\n\'),1!=97.oO&&22.53&&1i!=22.53&&""!=22.53&&ob.1e(\'<a id="bk" 1c="by"  2X="" 1K="J.gD();" 1P="0"></a>\')),ob.1e("</19>"),ob.1e("</19>"),ob.1z(""))}1b c,d,e,f,g,h,i,j,o,q,r,b=1i;2c{J.4W&&(J.2r>0||1i!=1F)&&1==a&&(b=1v J.9e,b.3E()),3y=[],c=[],d=[],e=0,f=0,g=0,h=0,i=0,59.1h=0,1i==1F?(p(),t()):(j=y(),j?(l(j),n()&&J.bQ()):(p(),t())),5U=i}2a(k){j="<19 1c=\'5x\' 1a=\'1E:"+(1V-hx)+"1o;\'>"+J.5h()+"</19>",l(j)}bC=5E(),oW&&gt(),o=1I,bn||8X(o)?1i==1F&&J.8C():(p(),J.7B=t),5G.2d.gJ=Y(){1b a=/^\\s*$/gi;1d a.dn(U)?!0:!1},q=0,r=1i,J.9d=Y(){1b c,d,e,f,a=[],b=1n;1q(c=0;c<b.1h;c++)d=1g.2g("5T"+c),d&&"2p"!=21 d&&(e=d.1P,f={2B:b[c].2B,7U:b[c].4m,3t:e},a.1e(f));1d a},J.gC=Y(){Y c(){J.f7(r,Y(){J.4I(Y(a){1b b;-11==a.1A?(1I=[a],b=x(a),m(b,!0,a.3b)):(b=x(a),m(b),u())})})}1b a,b;s(),a=J.fn.1f("bv"),b=-1,1I&&1I.1h>0&&(b=1I[0].4J),a&&"1"==a.hC("1P")&&(b=1),1i==r?J.4I(Y(a){r=a,r.bA=b,r.3T=J.9d(),c()}):(r.bA=b,r.3T=J.9d(),c())},J.bB=Y(){1b c,d;1d s(),c=1g.2g("6G").1P,1i==c||c.gJ()?(4f("请填写双签理由"),1s 0):(d={},d.bg=r.bF,d.bE=r.3b,d.3s=r.3s,d.4J=r.4J,d.6a=r.6a,d.3t=c,d.3T=[],J.dc(d,Y(a){1==a?J.4I(Y(a){if(a.1A>=0)r=a,1I=[r],J.58();2E{1b b=x(a);m(b,!0,a.3b),u()}}):J.4I(Y(a){r=a,1I=[r],J.58()})}),1s 0)},J.gK=Y(){Y e(){J.dc(r,Y(a){1==a?J.4I(Y(a){if(a.1A>=0)r=a,1I=[r],J.58();2E{1b b=x(a);m(b,!0,a.3b),u()}}):J.4I(Y(a){r=a,1I=[r],J.58()})})}1b a,b,c,d;1q(s(),a=J.9d(),b=!1,c=!1,d=0;d<a.1h;d++)a[d].3t&&""!=a[d].3t&&(b=!0),1i!=1g.2g("8I"+d)&&(c=!0);1d!b&&c?(4f("请填写用药理由"),1s 0):(1i==r?J.4I(Y(b){r=b,r.3T=a,e()}):(r.3T=a,e()),1s 0)},J.gL=Y(){np(1i,r.nm,"",!1)},J.nn=Y(a,b,c){1b d=1g.2g(a),e=1g.2g(b),f=1g.2g(c);1d d.4Y?(f.54("3I","3I"),1g.2g("gH").gI("3I"),1s 0):(e.4Y&&(f.gI("3I"),1g.2g("gH").54("3I","3I")),1s 0)}},J.gD=Y(){1b a=J.fn.1f("bk");a&&("by"==a.1N?(a.1N="nv",a.54("1P","1")):(a.1N="by",a.54("1P","0")))},J.69=Y(){1b 8d=gF("("+1L+")");1d!8d||!8d.2V||8d.2V.69&&1==8d.2V.69?!0:!1},J.gG=Y(){1b b,c,d,a=J.8H("h8");if(a.1h>0){1q(b=!0,c=0;c<a.1h;c++)d=a[c].1P,""==d&&(b=!1);if(!b)1d 4f("请填写用药理由"),!1}J.58()},J.h9=Y(){1b a=J.fn.1f("bv");a&&("bG"==a.1N?(a.1N="o9",a.54("1P","1")):(a.1N="bG",a.54("1P","0")))},J.3f={52:-1,4g:[]},J.bu=Y(a){1b b,d,e,f,g;if(J.3f.52=1x.2G,J.3f.4g=[],a.1O("[1X]")<0)1q(b=a.2C("\\n"),b.1h,d=0;d<b.1h;d++)J.3f.4g[d]=b[d];1q(e=1g.2g("8i"),f="",g=0;g<J.3f.4g.1h;g++)f+="<19 1c=\\"4h\\" 1K=\\"J.7D(U,\'8i\',\'6G\',\'7r\',\'8K\');\\">"+J.3f.4g[g]+"</19>";f+="<19 1c=\\"4h\\" 1K=\\"J.7D(U,\'8i\',\'6G\',\'7r\',\'8K\');\\">其它：</19>",f+=\'	    <19 1c="bh" id="9c">\',f+="	        <5A id=\\"8K\\" 3I bl=\\"6\\" 1c=\\"bm\\" bp=\\"J.93(U,\'\',\'6G\',\'7r\',\'8K\');\\"></5A>",f+="      </19>",e.1D=f},J.58=Y(){1b b,c,d,e,f,a=J.fn.1f("bk");a&&(b=a.hC("1P"),b&&"1"==b&&"2p"!=21 3Z&&1I&&1I.1h>0&&(c={bg:1I[0].bF,bE:1I[0].3b,3s:1I[0].3s,6a:1I[0].6a,4J:1I[0].4J,3w:22.53},d=J.1y(c),e={2A:"j8",2D:d},f=J.1y(e),3Z.2o(f),3Z.2k=Y(){})),1i!=4K&&bX(4K),J.7B=1i,4v=1,J.3N(1),4v=0},J.8H=Y(a,b){1b c,d,e,f,g,h;if(b=b||[],1g.hy)b.1e.jf(b,1g.hy(a));2E 1q(c=1g.5V("*"),d=0;d<c.1h;d++)1q(e=c[d],f=e.1N,g=f.2C(" "),h=0;h<g.1h;h++)g[h]===a&&b.1e(e);1d b},J.hI=Y(a){1b b,c,d,e,g;if(J.3f.52=1x.2G,a.1O("[1X]")>=0)1q(b=J.8H("bi"),c=0;c<b.1h;c++)d="",d+=\'<19 1c="4h" 1K="J.7D(U,\\\'6I\'+c+"\',\'5T"+c+"\',\'74"+c+"\',\'6B"+c+"\');\\">其它：</19>",d+=\'	    <19 1c="bh" id="hz\'+c+\'">\',d+=\'	        <5A id="6B\'+c+\'" 3I bl="6" 1c="bm" bp="J.93(U,\\\'\\\',\\\'5T\'+c+"\',\'74"+c+"\',\'6B"+c+"\');\\"></5A>",d+="      </19>",1g.2g("6I"+c).1D=d;2E{1q(e=a.2C("\\n"),e.1h,J.3f.4g=[],c=0;c<e.1h;c++)J.3f.4g[c]=e[c];1q(b=J.8H("bi"),c=0;c<b.1h;c++){1q(d="",g=0;g<J.3f.4g.1h;g++)d+=\'<19 1c="4h" 1K="J.7D(U,\\\'6I\'+c+"\',\'5T"+c+"\',\'74"+c+"\',\'6B"+c+"\');\\">"+J.3f.4g[g]+"</19>";d+=\'<19 1c="4h" 1K="J.7D(U,\\\'6I\'+c+"\',\'5T"+c+"\',\'74"+c+"\',\'6B"+c+"\');\\">其它：</19>",d+=\'	    <19 1c="bh" id="hz\'+c+\'">\',d+=\'	        <5A id="6B\'+c+\'" 3I bl="6" 1c="bm" bp="J.93(U,\\\'\\\',\\\'5T\'+c+"\',\'74"+c+"\',\'6B"+c+"\');\\"></5A>",d+="      </19>",1g.2g("6I"+c).1D=d}}},J.hH=Y(a,b,c,d){1b e,f,g;1g.2g("8I"+d).1a.2m="#iZ",(-1==J.3f.52&&J.3f.4g.1h<=0||J.3f.52!=1x.2G)&&J.dy(a,1x.2G,J.hI),e=J.fn.1f(b),f=J.fn.1f(c).1a,g=J.fn.1f("8P").1a,e&&f&&g&&(g.1Z="7a",g.1T="2x",f.1Z="",f.1T="2x",e.1N="jB")},J.bO=Y(a){1b b=J.fn.1f(a).1a,c=J.fn.1f("8P").1a;b&&c&&(c.1Z="1S",c.1T="27",b.1Z="1S",b.1T="27")},J.7D=Y(a,b,c,d,e){1b g,h,j,k,l,f=1g.2g("7r");if(f&&(f.1N="7F"),g=J.fn.1f(b),h=J.fn.1f(c),J.fn.1f(d),j=J.fn.1f(e),g)1q(k=g.5V("19"),l=0;l<k.1h;l++)0!=k[l].id.1O("9c")&&k[l]!==a&&(k[l].1N="4h");"19"==a.hQ.4N()&&(-1!=a.1D.1O("其它：")?-1!=a.1N.1O("7G")?(a.1N="4h",h.1P="",j.3I="3I"):(a.1N="4h 7G",j.3I="",j.hO(),h.1P=""):-1!=a.1N.1O("7G")?(a.1N="4h",h.1P=""):(a.1N="4h 7G",h.1P=a.3G))},J.93=Y(a,b,c){1b f=1g.2g(c);f.1P=a.1P},J.i7=Y(a,b,c,d,e){1b j,k,f=J.fn.1f(b),g=J.fn.1f(c),h=J.fn.1f(d),i=J.fn.1f(e);if(f)1q(j=f.5V("19"),k=0;k<j.1h;k++)0!=j[k].id.1O("9c")&&(j[k].1N="4h");"19"==a.hQ.4N()?(0!=a.id.1O("9c")&&(a.1N="4h 7G"),0==a.3G.1O("其他：")?(i.3I="",i.hO(),g.1P=i.1P,h.1N=g.1P.1h>0?"7F":"7K"):(i.3I="3I",g.1P=a.3G,h.1N="7F")):(g.1P=a.1P,h.1N=g.1P.1h>0?"7F":"7K")},J.hN=Y(a,b,c,d){if("7K"!=b.1N){J.bO(d);1b e=1g.2g(c).1P;J.i2(a,7R,1x.2G,e)}},J.8C=Y(){1b a,b,c,d;"2p"!=21 3Z&&1I&&1I.1h>0&&(a={bg:1I[0].bF,bE:1I[0].3b,3s:1I[0].3s,6a:1I[0].6a,4J:1I[0].4J,3w:22.53},b=J.1y(a),c={2A:"l6",2D:b},d=J.1y(c),3Z.2o(d),3Z.2k=Y(){}),1i!=4K&&bX(4K),J.7B=1i,4v=1,J.3N(1),4v=0},J.hj=Y(a,b){1b c=1i==a?"":a,d=1i==b?"":b,e=1v aJ;e.3D=c,e.4j=d,1G=e},J.aI=Y(a){1b d,e,f,b=1i;if(a)2c{b=a["5F"]["5O"]}2a(c){}2E if(1L)2c{d=J.fn.2v(1L),b=d["5F"]["5O"]}2a(c){}if(b)1q(e=0;e<b.1h;++e)f=J.fn.1f("aM"+b[e].2B),f&&(f.1N="lg",f.1a.2q="")},J.8D=Y(a,b,c,d){1b g,h,i,e=J.fn.1f(a),f=J.fn.1f(b);e&&f&&("2x"==f.1a.1T.4N()?(f.1a.1Z="1S",f.1a.1T="27","关闭"==e.3G&&(e.3G="详细",e.1D="详细",e.1a.2m="#cc")):(57.1h>0&&(g=J.fn.1f(57),h=J.fn.1f(7u),1i!=h&&1i!=g&&(g.1a.1Z="1S",g.1a.1T="27","关闭"==h.3G&&(h.3G="详细",h.1D="详细"))),1s 0==c&&(c=0),1s 0==d&&(d=0),i=d?3y[c].4s:6d[c].4s,f.1a.1Z="",f.1a.1T="2x",e.1a.2m="#cc",(i!=J.8Z.aH.8L||d>0)&&(e.3G="关闭",e.1D="关闭"),"详细"==e.3G&&i==J.8Z.aH.8L&&(e.3G="关闭",e.1D="关闭"),J.ha(a,b,c,d),57=b,7u=a))},6V={8b:1i,7N:1i,2B:0},J.ha=Y(a,b,c,d){1b e,f,g,h,i,j,k;J.7m(a,b,"",c,d),1s 0==c&&(c=0),d?(e=3y[c].4R,f=3y[c].60,g=3y[c].4s):(e=6d[c].4R,f=6d[c].60,g=6d[c].4s),0>=e?(h=3y[c].8z,""!=h&&(f=h+"<br/>"+f),J.7m(a,b,J.d9(f),c,d)):(6V={8b:a,7N:b,2B:c},i={4R:{4R:e,4s:g},2V:22},8s=J.1y(i),j={2A:"hq",2D:8s},k=J.1y(j),28.2o(k),28.2k=Y(a){a.1O("[1X]")<0?(7J=a,J.hd(6V,d,c)):J.7m(6V.8b,6V.7N,J.5h(),c,d)})},J.hd=Y(a,b,c){1b d,e,f,g,h,i,j;2c{d="",e=J.fn.2v(7J),f=e.60,g=e.kc,""!=g&&(d="<p 1c=\'ka\' 1a=\'2R-1H:4r;3Q:8q;3h-6h:7q;\'>"+g+"</p>"),h=b?3y:6d,1i!=h&&(i=1i,1i!=a.2B&&(i=h[a.2B].8z,""!=i&&(f=i+"<br/>"+f))),j=d+J.d9(f),""==j&&(j="暂无相关资料!"),J.7m(a.8b,a.7N,j,c,b)}2a(k){J.7m(a.8b,a.7N,J.5h(),c,b)}},J.7m=Y(a,b,c,d,e){1b g,h,i,j,k,l,m,f="<19 1c=\'6c\' 1a=\'1m-29:1w("+1j+"/1k/5B.1l);1m-1t:no-1t;\'></19>";""!=c&&(f=c),g="<19>",1s 0==e&&(e=0),0==e?g="<19 1a=\'1E:8T;1m-29:1w("+1j+"/1k/jR.1l);1m-1t:1t-x;\'>":1==e&&(g="<19 1a=\'1E:8T;1m-29:1w("+1j+"/1k/jP.1l);1m-1t:1t-x;\'>",h=3y[d].89,i=3y[d].8c,j=3y[d].4s,f+="<19 1a=\'2R-1H:3O;3Q-3O:94;\'><a 1c=\'hr\' 1a=\'3o:3O;3h-6h:ku;\' 1K=\\"J.ho(\'"+i+"\',"+j+","+d+",\'"+b+"\')\\">"+h+"</a></19><br/>"+"<19 id=\'7n"+i+"3m"+d+"\' 1a=\'1C:95%;1T:27;\'></19>"),k=["<19 1c=\'hT\'>",g,"<a 1c=\'gB\' 1a=\'1m-29:1w("+1j+"/1k/8V.1l);1m-1t:no-1t;\' 3a=\\"U.1a.2q=\'1w("+1j+"/1k/gu.1l)\';\\" 36=\\"U.1a.2q=\'1w("+1j+"/1k/8V.1l)\';\\" 1K=\\"J.8D(\'",a,"\',\'",b,"\')\\"></a></19>","<19 id=\'82",b,"\' 1c=\'kA\' 1a=\'1E:4C;2H:27;2H-y:4C;3Q-1u:5e;\'>",f,"</19>","</19>"],J.fn.1f(b).1D=k.1z(""),l=J.fn.1f(b).1a,l&&("2x"==l.1T.4N()?(l.1Z="1S",l.1T="27"):(l.1Z="",l.1T="2x")),""!=c&&(m=J.fn.1f("82"+b).7W,J.fn.1f("82"+b).1a.1E=9b>m?"4C":"8G",c.1h>8J&&(J.fn.1f("82"+b).1a.1E="8G"))},J.ho=Y(a,b,c,d){1b f,g,h,e=J.fn.1f("7n"+a+"3m"+c);e&&(J.fn.1f("82"+d).1a.1E="8G","2x"==e.1a.1T.4N()?(e.1a.1Z="1S",e.1a.1T="27"):(e.1a.1Z="",e.1a.1T="2x",f={2V:22,4R:{4R:a,4s:b}},8s=J.1y(f),g={2A:"hq",2D:8s},h=J.1y(g),28.2o(h),28.2k=Y(b){b.1O("[1X]")<0?(7J=b,J.fR(a,c)):J.fn.1f("7n"+a+"3m"+c).1D=J.5h()}))},J.fR=Y(a,b){1b d,e,f,g,h,i,j,k,l,m,n,o,p,q,r,s,t,u;2c{1q(d=J.fn.2v(7J),e=d.7H,f=d.7L,g=d.ko,h=[],i=[],h.1e(["<2K 1c=\'hp\' 38=\'0\' 6E=\'0\' 6F=\'0\' 1a=\'3Q-1u:5e;\'>"].1z("")),j=1i,k=0;k<g.1h;k++){1q(j=g[k],l=[],m=j.kq.2C(e),k>0&&(m=j.hn.2C(e)),n=0;n<m.1h;n++)o=m[n],p=o.2C(f),l.1e(p);if(q=j.hn.2C(e),r=q.1h,s=d8.ks(kv/(r-1))/2z,0==k){1q(h.1e(["<2e><1r hs=\'",r,"\'><b>",l[0][1],"</b>",l[1][1],"</1r></2e><2e>"].1z("")),t=0;r>t;t++)r-1>t?h.1e(["<1r 1c=\'hv\' 1C=\'"+s+"%\' 1H=\'4r\'><b>",q[t],"</b></1r>"].1z("")):(h.1e(["<1r 1c=\'hv\' 1C=\'20%\' 1H=\'4r\' 1a=\'38-3O:4B 2L #ht\'><b>",q[t],"</b>&1U;&1U;</1r>"].1z("")),h.1e(["<1r 1C=\'2L\'>&1U;&1U;</1r>"].1z("")));h.1e(["</2e>"].1z(""))}2E{1q(i.1e(["<2e>"].1z("")),u=0;r>u;u++)r-1>u?i.1e(["<1r 1c=\'hu\' 1C=\'"+s+"%\' 1H=\'4r\'>&1U;",l[u][1],"</1r>"].1z("")):(i.1e(["<1r 1c=\'hu\' 1C=\'20%\' 1H=\'4r\' 1a=\'38-3O:4B 2L #ht\'>&1U;",l[u][1],"</1r>"].1z("")),i.1e(["<1r 1C=\'2L\'>&1U;&1U;</1r>"].1z("")));i.1e(["</2e>"].1z(""))}}h.1e([i.1z(""),"</2K><br/>"].1z("")),J.fn.1f("7n"+a+"3m"+b).1D=h.1z("")}2a(v){J.fn.1f("7n"+a+"3m"+b).1D=J.5h()}},6w="",8f="",6z="",66="",4D="",4b="",J.67=Y(a,b){1b c,d;if(J.8Q||a!=8f||1G.3D!=6w){if(4D="",4b="",(1G.3D!=6w||2O(a/10)!=2O(8f/10))&&(6z="",66=""),""!=66&&(c=J.fn.1f("5C")))1d J.fn.1f("5C").1D=66,1s 0;1G.aw=1,1G.2T=a,1G.8M=b||1,6w=1G.3D,8f=1G.2T,d="<19 1c=\'5x\' 1a=\'1E:"+(1V-cP)+"1o;1m-29:1w("+1j+"/1k/5B.1l);1m-1t:no-1t;\'></19>",1==1G.8M&&(J.fn.1f("6e").1D=d),1i==J.fn.1f("7C")&&(J.fn.1f("6e").1D=d),J.cK()}},J.cK=Y(){1b a,b,c;2c{J.7S(),J.cz(),a={2V:22,5Z:1G},2N=J.1y(a),J.2P(hm,2N,85),b={2A:"8u",2D:2N},c=J.1y(b),28.2o(c),28.2k=Y(a){1b b,c;if(a.1O("[1X]")<0){if(3q=a,J.2P(4T,3q,85),b=J.fn.2v(3q),1i==b)1d J.6W(),1s 0;c=b.5z,"2p"!=21 c?J.hl(b):J.6W()}}}2a(d){}},J.hl=Y(a){1b c,d,e,f,g,b="";if(1s 0!=a&&1i!=a&&""!=a)8B(3q=J.1y(a),c=a.8W,d=J.8Z.8W,c){2s d.he:1d J.de(),1s 0;2s d.dh:1d J.dh(),1s 0;dg:b=""}1d""==b?(3q="",J.de(),1s 0):(e=[],e.1e("<19 id=\'k9\' 1a=\'1E:",1V-k7,"1o;2H-y:4C;\'>"),e.1e("<19 1H=\'1u\' 1c=\'hc\' 1a=\'1m:1w("+1j+"/1k/hf.1l) 1u 1t-y;\'>"),e.1e("<19 id=\'hi\' 1a=\'2H:27;4p:98%;\'></19>"),f=J.hw(),g=1G.8M,3==f&&1==g&&(e.1e("<19 1a=\'3Q:2L;\'><a id=\'hg\' 1K=\\"J.8S(\'hg\',\'7C\');J.8Q=0;J.67("+1G.2T+\',2);">\'),e.1e("<2J 1Q=\'"+1j+"/1k/hk.1l\' 36=\\"U.1Q=\'"+1j+"/1k/hk.1l\';\\" 3a=\\"U.1Q=\'"+1j+"/1k/l8.1l\';\\" 1H=\'3O\' 1a=\'5f:3i;2S:56;2S:3i;\' 33=\'2Q信息\' /></a></19>")),e.1e("<19 id=\'7C\'></19>"),e.1e("</19>"),e.1e("</19>"),(1i==J.fn.1f("7C")||1==g)&&(J.fn.1f("6e").1D=e.1z("")),1==g?(J.fn.1f("hi").1D=b,J.fn.1f("7C").1D=""):2==g&&(J.fn.1f("7C").1D=lu+b),1s 0)},J.hw=Y(){1b d,e,a=0,b=2f.1h,c=1G.2T;1q(d=0;b>d;d++)if(e=2f[d].2y,e==c){a=3p[d];2i}1d a},J.d9=Y(a){1d a},J.6W=Y(){1b d,e,f,g,a=1G.2T,b="",c=2f.1h;1q(d=0;c>d;d++)if(e=2f[d].2y,f=2f[d].42,e==a){b="【"+f+"】";2i}g=J.fn.1f("6e"),g&&(g.1D="<19 1c=\'5x\' 1a=\'1E:"+(1V-hx)+"1o;\'>"+J.5h()+"</19>")},J.8S=Y(a,b){1b c=J.fn.1f(a),d=J.fn.1f(b).1a;c&&d&&("2x"==d.1T.4N()?(d.1Z="1S",d.1T="27",c.1Q=1j+"/1k/hM.1l",c.33="展开"):(d.1Z="",d.1T="2x",c.1Q=1j+"/1k/df.1l",c.33="折叠"))},J.hL=Y(){1b b,c,d;2c{b={2V:22,6T:1x,6Q:{6U:32},5F:{5O:1n}},2N=J.1y(b),c={2A:"kR",2D:2N},d=J.1y(c),28.2o(d),28.2k=Y(a){1b b,c,d,e;if(a.1O("[1X]")<0){if(3q=a,J.2P(4T,3q,85),b=J.fn.2v(3q),1i==b)1d J.6W(),1s 0;c=1v J.46({}),c.hK(),d=b.73,"2p"!=21 d?""!=d?(d=d.1B(1v 2U(\'1Q="1k/\',"g"),\'1Q="\'+1j+"/1k/"),d=d.1B(1v 2U("1k/hJ.1l","g"),1j+"/1k/hJ.1l"),d=d.1B(1v 2U("J.9g"),"J.cj"),d=d.1B(1v 2U(\'5M="cv://lx/"\'),\'1K="J.fS();"\'),d=d.1B("<iA>","<19 id=\'dv\' 1a=\'1Z: ix;1C:8G;\'></19>"),J.fn.1f("2h").1D=d,"2p"!=21 b.7X&&1i!=b.7X&&""!=b.7X&&(e=1v hR(J.fn.1f("dv"),{1C:9b,1E:9b,iI:hR.i9.H}),e.jH(b.7X),J.fn.1f("dv").33="")):J.fn.1f("2h").1D="<19 1c=\'5x\'>对不起，您当前使用的数据库版本暂无用药指导单资料！</19>":J.6W()}}}2a(e){}},J.ci=Y(){1b b,c,d,e,f,g,h,i,j,k,l;2c{b=1v 9V,c=b.fB().3j(),d=(b.a8()+1).3j(),b.a8()+1<10&&(d="0"+d),e=b.d6().3j(),b.d6()<10&&(e="0"+e),f=b.d7().3j(),b.d7()<10&&(f="0"+f),g=b.ds().3j(),b.ds()<10&&(g="0"+g),h=b.a3().3j(),b.a3()<10&&(h="0"+h),i=c+"-"+d+"-"+e+" "+f+":"+g+":"+h,j={j3:22.4H,co:22.53,iV:i},k=J.1y(j),k=4F.hB(k),l=j6+k,1J.cJ(l)}2a(m){4f("4c j7 ci:"+m.ji())}},J.hA=Y(){1b b,c,d,e;2c{b=J.8N(),c={2V:22,6T:1x,cq:{cw:3z},6Q:{6U:32},5F:{5O:1n},d4:{cu:b}},2N=J.1y(c),d={2A:"ly",2D:2N},e=J.1y(d),28.2o(e),28.2k=Y(a){1b b,c,d,e,f;if(a&&a.1O("[1X]")<0){if(3q=a,J.2P(4T,3q,85),b=J.fn.2v(3q),1i==b)1d;if(J.fn.1f("2h")&&J.3N(),b.cs&&""!=b.cs)hD(b.cs);2E{if(!b.73||""==b.73)1d;c=1v J.46({}),c.cg(),d=b.7X,e=b.73,f=\'<2K 38="0" 6F="0" 6E="0" 1H="1u" 1C="2z%" 1E="2z%">\',f+=\'  <2e 6D="1M" 1E="5l;"><1r 1c="hG" 1a="38-96:1S;">\'+d+"</1r></2e>",f+=\'  <2e 6D="1M">\',f+="    <1r>",f+=\'      <19 1H="1u" 1c="hF" 1a="1E:oc;1T:2x; 3o:1S; ">\',f+=e,f+="      </19></1r></2e></2K>",J.fn.1f("2h").1D=f,J.fn.1f("5Q").1D="推荐剂量"}}}}2a(f){}},J.o8=Y(a,b,c,d,e){1b h,i,f=J.fn.1f(a),g=J.fn.1f(b);f&&g&&("2x"==g.1a.1T.4N()?(g.1a.1Z="1S",g.1a.1T="27"):(g.1a.1Z="",g.1a.1T="2x",f.1a.2m="#cc",57!=b&&(h=J.fn.1f(57),i=J.fn.1f(7u),1i!=i&&1i!=h&&(h.1a.1Z="1S",h.1a.1T="27","关闭"==i.3G&&(i.3G="详细",i.1D="详细"))),J.fn.1f(b).1D.1h<=0&&J.hU(c,d,Y(f){J.gE(a,b,c,d,f,e)}),57=b,7u=a))},J.gE=Y(a,b,c,d,e,f){1b g=["<19 1c=\'hT\'>","<19 1a=\'1E:8T;1m-29:1w("+1j+"/1k/nI.1l);1m-1t:1t-x;\'>","<a 1c=\'gB\' 2X 1a=\'1m-29:1w("+1j+"/1k/8V.1l);1m-1t:no-1t;\' 3a=\\"U.1a.2q=\'1w("+1j+"/1k/gu.1l)\';\\" 36=\\"U.1a.2q=\'1w("+1j+"/1k/8V.1l)\';\\" 1K=\\"J.8D(\'",a,"\',\'",b,"\')\\"></a></19>","<19 1a=\'1E:8G;2H:27;2H-y:4C;\'>","<19><5A id=\'55",c,d,"\' oT=\'gs\' 1a=\'1E:oS;1C:99%;38:2L 4B #oR;\'>",e,"</5A>","<19 1a=\'3o:3O;3S:gr;\'><2J 1Q=\'"+1j+"/1k/8R.1l\' 3a=\\"U.1Q=\'"+1j+"/1k/gv.1l\';\\" 36=\\"U.1Q=\'"+1j+"/1k/8R.1l\';\\" 1a=\'5f:3i;2S:56;2S:3i;\' 33=\'保存理由\' 1K=\\"J.gw(\'",a,"\',\'",b,"\',\'",c,"\',\'",d,"\',\'",f,"\' )\\" /></19>","</19>","</19>"];J.fn.1f(b).1D=g.1z("")},J.gw=Y(a,b,c,d,e){e>0?J.gA(a,b,c,d):J.e4(a,b,c,d)},J.gA=Y(a,b,c,d){1b f,g,h,i,j,k,l,m,n,o,p,q,r,s,e=J.fn.1f("55"+c+d).3G;if(""==e&&(e=J.fn.1f("55"+c+d).1P),"2p"==21 e&&(e=J.fn.1f("55"+c+d).1P),"2p"==21 e&&(e=J.fn.1f("55"+c+d).dm),e=e.1B(/^\\s+|\\s+$/g,""),f=J.fn.1f(a),g=J.fn.1f(b),h=1v gz,h.gM=22.4H,h.h2=22.h0,h.4t=1x.4t,h.4w=1x.4w,h.4x=1x.4x,h.4u=1x.4u,h.gZ=e,i=1F.3V,1s 0!=i&&1i!=i&&(j=i[c],1s 0!=j&&1i!=j&&(k=j.3P[d],1s 0!=k&&1i!=k))){1q(l=0,h.2y=k.2y,h.42=k.42,h.35="2p"==21 k.35?k.3U:k.35,h.5j=k.5j,h.5t=k.5t,h.4O=k.4O,h.cN=k.cN,l=k.6k,m=0;m<1n.1h;m++)if(1n[m].2B==j.77){h.41=1n[m].41,h.gR=1n[m].2G,h.gP=1n[m].3w,h.gO=1n[m].9B,h.gS=1n[m].9z,h.gT=1n[m].9y,h.4a=1n[m].4a,h.6C=1n[m].6C,h.7z=1n[m].7z,h.7A=1n[m].7A,h.6S=1n[m].6S;2i}if(0==4v&&"1"==l&&""==e)1d n=1J.5s||2w.3A.5p.2w[0],o="带‘*’号的项，为必填项！",J.du(n,o,0),1s 0;p={76:{7d:"on",7e:""},4i:{4i:[h]}},q=J.1y(p),r={2A:"6p",2D:q},s=J.1y(r),28.2o(s),28.2k=Y(a){1b b,h,i,j,k,l,m,n;if("er"==a){1q(b=59.1h,h=0;b>h;h++)if(i=59[h],i&&(j=i[0],k=i[1],j==c&&d==k)){59[h]=1i;2i}1q(l=0,m=0;b>m;m++)n=59[m],n&&l++;4v=0,0==l&&(4v=1),f&&g&&"2x"==g.1a.1T.4N()&&(g.1a.1Z="1S",g.1a.1T="27",f.1D="查看理由",""==e&&(f.1D="理由"))}2E 4f("提交理由到服务器失败!")}}},J.dq=Y(a,b){1b d,e,f,g,h,i,j,k,c=1F.3V;if(!c)1d 1i;if(d=c[a],!d)1d 1i;if(e=d.3P[b],!e)1d 1i;if(!e.6k)1d 1i;1q(f={3b:0,2y:0,3s:"",4o:"",3t:""},g=e.6k.2C("\\r\\n"),h=0;h<g.1h;h++)i=g[h].2C("="),1i==i||i.1h<2||(j=i[0],k=i[1],"3b"==j?f.3b=2O(k,10):"3s"==j?f.3s=k:"4o"==j?f.4o=k:"2y"==j&&(f.2y=2O(k,10)));1d f},J.dy=Y(a,b,c){1b d={76:{7d:"8a",7e:"oo"},4i:{4i:[]},4Q:{4Q:[]},2G:b,ou:a+""},e=J.1y(d),f={2A:"6p",2D:e},g=J.1y(f);28.2o(g),28.2k=Y(a){"Y"==21 c&&c(a)}},J.i2=Y(a,b,c,d){1b f,g,h,i,j,k,e=1F.3V;1d e?(f=e[a],g={3b:0,2y:0,3s:"",4o:f.6k,3t:d},h={76:{7d:"8a",7e:"oa"},4i:{4i:[]},4Q:{4Q:[g]},2G:c,3b:b},i=J.1y(h),j={2A:"6p",2D:i},k=J.1y(j),28.2o(k),28.2k=Y(a){},1s 0):!1},J.hU=Y(a,b,c){1b e,f,g,h,i,d=J.dq(a,b);1d 1i==d?"":(e={3b:d.3b,3s:d.3s,2y:d.2y,4o:d.4o,3t:""},f={76:{7d:"8a",7e:"kP"},4i:{4i:[]},4Q:{4Q:[e]}},g=J.1y(f),h={2A:"6p",2D:g},i=J.1y(h),28.2o(i),28.2k=Y(a){if(a.1O("[1X]")<0){1b b=J.fn.2v(a);c(b.3t)}2E c(J.5h())},1s 0)},J.dj=Y(){1b a,b,c,d,e,f,g,h,i,j,k,l,m;if(0==1F.as)1d 1i;if(a=1F.3V,!a)1d 1i;1q(b=[],c=0;c<a.1h;c++)if(d=a[c])1q(e=0;e<d.3P.1h;e++)if(f=d.3P[e]){1q(g={3b:0,2y:0,3s:"",4o:"",3t:""},h=f.6k.2C("\\r\\n"),i=0;i<h.1h;i++)j=h[i].2C("="),1i==j||j.1h<2||(k=j[0],l=j[1],"3b"==k?g.3b=2O(l,10):"3s"==k?g.3s=l:"4o"==k?g.4o=l:"2y"==k&&(g.2y=2O(l,10)));b.1e(g)}1d m={76:{7d:"8a",7e:"k0"},4i:{4i:[]},4Q:{4Q:b}}},J.dk=Y(a){1b b,c,d,e;1d 1F.3V.1h<=0||1F.7i<=0?(a(1),1s 0):1!=1F.as?(a(2),1s 0):(b=J.dj(),1i==b?(a(1),1s 0):(c=J.1y(b),d={2A:"6p",2D:c},e=J.1y(d),28.2o(e),28.2k=Y(b){if(b.1O("[1X]")<0){1b c=J.fn.2v(b);"hY"==c.3t?a(0):a(3)}2E a(1)},1s 0))},J.dS=Y(){1b a=1v 4S(1);a.5v(),a.5w("68",J.1y(J.dj())),di(a.5y("6p",1i,di))},J.e4=Y(a,b,c,d){1b g,h,i,j,k,l,m,e=J.fn.1f("55"+c+d).3G;""==e&&(e=J.fn.1f("55"+c+d).1P),"2p"==21 e&&(e=J.fn.1f("55"+c+d).1P),"2p"==21 e&&(e=J.fn.1f("55"+c+d).dm),e=e.1B(/^\\s+|\\s+$/g,""),J.fn.1f(a),g=J.fn.1f(b),h=J.dq(c,d),1i!=h&&(i={3b:h.3b,2y:h.2y,3s:h.3s,4o:h.4o,3t:e},j={76:{7d:"8a",7e:""},4i:{4i:[]},4Q:{4Q:[i]}},k=J.1y(j),l={2A:"6p",2D:k},m=J.1y(l),28.2o(m),28.2k=Y(a){"er"==a?"2x"==g.1a.1T.4N()&&(g.1a.1Z="1S",g.1a.1T="27"):4f("提交理由到服务器失败!")})},J.de=Y(){1b a,b,c,d,e,g,h,i,j,k,l,m,n,o,p,q,s,t,u;2c{if((""==4D||""==4b)&&(4D=1G.3D,4b=1G.2T),a="",11==4b?a="药品说明书":24==4b&&(a="中药材专论"),""==3q)1d J.fn.1f("2h").1D="<19 1c=\'5x\'>抱歉，暂未查询到“"+1G.4j+"”的"+a+"！请与美康客服中心联系，热线电话：dr-dt-dw</19>",1s 0;if(b=J.fn.2v(3q),c=b.7H,d=b.7L,0==b.5z.1h)1d J.fn.1f("2h").1D="<19 1c=\'5x\'>抱歉，暂未查询到“"+1G.4j+"”的"+a+"！请与美康客服中心联系，热线电话：dr-dt-dw</19>",1s 0;if(e=b.5z[0].ap,b.mJ,g=b.5z[0].e7,h=b.5z[0].mQ.2C(c),""!=h)1q(i=0;i<h.1h;i++)j=h[i].2C(d)[0],k=4b+"3m"+4D+"3m"+j,k=k.1B(/\\%/g,""),k=k.1B(/\\+/g,""),k=k.1B(/\\//g,""),k=k.1B(/&dl;/g,""),k=k.1B(/&/g,""),k=k.1B(/\\s+/g,""),k=k.1B(/\'/g,""),k=k.1B(/#/g,""),k=k.1B(/!/g,""),k=k.1B(/:/g,""),k=cp(k),l=1j+"/mx.mw?id="+k,m=1v 2U(j,"g"),e=e.1B(m,l),e=e.1B(\'2J 1Q="cv\',\'2J 4Z="2J" 1Q="cv\'),e=e.1B("&eo;"+l+"&eo;",\'"\'+l+\'"\');e=e.1B(1v 2U("1Q=\'1k/","g"),"1Q=\'"+1j+"/1k/"),e=e.1B(1v 2U(\'1Q="1k/\',"g"),\'1Q="\'+1j+"/1k/"),e=e.1B(1v 2U(\'1c="ep"\',"g"),\'1c="ep" 1a=\\\'1m-29:1w(\'+1j+"/1k/na.1l);\'"),e=e.1B(1v 2U("5I-eK: 2i-5I;5I-2i: 2i-8o;","g"),"5I-eK: 2i-5I;5I-2i: 2i-8o;3h-4P:6K;"),(4b!=1G.2T||""==4D)&&(4D=1G.3D),n=[],""!=e?(n.1e("<19 id=\'5C\' 1a=\'1E:",1V-cP,"1o;2H:27;\'>",e,"</19>"),J.fn.1f("6e").1D=n.1z(""),o=J.fn.1f("e2").1D,p="<19 id=\'cM\' 1a=\'2R-1H:1u;3o:1u;8x-1H:1M;1C:mY;2H:27;\'>"+o+"</19>",J.fn.1f("e2").1D=p,q=J.fn.1f("dY").1a,q.1C=1R-n3+"1o",q.1E=1V-cI+"1o",1g.9O("2J"),s=J.fn.1f("mt").1a,s.1E=1V-lP+"1o",J.fn.1f("cM").1a.1E=1V-lN+"1o",t=1,g.1h>0&&(u=g.2C(c),t=u.1h>1?g.2C(c)[2].2C(d)[1]:g.2C(c)[0].2C(d)[1],J.fn.1f("lT").1a.1E=37*t+"1o"),1V-cI>37*t?(J.fn.1f("dA").1a.1Z="1S",J.fn.1f("dM").1a.1Z="1S"):(J.fn.1f("dA").1a.1Z="",J.fn.1f("dM").1a.1Z="")):(1G.2T=10*2O(1G.2T/10)+1,J.6W())}2a(v){1d J.fn.1f("2h").1D="<19 1c=\'5x\'>"+J.5h()+"</19>",1s 0}},J.lG=Y(a,b,c){1b d,e,f,g,h,i;1d""==66&&(66=J.fn.1f("5C").1D),""!=6z?(J.fn.1f("5C").1D=6z,1s 0):(d=1G.3D,e=1G.2T,4D=a,4b=e,f=1G.4j,1G.4j=c,1G.2T=2O(b),1G.3D=a,1G.aw=0,g={2V:22,5Z:1G},2N=J.1y(g),h={2A:"8u",2D:2N},i=J.1y(h),28.2o(i),28.2k=Y(a){1b b,c,e;a.1O("[1X]")<0&&(b=J.fn.2v(a),b.5z.1h>0&&(c=b.5z[0].ap,c=c.1B(1v 2U("1Q=\'1k/","g"),"1Q=\'"+1j+"/1k/"),c=c.1B(1v 2U(\'1Q="1k/\',"g"),\'1Q="\'+1j+"/1k/"),J.fn.1f("5C").1D=c,e=J.fn.1f("dY").1a,e.1E=1V-cI+"1o",6z=J.fn.1f("5C").1D),1G.3D=d,1G.2T=4b,1G.4j=f)},1s 0)},J.mk=Y(a,b,c,d,e,f){1b h,i,j,g=J.fn.1f(f);g&&(g.1N="mp",6z=J.fn.1f("5C").1D),J.fn.1f("6e").1D="<19 1c=\'6c\' 1a=\'1m-29:1w("+1j+"/1k/5B.1l);1m-1t:no-1t;\'></19>",4D=b,4b=c,h=1G.3D,i=1G.4j,j=1G.2T,1G.4j=a,1G.3D=b,1G.2T=2O(c),1G.aw=0,J.cK(),1G.3D=h,1G.2T=j,1G.4j=i},J.ma=Y(a){1b b,c,d,e;if(a.1h<=0)1d"";1q(a=a.1B(/\\n\\r/g,"\\r\\n"),b=a.2C("\\r\\n"),c=[],d=0;d<b.1h;d++)e=b[d],e="<2l 1c=\'oD\'>"+e+"</2l>",c.1e(e+"<br>");1d c.1z("")},cG=Y(a){ak=a,0!=ak&&(J.fn.1f("cM").3v+=ak,45("cG(ak)",10))},J.1p=Y(a,b){1d""==a||1s 0==a||1i==a?b:a},J.7S=Y(){22.4H=J.1p(22.4H,""),22.53=J.1p(22.53,""),22.cF=J.1p(22.cF,""),22.cA=J.1p(22.cA,""),22.3r=J.1p(22.3r,""),22.6r=J.1p(22.6r,81)},J.cz=Y(){1G.3D=J.1p(1G.3D,""),1G.4j=J.1p(1G.4j,"")},J.cB=Y(){1x.4u=J.1p(1x.4u,""),1x.4w=J.1p(1x.4w,""),1x.4x=J.1p(1x.4x,""),1x.7U=J.1p(1x.7U,""),1x.aC=J.1p(1x.aC,""),1x.cC=J.1p(1x.cC,""),1x.cE=J.1p(1x.cE,""),1x.cD=J.1p(1x.cD,""),1x.2G=J.1p(1x.2G,""),1x.3r=J.1p(1x.3r,""),1x.3w=J.1p(1x.3w,""),1x.3W=J.1p(1x.3W,""),1x.4t=J.1p(1x.4t,1),1x.cO=J.1p(1x.cO,-1),1x.cY=J.1p(1x.cY,-1),1x.cX=J.1p(1x.cX,""),1x.cZ=J.1p(1x.cZ,-1),1x.d0=J.1p(1x.d0,-1),1x.d2=J.1p(1x.d2,""),1x.6r=J.1p(1x.6r,81),1x.ah=J.1p(1x.ah,0)},J.d1=Y(){1q(1b a=0;a<1n.1h;a++)1n[a].2B=J.1p(1n[a].2B,""),1n[a].cW=J.1p(1n[a].cW,""),1n[a].4a=J.1p(1n[a].4a,""),1n[a].4m=J.1p(1n[a].4m,""),1n[a].7z=J.1p(1n[a].7z,""),1n[a].6C=J.1p(1n[a].6C,""),1n[a].7A=J.1p(1n[a].7A,""),1n[a].9A=J.1p(1n[a].9A,""),1n[a].7w=J.1p(1n[a].7w,""),1n[a].9B=J.1p(1n[a].9B,""),1n[a].9z=J.1p(1n[a].9z,""),1n[a].9y=J.1p(1n[a].9y,""),1n[a].cV=J.1p(1n[a].cV,""),1n[a].6S=J.1p(1n[a].6S,0),1n[a].cQ=J.1p(1n[a].cQ,0),1n[a].2G=J.1p(1n[a].2G,""),1n[a].3r=J.1p(1n[a].3r,""),1n[a].3w=J.1p(1n[a].3w,""),1n[a].3W=J.1p(1n[a].3W,""),1n[a].41=J.1p(1n[a].41,""),1n[a].cR=J.1p(1n[a].cR,""),1n[a].cS=J.1p(1n[a].cS,""),1n[a].cU=J.1p(1n[a].cU,0),1n[a].7l=J.1p(1n[a].7l,""),1n[a].cT=J.1p(1n[a].cT,""),1n[a].cy=J.1p(1n[a].cy,""),1n[a].8n=J.1p(1n[a].8n,""),1n[a].8g=J.1p(1n[a].8g,""),1n[a].8j=J.1p(1n[a].8j,0),1n[a].8m=J.1p(1n[a].8m,0)},J.cx=Y(){1q(1b a=0;a<32.1h;a++)32[a].2B=J.1p(32[a].2B,""),32[a].c8=J.1p(32[a].c8,""),32[a].c7=J.1p(32[a].c7,""),32[a].41=J.1p(32[a].41,"")},J.c9=Y(){1q(1b a=0;a<3z.1h;a++)3z[a].2B=J.1p(3z[a].2B,""),3z[a].ca=J.1p(3z[a].ca,""),3z[a].cd=J.1p(3z[a].cd,""),3z[a].c5=J.1p(3z[a].c5,"")},J.c0=Y(){1q(1b a=0;a<3c.1h;a++)3c[a].2B=J.1p(3c[a].2B,""),3c[a].7l=J.1p(3c[a].7l,""),3c[a].bZ=J.1p(3c[a].bZ,""),3c[a].c1=J.1p(3c[a].c1,""),3c[a].c2=J.1p(3c[a].c2,""),3c[a].c4=J.1p(3c[a].c4,"")},J.c3=Y(){1q(1b a=0;a<2Z.1h;a++)2Z[a].5m=J.1p(2Z[a].5m,""),2Z[a].5n=J.1p(2Z[a].5n,""),2Z[a].5o=J.1p(2Z[a].5o,""),2Z[a].5J=J.1p(2Z[a].5J,""),2Z[a].2G=J.1p(2Z[a].2G,""),2Z[a].3r=J.1p(2Z[a].3r,""),2Z[a].3w=J.1p(2Z[a].3w,""),2Z[a].3W=J.1p(2Z[a].3W,"")},J.cf=Y(){1q(1b a=0;a<2W.1h;a++)2W[a].5m=J.1p(2W[a].5m,""),2W[a].5n=J.1p(2W[a].5n,""),2W[a].5o=J.1p(2W[a].5o,""),2W[a].5J=J.1p(2W[a].5J,""),2W[a].2G=J.1p(2W[a].2G,""),2W[a].3r=J.1p(2W[a].3r,""),2W[a].3w=J.1p(2W[a].3w,""),2W[a].3W=J.1p(2W[a].3W,"")},J.m9=Y(){1b a=1v 4S(2);1d a.5v(),a.5w("68",1i),cr(a.5y("gn",1i,cr)),9l},J.jd=Y(){1b a=1v 4S(1);1d a.5v(),a.5w("68",1i),ct(a.5y("gn",1i,ct)),9i},J.6A=Y(){1b a=1;1d 0==3C.2Q?0:""==1j?0:a},J.6H=Y(){1b a=1;1d 0==3C.2M?0:""==7x?0:a},87=Y(a){1b b,d,c=a jh 3u?[]:{};if("83"==21 a){if(1J.ch)b=ch.jg(a),c=ch.iY(b);2E 1q(d in a)c[d]="83"==21 a[d]?87(a[d]):a[d];1d c}},J.g6=Y(a,b){1b d,e,f,g,h,c=!1;if(!b||"iU"!=b&&"1"!=b||(c=!0),d=1i,3C.2M<=0)1d c?d={1A:1,3t:"2M功能未启用，自动通过。"}:1;if(1s 0===1I)1d c?d={1A:1,3t:"审查未获取到2M状态对象。"}:1;if(""==a||1s 0==a||1i==a){1q(d=1i,i=0;i<1I.1h;i++){d=87(1I[i]);2i}1d c?d:(d&&!cm(d.1A)&&d.1A<0&&-2!=d.1A&&-3!=d.1A&&-8!=d.1A||1F&&1==1F.4y)&&1==1x.4t?-1:d&&!cm(d.1A)&&(1!=1x.4t&&d.1A<0||1==1x.4t&&(-2==d.1A||-3==d.1A||-8==d.1A))||1F&&1==1F.4y?0:1}1q(d=1i,i=0;i<1I.1h;i++){if(d=87(1I[i]),1==1x.4t&&d&&d.1A&&(-2==d.1A||-3==d.1A||-8==d.1A)){if(e=!1,d&&d.3T&&d.3T.1h>0)1q(f=0;f<d.3T.1h;f++){if(g=d.3T[f],g.9r&&g.9r.1h>0)1q(h=0;h<g.9r.1h;h++)g.9r[h]==a&&(e=!0);if(1!=g.4E){d.1A=-1;2i}e||(d.1A=1)}d&&d.3T&&1i==d.3T&&(d.1A=1)}d.1A=(!d.1A||d.1A>=0)&&1F&&0==1F.4y?1:0}1d c?d:d&&!cm(d.1A)?d.1A:0},J.d3=Y(){if(""==7x||!2u)1d!1;2c{2u.4H||(2u.4H=""),2u.4u||(2u.4u=""),2u.4w||(2u.4w=""),2u.4x||(2u.4x=""),2u.41||(2u.41=""),2u.4z?0==2u.4z?2u.4z=1:3==2u.4z?2u.4z=2:1!=2u.4z&&2!=2u.4z&&(2u.4z=2):2u.4z=2}2a(a){1d!1}1d!0},J.f4=Y(){1b a=1v 4S(2);a.5v(),a.5w("68",J.1y(2u)),dx(a.5y("da",1i,dx))},J.8r=Y(a,b,c){1b d={2A:a,2D:J.1y(b)},e=J.1y(d);3Z.2o(e,c),3Z.2k=Y(a){J.2P(4T,d.2A+"："+a,6s),c(a)}},J.f7=Y(a,b){J.8r("kI",a,Y(a){b(a)})},J.dc=Y(a,b){J.8r("kQ",a,Y(a){b(a)})},J.4I=Y(a){J.8r("da",2u,Y(b){a(f0(b))})},J.eT=Y(a){J.8r("da",2u,Y(b){if(3H=0,b.1O("[1X]")<0){1b c=J.fn.2v(b);a&&""!=a&&"Y"==21 a&&a(c.1A<0?0:1,c)}})},J.9g=Y(){1b b,c,d,a=J.fn.1f("eQ").1a;1q(a&&(a.1Z=""),b=1g.9O("ck"),c=0;c<b.1h;c++)b[c].1a.1T="2x",b[c].4Y=!0;d=J.fn.1f("eX"),d&&(d.1K=Y(){J.fz()})},J.lv=Y(){1b b,c,d,a=J.fn.1f("eQ").1a;1q(a&&(a.1Z="1S"),b=1g.9O("ck"),c=0;c<b.1h;c++)b[c].1a.1T="27",b[c].4Y=!1;d=J.fn.1f("eX"),d&&(d.1K=Y(){J.9g()})},J.lj=Y(a,b){1b e,f,c=J.fn.1f(a),d=J.fn.1f(b);if(c&&d)1q(e=d.5V("a6"),f=0;f<e.1h;f++)e[f].4Y=c.4Y},J.lh=Y(a,b){1b f,g,c=J.fn.1f(a),d=J.fn.1f(b),e=!1;if(c&&d){1q(f=d.5V("a6"),g=0;g<f.1h;g++)if(f[g].4Y){e=!0;2i}c.4Y=e}},9V.2d.dP=Y(a){1b c,b={"M+":U.a8()+1,"d+":U.d6(),"h+":U.d7(),"m+":U.ds(),"s+":U.a3(),"q+":d8.k8((U.a8()+3)/3),S:U.fx()};/(y+)/.dn(a)&&(a=a.1B(2U.$1,(U.fB()+"").ad(4-2U.$1.1h)));1q(c in b)1v 2U("("+c+")").dn(a)&&(a=a.1B(2U.$1,1==2U.$1.1h?b[c]:("jO"+b[c]).ad((""+b[c]).1h)));1d a},dp=Y(){1b a,b,c;2c{a={2V:22,6T:1x,6Q:{6U:32},5F:{5O:1n}},2N=J.1y(a),b={2A:"jT",2D:2N},c=J.1y(b),28.2o(c),28.2k=Y(a){1d 4f(a),a}}2a(d){}},J.fz=Y(){1b k,l,m,n,a=!1,b=J.fn.1f("jX"),c=J.fn.1f("jW"),d=J.fn.1f("jU"),e=J.fn.1f("jV"),f=J.fn.1f("kd"),g=J.fn.1f("kx"),h=J.fn.1f("kw"),i=1g.9O("ck"),j=1g.5V("kt");if(i&&j)1q(k=0;k<i.1h;k++)i[k].4Y?(a=!0,j[k].1N="6i","kD"==i[k].id&&(f.1N.1O("5Y")>0&&(f.1N="8t 6i",g.1N="kB 6i"),h.1N="kf"),i[k].id.1O("kg")>0&&b.1N.1O("5Y")>0&&(b.1N="8t 6i",c.1N="eR 6i"),i[k].id.1O("fm")>0&&d.1N.1O("5Y")>0&&(d.1N="8t 6i",e.1N="g7 6i")):j[k].1N="5Y";1d a?(l=J.fn.1f("jQ").1a,l&&(l.d5="27",l.1E="4C"),m=J.fn.1f("ny").1a,m&&(m.d5="27",m.1E="4C"),n=J.fn.1f("lU"),n&&(n.1a.1Z="7a",n.3G=(1v 9V).dP("n5-n0-dd hh:mm:oY")),!+[1]&&b3&&b3.g0?b3.g0(7,1):1J.ky(),m&&(m.1E="2z%",m.d5="4C"),n&&(n.1a.1Z="1S",n.3G=""),b&&(b.1N="8t 5Y"),c&&(c.1N="eR 5Y"),d&&(d.1N="8t 5Y"),e&&(e.1N="g7 5Y")):4f("请至少选择一项打印！"),!1},J.cj=Y(){1b a,b,c;1d 1g.2g("2h")&&(a=1g.2g("2h").1D,a=a.1B(1v 2U("J.cj"),"J.9g"),a=a.1B(1v 2U("j9"),"nX"),a=a.1B(1v 2U("nW"),"nZ"),b=[],b.1e("<av>"),b.1e("<fQ>"),b.1e("<33>用药指导单打印</33>"),b.1e(\'<nQ 3L="2R/gl" nR="o2" 5M=\'+1j+"/cL/od.gl />"),b.1e(\'<7v 3L="2R/au" 1Q=\'+1j+"/cL/o6.js></7v>"),b.1e(\'<7v 3L="2R/au" 1Q=\'+1j+"/cL/oE.js></7v>"),b.1e("</fQ>"),b.1e(\'<1W 1a="2H-y:27;">\'),b.1e(a),b.1e("</1W>"),b.1e("</av>"),c=1J.cJ("","cH"),c&&(c.1g.md(b.1z("")),c.1g.7Q())),!1},J.fS=Y(){1b a,b,c;2c{a={2V:22,6T:1x,6Q:{6U:32},5F:{5O:1n}},2N=J.1y(a),b={2A:"n4",2D:2N},c=J.1y(b),28.2o(c),28.2k=Y(a){a.1O("[1X]")<0&&(6t.5M=a)}}2a(d){}},J.ew=Y(a,b){if(1!=3H&&(3H=1,J.4W=1,1s 0!=b&&(J.4W=b),J.cl(),5U=0,a)){1L=a,1L=1L.1B(/\\%/g,"%25"),1L=1L.1B(/\\+/g,"%2b"),1L=1L.1B(/\\s/g,"%20"),1L=1L.1B(/&dl;/g,"%26"),1L=1L.1B(/&/g,"%26"),1L=1L.1B(/@/g,"%40"),1L=1L.1B(/\\//g,"%2F"),1L=1L.1B(/\\?/g,"%3F"),1L=1L.1B(/\\#/g,"%23"),1L=1L.1B(/\\$/g,"%24");1b c=1v 4S(1);c.5v(),c.5w("68",1L),c6(c.5y("92",1i,c6))}},J.hE=Y(a,b,c){1d 1!=2j?(b(2j),1s 0):(1!=3H&&(1L=a,3H=1,J.3K=b,J.4W=1,1s 0!=c&&(J.4W=c),J.4G(J.hP)),1s 0)},J.hP=Y(){1b a,b,c;9a=5E(),5U=0,1L&&(a={2A:"92",2D:1L},b=J.1y(a),c=28,c.2o(b,J.3K),c.2k=Y(a){3H=0,a.1O("[1X]")<0?(J.2P(4T,"审查结果："+a,6s),1F=J.fn.2v(a),1i!=1F&&(J.2r=1F.7i,J.2r>0&&J.8E(1))):"[1X]:5g"==a?(2j=-99,J.2r=-99):(2j=-10,J.2r=-10),U.3k&&""!=U.3k&&"Y"==21 U.3k&&U.3k(J.2r)},61=5E())};',62,1557,'|||||||||||||||||||||||||||||||||||||||||||||McPASS|||||||||||this||||function|||||||||||div|style|var|class|return|push|byId|document|length|null|mcWebServiceUrl|PassImage|gif|background|McDrugsArray|px|Verify|for|td|void|repeat|left|new|url|MCpatientInfo|toMcJSONString|join|Status|replace|width|innerHTML|height|MC_global_Screen_PASSdata|MC_global_queryDrug|align|MC_global_Screen_PRstatus|window|onclick|MC_global_Screen_HISdata|top|className|indexOf|value|src|mcWindowWidth|none|visibility|nbsp|mcWindowHeight|body|ERROR|config|display||typeof|MCPASSclient|||||hidden|McAjax|image|catch||try|prototype|tr|MCrefModuleArray|getElementById|mcDivWindowBody|break|mc_pass_init_success|onmessage|span|color|documentElement|send|undefined|backgroundImage|ScreenHighestSlcode|case|iframe|McGetStatus|EvalJson|arguments|visible|ModuleID|100|PASSFuncName|Index|split|PASSParam|else||DeptCode|overflow|win|img|table|1px|PR|MC_global_ref_HISdata|parseInt|Debug|PASS|text|cursor|ReferenceType|RegExp|PassClient|McExamArray|hidefocus|attachEvent|McLabArray|||McMedCondArray|title||Slcode|onmouseout||border|mcDivWindow|onmouseover|MHisCode|McOperationArray|screen|addEventListener|DeptCodeToReason|false|font|pointer|toString|callback|mcDivShade|_|scrollLeft|float|McrefTipArray|MC_global_ref_PASSdata|DeptName|CaseID|Reason|Array|scrollTop|DoctorCode|index|McDetailItemsScreen|McAllergenArray|callee|createElement|mc_product_switch|ReferenceCode|show||innerText|mc_is_screen_now|disabled|Mobile|Screen_callback|type|charCodeAt|McCloseWindow|right|ScreenResults|margin|receiverWin|padding|NewUseReason|SlCode|ScreenResultDrugs|DoctorName|1e3|mc_iframe_bg|McAjaxPR||RecipNo|ModuleName|jpg|constructor|setTimeout|McClsWindow|queue|frameborder|senderWin|DrugUniqueCode|mc_really_type|error|TelePhone|700|alert|reasons|mcDivChoose|ExecuteDrugUseReason|CodeName|readyState|onreadystatechange|DrugName|absolute|ReasonKey|_width|position|center|DetailType|PatStatus|PatCode|mc_cancloseWindow|InHospNo|VisitCode|ShouldBlock|TaskType|params|solid|auto|mc_really_code|WarnType|Mc_Base64|McGetModuleName|HospID|Mc_PR_GetStatusObj|Urgent|mc_polling_timer|USER|white|toLowerCase|ModuleItems|size|ExecuteUseReason|DetailParams|MC_client_request|IsDebugResult|mcMsgWindowHead_closer|scroll|isShowWindow|parentNode|checked|name|||deptcode|UserID|setAttribute|mcWriteUserReson|hand|MC_current_Detail_divId|McClose|McScreenReasonArray|afterBegin|insertAdjacentElement|200|Mcscroll|10px|_cursor|timeout|ErrorTip|charAt|Severity|mcDivWindowHead|40px|RequestNo|LabExamCode|LabExamName|caller|McMsg_close_normal|dragWindow|event|Warning|sb|ClearParam|AddParam|mcloading|post|ReferenceResults|textarea|loading|mcrefContentDiv|MouseInfo|McGetCurrentTime|ScreenDrugList|String|MsgWindow|word|StartDateTime|400|clientX|href|600|ScreenDrugs|clientY|mcDivscreendTitle|drag|match|mcIptUseReason_|MC_global_Screen_Count|getElementsByTagName|flush|mc_close_normal|mcNoPrint|ReferenceParam|Abstract|McDebug_t2|pb||firstChild|call|mcstrManualUser|McFuncRefChange|psJSONStr|IsPassTool|Type|McAjaxSync|mc_common_loading|McDetailItems|mcRefMainLeftDivId|McMaxMinWindow|absMiddle|weight|mcPrint|14px|DetailReason|ShowToDoctor|mcPRDivWaitOverTime|128|mc_is_pr_request|Mc_DoReason|insertBefore|CheckMode|DebugShowDiv_Result|location|popMsg|init|mcLastReferenceCode|MChospitalName|mcMsgWindowHead_maxmin|mcstrMoreList|Mc_PassSwitch|mcTextUseReason_|DoseUnit|valign|cellspacing|cellpadding|mcIptUseReason|Mc_PrSwitch|mcDivUseReasonBody_|c9c9c9|15px|appendChild|contentWindow|White|mc_msg_win_zIndex|startReceive|ScreenMedCondList|indent|IsTempDrug|Patient|ScreenMedConds|mcDetailParms|Mc_Empty|message|timerId|__closeWin||mcRightMenu|MCdataVersion|ReferenceTip|mcBtnCommitUseReason_|complete|Execute|DrugIndex|90px|5px|block|Object|mcPRDivWaitTip|sExeClass|sConStr|IsShowMenu|select|MCprojectVersion|HighestSlcode|user|eventType|OprCode|McDetailContent|mcDivItemDetailRowMore_|moz|MCscreenModuleArray|bold|btnCounterSign|oncontextmenu|isIE|MC_current_Detail_btnId|script|RouteName|mcPrWebServiceUrl|mcScreenPuckerAll|DosePerTime|Frequency|McUnCloseWindowCallBack|Mc_pass_Div|McChooseReason|MCcanGetScreenDtlRes|mcBtnDeep|mcDivChooseed|Delimiter|IsNewWarning|MC_global_Detail_PASSdata|mcBtnDeepDisable|SubDelimiter|mc_is_fullfill|divId|DisclaimerWindow|mcDivWindowBodyAttr|close|MCmhiscode|MCPASSclient_Verify|rb|Name|mc_copy_flag|clientHeight|Title|availHeight|450||MC_global_CheckMode|mcDivItemDetailRowMoreBody|object|7px|DebugShowDiv_Drug|mc_pr_statusobj|cloneObj|initInParent|LinkText|USEREASON|btnId|LinkParams|jsondata|250|mcLastReferenceType|driptime|mcHeader_close|mcPRDivCounterSignUseReason|IsOtherRecip|McRefWindow|onselect|duration|driprate|all|mc_maxmin_flag|2px|MC_PR_Perform|MC_global_Detail_HISdata|mcPGLine|Mc_DoQuery|click|ActiveXObject|vertical|2em|DetailTip|availWidth|switch|McReturnToModify|McFoldItemDetailRowMoreDiv|McAnalyzeScreenResult|oncopy|150px|getElementsByClassNameTemp|mcBtnUseReason_|300|mcTextUseReason|IV|RefMode|McScreenJsonAddAPI|85px|mcReasonFade|Alone|mcOK|McFoldItemDetailDiv|30px|middle|McDetail_close_Normal|DisplayMode|___mcPrStatusIsPass|ub|SysMenu||mcDivUseReason_|Mc_DoScreen|OtherReasonOnBlur|20px||bottom|McDoModuleRes|||McDebug_t1|150|mcDivOtherReason|GetNewUseReasonObj|McScreenWindow|646464|McShowPrintPG|mc_close_hover|mc_pass_isreg|mcDivWindowBottom|filter|mc_pr_isreg|passlogo|mcHeader_logo|mc_pr_status|errmore|mc_pass_isshowreason|Indexs|MC_Window_Top|MC_Window_Left|Alpha|opacity|mc_config_height|mc_config_width|ExecuteTime|EndTime|RouteCode|StartTime|onselectstart|McMsg_close_hover|mcMsgWindowHead|scrollWidth|mcheader|mcMsgWindowHead_logo|mcMsgWindowHead_close|mcpasslogo|IsAvailable|POST|sendForSameOrigin|initForSameOrigin|getElementsByName|eventSource|ondataavailable|eventData|parent|postMessage|defineProperty|Date|windows|DOMContentLoaded|detachEvent|onload|initForParent|999px|about|getSeconds|blank|bindReady|input|ready|getMonth|receive|initForFrame||cssText|substr|waitForFrame|tryReceive|setInterval|IsDoSave|scrollHeight|100px|scrollManual_t|absmiddle|clientWidth|mc_screen_win_zIndex|MCModuleParam|BriefItems|OverTime|bbb|MustUseReason|mc_shade_first_zIndex|javascript|html|IsDrug|mc_shade_second_zIndex|childNodes|offsetHeight|onmousedown|maxHeight|Sex|Mcscroll_n|item|skintest|doseday|McDetail|reSetDrugWarnLight|Params_MC_queryDrug_In|newMcAjaxPR|btnClose|McRecipeScreenLight_|McPASSCallBackSync|McGetModuleNameSyncCallBack|McMenuRef|MDC_getWarningCode|mcDivScreenLeft2ID|newMcAjax|removeEventListener|McDetailItems_In|WorkerName|mcTextSeverity|CUSTOMRULE|MDC_DoCheck|atob|mcCustom|btoa|loaded|wb|endtime|starttime|moredaydesc|reciptypename|load|hasError|mcBtnShowHideDetail_||mcDivScreenDrugDetail_|PassTime|ondblclick|reciptypecode|TaskID|mcDivText|mcDivReason|zShade|checkDoctorFilter|rows|mcTextarea|MC_Is_SyncCheck|shadeOpacity|onblur|mcUSER||shade|menuActiveLeft|DealReasonsAndShowNoPassDiv|checkUrgent|mc_ref_win_zIndex|idScroller|mccheckDoctorFilter|mcDivWindowBodyLeft|urgent|McCounterSign|McDebug_t3|move|MHiscode|TaskId|mcCheckUrgent|string|status|key|mcRightMenuUL|serverUrl|mcBtnClose|McPASSInit|McCancelUseReason|mcwinheader|HideCloseButton|50px|mc_alert_win_zIndex|mc_shade_disclaimer_zIndex|ProductCode|ul|mc_disclaimer_win_zIndex|clearTimeout|80px|OprName|McOperationArray_Verify|IncisionType|OprStartDate|McLabArray_Verify|OprEndDate|AllerSymptom|McScreenSyncHandler|DiseaseName|DiseaseCode|McAllergenArray_Verify|AllerCode||9c4612|AllerName||McExamArray_Verify|RecomDoseWindow|JSON|OpenRefPlatform|McPrintOpenPGWindow||McGetModuleNameSync|isNaN||doctorcode|encodeURIComponent|ScreenAllergenList|Mc_PR_RegSyncCallBack|ScreenResultString|Mc_PASS_RegSyncCallBack|InputJsonInfos|http|ScreenAllergens|McMedCondArray_Verify|Remark|MC_global_queryDrug_Verify|DeptID|MCpatientInfo_Verify|Birthday|WeighKG|HeightCM|UserName|mcscrollManual|_blank|142|open|McFuncCallQuery|PassJs|mcidScroller|OtherInfo|IsLactation|110|OrderType|Num|NumUnit|MediTime|Purpose|GroupTag|OrderNo|PregStartDate|IsPregnancy|HepDamageDegree|RenDamageDegree|McDrugsArray_Verify|UseTime|FormatGetStatus|InputJsonInfoList|overflowY|getDate|getHours|Math|McFormatParagraph|Mc_GetStatus||Mc_PR_CounterSign||Mc_Manual|mcunexpand|default|Brief|McGetIsFullFillReasonSyncCallBack|McGetAllUseReasonKey|McGetIsFullFillReason|amp|textContent|test||MDC_GetPGURL|McGetReasonKey|4006|getMinutes|821|AlertWindow|qrcodeDiv|210|Mc_PR_GetStatusSyncCallBack|McDoGetReasonByDeptCode|IsDebugOperation|btUp|ProjectVersion|target|MCDEX|McMenuActive|DebugShowDiv_MedConds|AloneQuery|255|IsDebugAllergens|DebugShowDiv_Recipes|McdoMenu|DebugShowDiv_Allergens|btDown|IsDebugMedConds|RightMenuTip|Format|RHCName|mcDivContent|McGetIsFullFillReasonSync|paddingLeft|currentStyle|mcDivTitle|mcPRDivCounterSignReason|children|body_main_html|active|DrugNameEncode|McPASScheckSync|mcManualPara|Mc_PASSPR|McDoSaveReason|ReferenceModuleList|MCDEXUrl|DetailItems|mcPRDivCounterSignContactNormal|DebugShowDiv_Operation|McAloneQuery||labexamcode|mcDisclaimer|requestno|labexamname|startdatetime|McPASScheck|doctorname|deptname|Mc_DoModule|DrugSource|55296|McFormatMsgQuery|quot|mcErrataBodyTitle|65536|EXECUTE_OK|RouteSource|offsetWidth|McScreen|ScreenOperationList|McScreenSyncByJson|removeChild|McMsgQueryResult|AloneQueryType|IsFast|ModuleParam|MedicareType|DataVersion|56320|IsDebugRecipes|IsDebugPatient|ScreenModuleList|ScreenOperations|DebugShowDiv_Patient|wrap|msgshow|CanGetScreenDtlRes|Temperature|McAloneQueryTip|toBase64|btnCancel|mcPGNotice|loadXMLString|Mc_PR_GetStatus|createXMLHttpRequest|fetchData|XMLHttpRequest|btnPrint|XDomainRequest|Microsoft|__preProcessStatusResult|regexp|Params_MC_ModuleParam_In|isPC|Mc_PR_GetStatusSync|mlf35wieQdgHJ478gk06slVGSMrhy9Y2yjfhlkTv1|mc_shade_color_zIndex|Mc_PR_ApplyForReview|array|ADR|iphone||ipad|asmx|midp|iframe_pr|initInIframe|HTMLElement|createEventObject|data|source|nextSibling|Inter||doScroll|self|mobile|fireEvent|substring|decodeURIComponent|ucweb|rv|android|getMilliseconds|createDocumentFragment|McPrintPG|clearInterval|getFullYear|Params_MC_PASSclient_In|OprCombinedMediNum|onmouseup|releaseCapture|loadMenu|mc_left|fromBase64|NeedCounterSign|disclaimerWindow|mc_resizediv|setCapture|onmousemove|mc_right|McMenuclass|head|McAnalyzeLinkDetailResult|McExportWord|mouseY|100008|mc_Expand_normal|black|mcMenu|mcrefsplit|mc_Pucker_normal|execwb|com|mcHeader_Hospital|mcDivWindowBottomVersion|decoration|underline|McPrSysStatus|mcPGInter|Params_MC_GetStatus_In|json|singleScreenshow||quickExpr|Highlight|mcDivWindowBottomLogo|family|Arial|www||medicom|Alertshow|css|mcLogo|Mc_GetProductRegistInfo|mcDrugAttribeDiv|mouseX|McDoQueryMsg|3px|500|McDebugShowTime|McDetail_close_hover|mcOKon|Mcdoreson|btnReturnToModify|PRSwitch|Params_MC_UseReason_In|McdoresonOld|detail_header_close|McApplyForReview|McDoctorFilter|McResonContent|eval|McConfirm|mcTempletReason|removeAttribute|IsEmpty|McAutoCounterSign|McShowIM|Hiscode|Results|OrderStartTime|OrderDoctorCode|backgroundColor|OrderDeptCode|OrderEndTime|OrderExecuteTime|0px|MDC_DoRefDrug|mcDivDetailRowMore|mcWarningMain|mcTable|reason|HospName|_margin|Hisname|mcBtnShallow|List|mcWarningTitle|mcDivPanel|mcUserLabel|reasoninputs|McCheckUrgent|McDodetail||mcScreenBodyDiv|McAnalyzeDetailResult|PICPRPECHP|mcbackground|Mc_pass_click||Mc_user_Div|McFuncGetQueryHisData|mclinkPASSNormal|Mc_QueryHTML|IsDebugDrugInfo|Record|McDoLinkdetail|mcMainText|Mc_DoDetail|mcBtnShowDetail|colspan|D4D6E2|mcTdItem|mcTdTitle|Mc_RefShow|115|getElementsByClassName|mcDivOtherReason_|QueryRecomDose|encode|getAttribute|MDC_ShowRecomDosWarn|McScreenAsyncByJson|mcBodyDiv|mcDrugTitle|McShowUseReason|DealReasonsAndShowDiv|mcpgline|PGWindow|QueryPG|mcexpand|McCommitUseReason|focus|McScreenAsyncHandler|tagName|QRCode|12px|mcDetail_div|McDoGetReason|McRightMenu|mcPRDivWaitProgressBar|mcPRDivWaitProgress|NOTFULLFILL|Paused|mcSeqNo|mcLinkHeader|McDoSaveReasonNew|module|PassVersion|Resolution|OSInfo|McCounterSignChooseReason|mac|CorrectLevel|MouseEvent||otherinfo||Params_MC_Patient_In||Telephone|IDCard|Params_Mc_Drugs_In|Form|Strength|OutHospDate|InHospDate||PCName|Age|PayClass|IsTestEtiology|CodeSource|ClientIP|mhiscode|userAgent|mKPpCv1n4c4h5|inline|Mc_Init|Drugfood|PGURL_IMAGE|Duplicate|DrugAsp|uDC00|Druglevel|1e5|100001|navigator|correctLevel|IsForStatic|CompName|NeedApply|100007|100006|100002|100003|100004|100005|IP|Cost|detail|timestamp|uDFFFF|224|parse|9C4612|350|detection|format|hiscode|KeyboardEvent|exec|RefPlatformURL|from|Mc_DoDoctorFilter|btnExport|continue||nodeType|Mc_PASS_RegSync|webkit|apply|stringify|instanceof|ToString|while|mcScreenLight_0|45px|DisTimeType|DisSource|Ishospinfection|Params_Mc_Operation_In|OprMediTime|Params_Mc_MedCond_In||AllerSource|Pharmacists|Pharmacists_|Route|Params_Mc_Allergen_In|OprTreatTime|OprInBloodTransfusion|310px|mcBtnShowDetailVisited|mc_max|mc_min|png|Count|Params_Mc_Exam_In|makeCode|OprCombinedMediOrderCodes|OprLength|Params_Mc_Lab_In|FreqSource|Adult|mcDivOpinion|00|mcdetailtitle_screen|maindiv|mcdetailtitle_ref|1024|Mc_DoQRCode|lineinter|pginter|pgnotice|linenotice|240|mcDivName|GETALL|warning2|warning3|warning1|PASSwebService|WebService|warning4|138|floor|mcreferBodyDiv|mcDetailTitle||Articletitle|yfline|mcPRDivCounterSignButton|mcYFTable|Notice|uD800|mcPRDivCounterSignBtnContent|beforeBegin|beforeEnd|afterEnd|mcPRDivWaitImg|Ready|DetailResults|mcPRDivWaitMain|DetailDesc|McPR|round|label|bolder|8e3|yftable|yfdiv|print|opera|mcDivDetailRowMoreBody|mcYFDiv|getEventTemp|yfinput|Service|Event|isFinite|number|Mc_ApplyForReview|ceil|MenuState|boolean|unknown|mcPRDivCounterSignHeader|mcPRDivCounterSignTip|GET|Mc_CounterSign|Mc_DoQueryPG|SP|Level|Lactation|Pregnancy|Indication|Drugallergen|screentype|Geriatric|Pedtatric|Wholetext|Contraind|Druginter|Dosage|responseText|Mc_DoReturnModify|XMLDOM|mclinkPASSActive|async|loadXML||DOMParser|mcPRDivCounterSignBody|warning|XMLHTTP|mcScreenLight_null|McChangeHeader||McChangeAll|parseFromString|xml|form|application|urlencoded|charset|utf|Content|setRequestHeader|mcPRDivCounterSignContactHover|mcTitle|McHidePrintPG|mcPRDivCounterSignPharmacist|cmdExportYongyaozhidaodan|Mc_DoQueryRecomDose|aspx|search|st|drugsource|uc|space|utob|ManualsearchList|druguniquecode|mcBlock|mcRouteHeader|normal|warning0|rowspan|187|Za|185|otherrecipinfo|PatLevel|z0|ParaPosition|printtime|52px|recipno|VERSION|getComputedStyle|mcDivPanelBody|mcDivReasonBtnContent|decode|mcDivReasonRowMoreFoot|btou|mcDivUseReasonFoot_|doseunit|routesource|enumerable|button|Mc_PR_RegSync|McFormatManualParagraph|||write|encodeURI|mcDivUseReasonTitle_|offsetTop|offsetLeft|drugindex|drugname|McRefQuery|mcDivReasonRowMoreTitle||mcDivReasonRowMoreBody|mcSpanRoute|mcMoreListV|mcSpanName|mcDivPanelHead||body_left|medicaretype|baseline|ashx|Images|211|mcMsgContent|mcMsgPanel|mcBriefBigTitle|mcDivMsg|mclistbreif|boder|isfast|patientinfo|212|MDC_DoCheckByJson|ResultMode|Mc_PR|mcpoint|jsontype|34_|51_|5001|OtherItems|11_|prtasktype|mcBtnMsg|1001|mcDivDetailRow|mcdivPanel|mcReasonHeader|125px|220px|MM|patlevel|efedf5|125|Mc_DoPrint|yyyy|MDC_GetSysPrStatus|mc_iframe|1011|MDC_DoPassCommand|mckanwu_title||1010|60px|mcDivDetailRowHead|1023|MDC_PR_GetStatusSync|mcDrugAttribute|MDC_PR_GetStatus|temperature|routecode|noConflict|WorkerId|McChangeResaonMemo||McPASSTalk|mcWarning|70px|exports|1000px|mcDivItemReasonRowMore_|mccheckedDoctorFilter||require|pgcontent|ShowCloseButton|69C0EF|16px|service|85174760|mc_Expand_hover|MDC_IsFullFillReason|examinfo|028|mcdetailtitle_reason|0078d7|uDBFF|line|18px|toBase64URI|mcBtnItemDetailRowMore_|560|link|rel|220|192|resize|Meteor|mcPGPatInfo|btnExportNoShow|rclass|mcPGPatInfoPrint|TipAttach|180|Stylesheet|ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789|fromCharCode|Buffer|McConfig|buffer|McFoldResonRowDiv|mcCheckedUrgent|SAVE||210px|McCssAll|2048|labinfo|511|mcPRBottomDiv|MDC_GetResultDetail|mcPRBottom||mcBtnReturnToModify|mcScreenMainDiv|DRUGUSEREASON|GETCHOOSEREASON|use|configurable|600px||btnApplyForReview|HisCode|MDC_DelScreenDrug|130|mcDivScreenWindowBodyLeft|mcScreen_Pucker|PuckerAll|mc_Pucker_hover|routename|mcScreen_Expand|mcManualparag|McJsAll|splice|druginfo|OrderIndex|mcScreenLight_|writable|mc_split|mcBtnApplyForReview|MDC_ShowWarningHint|strict|HasPR|diseaseinfo|extendString|ccc|110px|maxlength|550px|x00|IsDebugExecTime|x7F|ss|mcDivDrugAttribe|btnConfirm|mcBtnConfirm|mcBtnCounterSign|D4D4D4|btnAutoCounterSign|htmlold|mcrefMenuDiv'.split('|'),0,{}));
/**
 * @fileoverview
 * - Using the 'QRCode for Javascript library'
 * - Fixed dataset of 'QRCode for Javascript library' for support full-spec.
 * - this library has no dependencies.
 * 
 * @author davidshimjs
 * @see <a href="http://www.d-project.com/" target="_blank">http://www.d-project.com/</a>
 * @see <a href="http://jeromeetienne.github.com/jquery-qrcode/" target="_blank">http://jeromeetienne.github.com/jquery-qrcode/</a>
 */
var QRCode;

(function () {
    //---------------------------------------------------------------------
    // QRCode for JavaScript
    //
    // Copyright (c) 2009 Kazuhiko Arase
    //
    // URL: http://www.d-project.com/
    //
    // Licensed under the MIT license:
    //   http://www.opensource.org/licenses/mit-license.php
    //
    // The word "QR Code" is registered trademark of 
    // DENSO WAVE INCORPORATED
    //   http://www.denso-wave.com/qrcode/faqpatent-e.html
    //
    //---------------------------------------------------------------------
    function QR8bitByte(data) {
        this.mode = QRMode.MODE_8BIT_BYTE;
        this.data = data;
        this.parsedData = [];

        // Added to support UTF-8 Characters
        for (var i = 0, l = this.data.length; i < l; i++) {
            var byteArray = [];
            var code = this.data.charCodeAt(i);

            if (code > 0x10000) {
                byteArray[0] = 0xF0 | ((code & 0x1C0000) >>> 18);
                byteArray[1] = 0x80 | ((code & 0x3F000) >>> 12);
                byteArray[2] = 0x80 | ((code & 0xFC0) >>> 6);
                byteArray[3] = 0x80 | (code & 0x3F);
            } else if (code > 0x800) {
                byteArray[0] = 0xE0 | ((code & 0xF000) >>> 12);
                byteArray[1] = 0x80 | ((code & 0xFC0) >>> 6);
                byteArray[2] = 0x80 | (code & 0x3F);
            } else if (code > 0x80) {
                byteArray[0] = 0xC0 | ((code & 0x7C0) >>> 6);
                byteArray[1] = 0x80 | (code & 0x3F);
            } else {
                byteArray[0] = code;
            }

            this.parsedData.push(byteArray);
        }

        this.parsedData = Array.prototype.concat.apply([], this.parsedData);

        if (this.parsedData.length != this.data.length) {
            this.parsedData.unshift(191);
            this.parsedData.unshift(187);
            this.parsedData.unshift(239);
        }
    }

    QR8bitByte.prototype = {
        getLength: function (buffer) {
            return this.parsedData.length;
        },
        write: function (buffer) {
            for (var i = 0, l = this.parsedData.length; i < l; i++) {
                buffer.put(this.parsedData[i], 8);
            }
        }
    };

    function QRCodeModel(typeNumber, errorCorrectLevel) {
        this.typeNumber = typeNumber;
        this.errorCorrectLevel = errorCorrectLevel;
        this.modules = null;
        this.moduleCount = 0;
        this.dataCache = null;
        this.dataList = [];
    }

    QRCodeModel.prototype = {
        addData: function (data) { var newData = new QR8bitByte(data); this.dataList.push(newData); this.dataCache = null; }, isDark: function (row, col) {
            if (row < 0 || this.moduleCount <= row || col < 0 || this.moduleCount <= col) { throw new Error(row + "," + col); }
            return this.modules[row][col];
        }, getModuleCount: function () { return this.moduleCount; }, make: function () { this.makeImpl(false, this.getBestMaskPattern()); }, makeImpl: function (test, maskPattern) {
        this.moduleCount = this.typeNumber * 4 + 17; this.modules = new Array(this.moduleCount); for (var row = 0; row < this.moduleCount; row++) { this.modules[row] = new Array(this.moduleCount); for (var col = 0; col < this.moduleCount; col++) { this.modules[row][col] = null; } }
            this.setupPositionProbePattern(0, 0); this.setupPositionProbePattern(this.moduleCount - 7, 0); this.setupPositionProbePattern(0, this.moduleCount - 7); this.setupPositionAdjustPattern(); this.setupTimingPattern(); this.setupTypeInfo(test, maskPattern); if (this.typeNumber >= 7) { this.setupTypeNumber(test); }
            if (this.dataCache == null) { this.dataCache = QRCodeModel.createData(this.typeNumber, this.errorCorrectLevel, this.dataList); }
            this.mapData(this.dataCache, maskPattern);
        }, setupPositionProbePattern: function (row, col) { for (var r = -1; r <= 7; r++) { if (row + r <= -1 || this.moduleCount <= row + r) continue; for (var c = -1; c <= 7; c++) { if (col + c <= -1 || this.moduleCount <= col + c) continue; if ((0 <= r && r <= 6 && (c == 0 || c == 6)) || (0 <= c && c <= 6 && (r == 0 || r == 6)) || (2 <= r && r <= 4 && 2 <= c && c <= 4)) { this.modules[row + r][col + c] = true; } else { this.modules[row + r][col + c] = false; } } } }, getBestMaskPattern: function () {
            var minLostPoint = 0; var pattern = 0; for (var i = 0; i < 8; i++) { this.makeImpl(true, i); var lostPoint = QRUtil.getLostPoint(this); if (i == 0 || minLostPoint > lostPoint) { minLostPoint = lostPoint; pattern = i; } }
            return pattern;
        }, createMovieClip: function (target_mc, instance_name, depth) {
            var qr_mc = target_mc.createEmptyMovieClip(instance_name, depth); var cs = 1; this.make(); for (var row = 0; row < this.modules.length; row++) { var y = row * cs; for (var col = 0; col < this.modules[row].length; col++) { var x = col * cs; var dark = this.modules[row][col]; if (dark) { qr_mc.beginFill(0, 100); qr_mc.moveTo(x, y); qr_mc.lineTo(x + cs, y); qr_mc.lineTo(x + cs, y + cs); qr_mc.lineTo(x, y + cs); qr_mc.endFill(); } } }
            return qr_mc;
        }, setupTimingPattern: function () {
            for (var r = 8; r < this.moduleCount - 8; r++) {
                if (this.modules[r][6] != null) { continue; }
                this.modules[r][6] = (r % 2 == 0);
            }
            for (var c = 8; c < this.moduleCount - 8; c++) {
                if (this.modules[6][c] != null) { continue; }
                this.modules[6][c] = (c % 2 == 0);
            }
        }, setupPositionAdjustPattern: function () {
            var pos = QRUtil.getPatternPosition(this.typeNumber); for (var i = 0; i < pos.length; i++) {
                for (var j = 0; j < pos.length; j++) {
                    var row = pos[i]; var col = pos[j]; if (this.modules[row][col] != null) { continue; }
                    for (var r = -2; r <= 2; r++) { for (var c = -2; c <= 2; c++) { if (r == -2 || r == 2 || c == -2 || c == 2 || (r == 0 && c == 0)) { this.modules[row + r][col + c] = true; } else { this.modules[row + r][col + c] = false; } } }
                }
            }
        }, setupTypeNumber: function (test) {
            var bits = QRUtil.getBCHTypeNumber(this.typeNumber); for (var i = 0; i < 18; i++) { var mod = (!test && ((bits >> i) & 1) == 1); this.modules[Math.floor(i / 3)][i % 3 + this.moduleCount - 8 - 3] = mod; }
            for (var i = 0; i < 18; i++) { var mod = (!test && ((bits >> i) & 1) == 1); this.modules[i % 3 + this.moduleCount - 8 - 3][Math.floor(i / 3)] = mod; }
        }, setupTypeInfo: function (test, maskPattern) {
            var data = (this.errorCorrectLevel << 3) | maskPattern; var bits = QRUtil.getBCHTypeInfo(data); for (var i = 0; i < 15; i++) { var mod = (!test && ((bits >> i) & 1) == 1); if (i < 6) { this.modules[i][8] = mod; } else if (i < 8) { this.modules[i + 1][8] = mod; } else { this.modules[this.moduleCount - 15 + i][8] = mod; } }
            for (var i = 0; i < 15; i++) { var mod = (!test && ((bits >> i) & 1) == 1); if (i < 8) { this.modules[8][this.moduleCount - i - 1] = mod; } else if (i < 9) { this.modules[8][15 - i - 1 + 1] = mod; } else { this.modules[8][15 - i - 1] = mod; } }
            this.modules[this.moduleCount - 8][8] = (!test);
        }, mapData: function (data, maskPattern) {
            var inc = -1; var row = this.moduleCount - 1; var bitIndex = 7; var byteIndex = 0; for (var col = this.moduleCount - 1; col > 0; col -= 2) {
                if (col == 6) col--; while (true) {
                    for (var c = 0; c < 2; c++) {
                        if (this.modules[row][col - c] == null) {
                            var dark = false; if (byteIndex < data.length) { dark = (((data[byteIndex] >>> bitIndex) & 1) == 1); }
                            var mask = QRUtil.getMask(maskPattern, row, col - c); if (mask) { dark = !dark; }
                            this.modules[row][col - c] = dark; bitIndex--; if (bitIndex == -1) { byteIndex++; bitIndex = 7; }
                        }
                    }
                    row += inc; if (row < 0 || this.moduleCount <= row) { row -= inc; inc = -inc; break; }
                }
            }
        }
    }; QRCodeModel.PAD0 = 0xEC; QRCodeModel.PAD1 = 0x11; QRCodeModel.createData = function (typeNumber, errorCorrectLevel, dataList) {
        var rsBlocks = QRRSBlock.getRSBlocks(typeNumber, errorCorrectLevel); var buffer = new QRBitBuffer(); for (var i = 0; i < dataList.length; i++) { var data = dataList[i]; buffer.put(data.mode, 4); buffer.put(data.getLength(), QRUtil.getLengthInBits(data.mode, typeNumber)); data.write(buffer); }
        var totalDataCount = 0; for (var i = 0; i < rsBlocks.length; i++) { totalDataCount += rsBlocks[i].dataCount; }
        if (buffer.getLengthInBits() > totalDataCount * 8) {
            throw new Error("code length overflow. ("
                + buffer.getLengthInBits()
                + ">"
                + totalDataCount * 8
                + ")");
        }
        if (buffer.getLengthInBits() + 4 <= totalDataCount * 8) { buffer.put(0, 4); }
        while (buffer.getLengthInBits() % 8 != 0) { buffer.putBit(false); }
        while (true) {
            if (buffer.getLengthInBits() >= totalDataCount * 8) { break; }
            buffer.put(QRCodeModel.PAD0, 8); if (buffer.getLengthInBits() >= totalDataCount * 8) { break; }
            buffer.put(QRCodeModel.PAD1, 8);
        }
        return QRCodeModel.createBytes(buffer, rsBlocks);
    }; QRCodeModel.createBytes = function (buffer, rsBlocks) {
        var offset = 0; var maxDcCount = 0; var maxEcCount = 0; var dcdata = new Array(rsBlocks.length); var ecdata = new Array(rsBlocks.length); for (var r = 0; r < rsBlocks.length; r++) {
            var dcCount = rsBlocks[r].dataCount; var ecCount = rsBlocks[r].totalCount - dcCount; maxDcCount = Math.max(maxDcCount, dcCount); maxEcCount = Math.max(maxEcCount, ecCount); dcdata[r] = new Array(dcCount); for (var i = 0; i < dcdata[r].length; i++) { dcdata[r][i] = 0xff & buffer.buffer[i + offset]; }
            offset += dcCount; var rsPoly = QRUtil.getErrorCorrectPolynomial(ecCount); var rawPoly = new QRPolynomial(dcdata[r], rsPoly.getLength() - 1); var modPoly = rawPoly.mod(rsPoly); ecdata[r] = new Array(rsPoly.getLength() - 1); for (var i = 0; i < ecdata[r].length; i++) { var modIndex = i + modPoly.getLength() - ecdata[r].length; ecdata[r][i] = (modIndex >= 0) ? modPoly.get(modIndex) : 0; }
        }
        var totalCodeCount = 0; for (var i = 0; i < rsBlocks.length; i++) { totalCodeCount += rsBlocks[i].totalCount; }
        var data = new Array(totalCodeCount); var index = 0; for (var i = 0; i < maxDcCount; i++) { for (var r = 0; r < rsBlocks.length; r++) { if (i < dcdata[r].length) { data[index++] = dcdata[r][i]; } } }
        for (var i = 0; i < maxEcCount; i++) { for (var r = 0; r < rsBlocks.length; r++) { if (i < ecdata[r].length) { data[index++] = ecdata[r][i]; } } }
        return data;
    }; var QRMode = { MODE_NUMBER: 1 << 0, MODE_ALPHA_NUM: 1 << 1, MODE_8BIT_BYTE: 1 << 2, MODE_KANJI: 1 << 3 }; var QRErrorCorrectLevel = { L: 1, M: 0, Q: 3, H: 2 }; var QRMaskPattern = { PATTERN000: 0, PATTERN001: 1, PATTERN010: 2, PATTERN011: 3, PATTERN100: 4, PATTERN101: 5, PATTERN110: 6, PATTERN111: 7 }; var QRUtil = {
        PATTERN_POSITION_TABLE: [[], [6, 18], [6, 22], [6, 26], [6, 30], [6, 34], [6, 22, 38], [6, 24, 42], [6, 26, 46], [6, 28, 50], [6, 30, 54], [6, 32, 58], [6, 34, 62], [6, 26, 46, 66], [6, 26, 48, 70], [6, 26, 50, 74], [6, 30, 54, 78], [6, 30, 56, 82], [6, 30, 58, 86], [6, 34, 62, 90], [6, 28, 50, 72, 94], [6, 26, 50, 74, 98], [6, 30, 54, 78, 102], [6, 28, 54, 80, 106], [6, 32, 58, 84, 110], [6, 30, 58, 86, 114], [6, 34, 62, 90, 118], [6, 26, 50, 74, 98, 122], [6, 30, 54, 78, 102, 126], [6, 26, 52, 78, 104, 130], [6, 30, 56, 82, 108, 134], [6, 34, 60, 86, 112, 138], [6, 30, 58, 86, 114, 142], [6, 34, 62, 90, 118, 146], [6, 30, 54, 78, 102, 126, 150], [6, 24, 50, 76, 102, 128, 154], [6, 28, 54, 80, 106, 132, 158], [6, 32, 58, 84, 110, 136, 162], [6, 26, 54, 82, 110, 138, 166], [6, 30, 58, 86, 114, 142, 170]], G15: (1 << 10) | (1 << 8) | (1 << 5) | (1 << 4) | (1 << 2) | (1 << 1) | (1 << 0), G18: (1 << 12) | (1 << 11) | (1 << 10) | (1 << 9) | (1 << 8) | (1 << 5) | (1 << 2) | (1 << 0), G15_MASK: (1 << 14) | (1 << 12) | (1 << 10) | (1 << 4) | (1 << 1), getBCHTypeInfo: function (data) {
            var d = data << 10; while (QRUtil.getBCHDigit(d) - QRUtil.getBCHDigit(QRUtil.G15) >= 0) { d ^= (QRUtil.G15 << (QRUtil.getBCHDigit(d) - QRUtil.getBCHDigit(QRUtil.G15))); }
            return ((data << 10) | d) ^ QRUtil.G15_MASK;
        }, getBCHTypeNumber: function (data) {
            var d = data << 12; while (QRUtil.getBCHDigit(d) - QRUtil.getBCHDigit(QRUtil.G18) >= 0) { d ^= (QRUtil.G18 << (QRUtil.getBCHDigit(d) - QRUtil.getBCHDigit(QRUtil.G18))); }
            return (data << 12) | d;
        }, getBCHDigit: function (data) {
            var digit = 0; while (data != 0) { digit++; data >>>= 1; }
            return digit;
        }, getPatternPosition: function (typeNumber) { return QRUtil.PATTERN_POSITION_TABLE[typeNumber - 1]; }, getMask: function (maskPattern, i, j) { switch (maskPattern) { case QRMaskPattern.PATTERN000: return (i + j) % 2 == 0; case QRMaskPattern.PATTERN001: return i % 2 == 0; case QRMaskPattern.PATTERN010: return j % 3 == 0; case QRMaskPattern.PATTERN011: return (i + j) % 3 == 0; case QRMaskPattern.PATTERN100: return (Math.floor(i / 2) + Math.floor(j / 3)) % 2 == 0; case QRMaskPattern.PATTERN101: return (i * j) % 2 + (i * j) % 3 == 0; case QRMaskPattern.PATTERN110: return ((i * j) % 2 + (i * j) % 3) % 2 == 0; case QRMaskPattern.PATTERN111: return ((i * j) % 3 + (i + j) % 2) % 2 == 0; default: throw new Error("bad maskPattern:" + maskPattern); } }, getErrorCorrectPolynomial: function (errorCorrectLength) {
            var a = new QRPolynomial([1], 0); for (var i = 0; i < errorCorrectLength; i++) { a = a.multiply(new QRPolynomial([1, QRMath.gexp(i)], 0)); }
            return a;
        }, getLengthInBits: function (mode, type) { if (1 <= type && type < 10) { switch (mode) { case QRMode.MODE_NUMBER: return 10; case QRMode.MODE_ALPHA_NUM: return 9; case QRMode.MODE_8BIT_BYTE: return 8; case QRMode.MODE_KANJI: return 8; default: throw new Error("mode:" + mode); } } else if (type < 27) { switch (mode) { case QRMode.MODE_NUMBER: return 12; case QRMode.MODE_ALPHA_NUM: return 11; case QRMode.MODE_8BIT_BYTE: return 16; case QRMode.MODE_KANJI: return 10; default: throw new Error("mode:" + mode); } } else if (type < 41) { switch (mode) { case QRMode.MODE_NUMBER: return 14; case QRMode.MODE_ALPHA_NUM: return 13; case QRMode.MODE_8BIT_BYTE: return 16; case QRMode.MODE_KANJI: return 12; default: throw new Error("mode:" + mode); } } else { throw new Error("type:" + type); } }, getLostPoint: function (qrCode) {
            var moduleCount = qrCode.getModuleCount(); var lostPoint = 0; for (var row = 0; row < moduleCount; row++) {
                for (var col = 0; col < moduleCount; col++) {
                    var sameCount = 0; var dark = qrCode.isDark(row, col); for (var r = -1; r <= 1; r++) {
                        if (row + r < 0 || moduleCount <= row + r) { continue; }
                        for (var c = -1; c <= 1; c++) {
                            if (col + c < 0 || moduleCount <= col + c) { continue; }
                            if (r == 0 && c == 0) { continue; }
                            if (dark == qrCode.isDark(row + r, col + c)) { sameCount++; }
                        }
                    }
                    if (sameCount > 5) { lostPoint += (3 + sameCount - 5); }
                }
            }
            for (var row = 0; row < moduleCount - 1; row++) { for (var col = 0; col < moduleCount - 1; col++) { var count = 0; if (qrCode.isDark(row, col)) count++; if (qrCode.isDark(row + 1, col)) count++; if (qrCode.isDark(row, col + 1)) count++; if (qrCode.isDark(row + 1, col + 1)) count++; if (count == 0 || count == 4) { lostPoint += 3; } } }
            for (var row = 0; row < moduleCount; row++) { for (var col = 0; col < moduleCount - 6; col++) { if (qrCode.isDark(row, col) && !qrCode.isDark(row, col + 1) && qrCode.isDark(row, col + 2) && qrCode.isDark(row, col + 3) && qrCode.isDark(row, col + 4) && !qrCode.isDark(row, col + 5) && qrCode.isDark(row, col + 6)) { lostPoint += 40; } } }
            for (var col = 0; col < moduleCount; col++) { for (var row = 0; row < moduleCount - 6; row++) { if (qrCode.isDark(row, col) && !qrCode.isDark(row + 1, col) && qrCode.isDark(row + 2, col) && qrCode.isDark(row + 3, col) && qrCode.isDark(row + 4, col) && !qrCode.isDark(row + 5, col) && qrCode.isDark(row + 6, col)) { lostPoint += 40; } } }
            var darkCount = 0; for (var col = 0; col < moduleCount; col++) { for (var row = 0; row < moduleCount; row++) { if (qrCode.isDark(row, col)) { darkCount++; } } }
            var ratio = Math.abs(100 * darkCount / moduleCount / moduleCount - 50) / 5; lostPoint += ratio * 10; return lostPoint;
        }
    }; var QRMath = {
        glog: function (n) {
            if (n < 1) { throw new Error("glog(" + n + ")"); }
            return QRMath.LOG_TABLE[n];
        }, gexp: function (n) {
            while (n < 0) { n += 255; }
            while (n >= 256) { n -= 255; }
            return QRMath.EXP_TABLE[n];
        }, EXP_TABLE: new Array(256), LOG_TABLE: new Array(256)
    }; for (var i = 0; i < 8; i++) { QRMath.EXP_TABLE[i] = 1 << i; }
    for (var i = 8; i < 256; i++) { QRMath.EXP_TABLE[i] = QRMath.EXP_TABLE[i - 4] ^ QRMath.EXP_TABLE[i - 5] ^ QRMath.EXP_TABLE[i - 6] ^ QRMath.EXP_TABLE[i - 8]; }
    for (var i = 0; i < 255; i++) { QRMath.LOG_TABLE[QRMath.EXP_TABLE[i]] = i; }
    function QRPolynomial(num, shift) {
        if (num.length == undefined) { throw new Error(num.length + "/" + shift); }
        var offset = 0; while (offset < num.length && num[offset] == 0) { offset++; }
        this.num = new Array(num.length - offset + shift); for (var i = 0; i < num.length - offset; i++) { this.num[i] = num[i + offset]; }
    }
    QRPolynomial.prototype = {
        get: function (index) { return this.num[index]; }, getLength: function () { return this.num.length; }, multiply: function (e) {
            var num = new Array(this.getLength() + e.getLength() - 1); for (var i = 0; i < this.getLength(); i++) { for (var j = 0; j < e.getLength(); j++) { num[i + j] ^= QRMath.gexp(QRMath.glog(this.get(i)) + QRMath.glog(e.get(j))); } }
            return new QRPolynomial(num, 0);
        }, mod: function (e) {
            if (this.getLength() - e.getLength() < 0) { return this; }
            var ratio = QRMath.glog(this.get(0)) - QRMath.glog(e.get(0)); var num = new Array(this.getLength()); for (var i = 0; i < this.getLength(); i++) { num[i] = this.get(i); }
            for (var i = 0; i < e.getLength(); i++) { num[i] ^= QRMath.gexp(QRMath.glog(e.get(i)) + ratio); }
            return new QRPolynomial(num, 0).mod(e);
        }
    }; function QRRSBlock(totalCount, dataCount) { this.totalCount = totalCount; this.dataCount = dataCount; }
    QRRSBlock.RS_BLOCK_TABLE = [[1, 26, 19], [1, 26, 16], [1, 26, 13], [1, 26, 9], [1, 44, 34], [1, 44, 28], [1, 44, 22], [1, 44, 16], [1, 70, 55], [1, 70, 44], [2, 35, 17], [2, 35, 13], [1, 100, 80], [2, 50, 32], [2, 50, 24], [4, 25, 9], [1, 134, 108], [2, 67, 43], [2, 33, 15, 2, 34, 16], [2, 33, 11, 2, 34, 12], [2, 86, 68], [4, 43, 27], [4, 43, 19], [4, 43, 15], [2, 98, 78], [4, 49, 31], [2, 32, 14, 4, 33, 15], [4, 39, 13, 1, 40, 14], [2, 121, 97], [2, 60, 38, 2, 61, 39], [4, 40, 18, 2, 41, 19], [4, 40, 14, 2, 41, 15], [2, 146, 116], [3, 58, 36, 2, 59, 37], [4, 36, 16, 4, 37, 17], [4, 36, 12, 4, 37, 13], [2, 86, 68, 2, 87, 69], [4, 69, 43, 1, 70, 44], [6, 43, 19, 2, 44, 20], [6, 43, 15, 2, 44, 16], [4, 101, 81], [1, 80, 50, 4, 81, 51], [4, 50, 22, 4, 51, 23], [3, 36, 12, 8, 37, 13], [2, 116, 92, 2, 117, 93], [6, 58, 36, 2, 59, 37], [4, 46, 20, 6, 47, 21], [7, 42, 14, 4, 43, 15], [4, 133, 107], [8, 59, 37, 1, 60, 38], [8, 44, 20, 4, 45, 21], [12, 33, 11, 4, 34, 12], [3, 145, 115, 1, 146, 116], [4, 64, 40, 5, 65, 41], [11, 36, 16, 5, 37, 17], [11, 36, 12, 5, 37, 13], [5, 109, 87, 1, 110, 88], [5, 65, 41, 5, 66, 42], [5, 54, 24, 7, 55, 25], [11, 36, 12, 7, 37, 13], [5, 122, 98, 1, 123, 99], [7, 73, 45, 3, 74, 46], [15, 43, 19, 2, 44, 20], [3, 45, 15, 13, 46, 16], [1, 135, 107, 5, 136, 108], [10, 74, 46, 1, 75, 47], [1, 50, 22, 15, 51, 23], [2, 42, 14, 17, 43, 15], [5, 150, 120, 1, 151, 121], [9, 69, 43, 4, 70, 44], [17, 50, 22, 1, 51, 23], [2, 42, 14, 19, 43, 15], [3, 141, 113, 4, 142, 114], [3, 70, 44, 11, 71, 45], [17, 47, 21, 4, 48, 22], [9, 39, 13, 16, 40, 14], [3, 135, 107, 5, 136, 108], [3, 67, 41, 13, 68, 42], [15, 54, 24, 5, 55, 25], [15, 43, 15, 10, 44, 16], [4, 144, 116, 4, 145, 117], [17, 68, 42], [17, 50, 22, 6, 51, 23], [19, 46, 16, 6, 47, 17], [2, 139, 111, 7, 140, 112], [17, 74, 46], [7, 54, 24, 16, 55, 25], [34, 37, 13], [4, 151, 121, 5, 152, 122], [4, 75, 47, 14, 76, 48], [11, 54, 24, 14, 55, 25], [16, 45, 15, 14, 46, 16], [6, 147, 117, 4, 148, 118], [6, 73, 45, 14, 74, 46], [11, 54, 24, 16, 55, 25], [30, 46, 16, 2, 47, 17], [8, 132, 106, 4, 133, 107], [8, 75, 47, 13, 76, 48], [7, 54, 24, 22, 55, 25], [22, 45, 15, 13, 46, 16], [10, 142, 114, 2, 143, 115], [19, 74, 46, 4, 75, 47], [28, 50, 22, 6, 51, 23], [33, 46, 16, 4, 47, 17], [8, 152, 122, 4, 153, 123], [22, 73, 45, 3, 74, 46], [8, 53, 23, 26, 54, 24], [12, 45, 15, 28, 46, 16], [3, 147, 117, 10, 148, 118], [3, 73, 45, 23, 74, 46], [4, 54, 24, 31, 55, 25], [11, 45, 15, 31, 46, 16], [7, 146, 116, 7, 147, 117], [21, 73, 45, 7, 74, 46], [1, 53, 23, 37, 54, 24], [19, 45, 15, 26, 46, 16], [5, 145, 115, 10, 146, 116], [19, 75, 47, 10, 76, 48], [15, 54, 24, 25, 55, 25], [23, 45, 15, 25, 46, 16], [13, 145, 115, 3, 146, 116], [2, 74, 46, 29, 75, 47], [42, 54, 24, 1, 55, 25], [23, 45, 15, 28, 46, 16], [17, 145, 115], [10, 74, 46, 23, 75, 47], [10, 54, 24, 35, 55, 25], [19, 45, 15, 35, 46, 16], [17, 145, 115, 1, 146, 116], [14, 74, 46, 21, 75, 47], [29, 54, 24, 19, 55, 25], [11, 45, 15, 46, 46, 16], [13, 145, 115, 6, 146, 116], [14, 74, 46, 23, 75, 47], [44, 54, 24, 7, 55, 25], [59, 46, 16, 1, 47, 17], [12, 151, 121, 7, 152, 122], [12, 75, 47, 26, 76, 48], [39, 54, 24, 14, 55, 25], [22, 45, 15, 41, 46, 16], [6, 151, 121, 14, 152, 122], [6, 75, 47, 34, 76, 48], [46, 54, 24, 10, 55, 25], [2, 45, 15, 64, 46, 16], [17, 152, 122, 4, 153, 123], [29, 74, 46, 14, 75, 47], [49, 54, 24, 10, 55, 25], [24, 45, 15, 46, 46, 16], [4, 152, 122, 18, 153, 123], [13, 74, 46, 32, 75, 47], [48, 54, 24, 14, 55, 25], [42, 45, 15, 32, 46, 16], [20, 147, 117, 4, 148, 118], [40, 75, 47, 7, 76, 48], [43, 54, 24, 22, 55, 25], [10, 45, 15, 67, 46, 16], [19, 148, 118, 6, 149, 119], [18, 75, 47, 31, 76, 48], [34, 54, 24, 34, 55, 25], [20, 45, 15, 61, 46, 16]]; QRRSBlock.getRSBlocks = function (typeNumber, errorCorrectLevel) {
        var rsBlock = QRRSBlock.getRsBlockTable(typeNumber, errorCorrectLevel); if (rsBlock == undefined) { throw new Error("bad rs block @ typeNumber:" + typeNumber + "/errorCorrectLevel:" + errorCorrectLevel); }
        var length = rsBlock.length / 3; var list = []; for (var i = 0; i < length; i++) { var count = rsBlock[i * 3 + 0]; var totalCount = rsBlock[i * 3 + 1]; var dataCount = rsBlock[i * 3 + 2]; for (var j = 0; j < count; j++) { list.push(new QRRSBlock(totalCount, dataCount)); } }
        return list;
    }; QRRSBlock.getRsBlockTable = function (typeNumber, errorCorrectLevel) { switch (errorCorrectLevel) { case QRErrorCorrectLevel.L: return QRRSBlock.RS_BLOCK_TABLE[(typeNumber - 1) * 4 + 0]; case QRErrorCorrectLevel.M: return QRRSBlock.RS_BLOCK_TABLE[(typeNumber - 1) * 4 + 1]; case QRErrorCorrectLevel.Q: return QRRSBlock.RS_BLOCK_TABLE[(typeNumber - 1) * 4 + 2]; case QRErrorCorrectLevel.H: return QRRSBlock.RS_BLOCK_TABLE[(typeNumber - 1) * 4 + 3]; default: return undefined; } }; function QRBitBuffer() { this.buffer = []; this.length = 0; }
    QRBitBuffer.prototype = {
        get: function (index) { var bufIndex = Math.floor(index / 8); return ((this.buffer[bufIndex] >>> (7 - index % 8)) & 1) == 1; }, put: function (num, length) { for (var i = 0; i < length; i++) { this.putBit(((num >>> (length - i - 1)) & 1) == 1); } }, getLengthInBits: function () { return this.length; }, putBit: function (bit) {
            var bufIndex = Math.floor(this.length / 8); if (this.buffer.length <= bufIndex) { this.buffer.push(0); }
            if (bit) { this.buffer[bufIndex] |= (0x80 >>> (this.length % 8)); }
            this.length++;
        }
    }; var QRCodeLimitLength = [[17, 14, 11, 7], [32, 26, 20, 14], [53, 42, 32, 24], [78, 62, 46, 34], [106, 84, 60, 44], [134, 106, 74, 58], [154, 122, 86, 64], [192, 152, 108, 84], [230, 180, 130, 98], [271, 213, 151, 119], [321, 251, 177, 137], [367, 287, 203, 155], [425, 331, 241, 177], [458, 362, 258, 194], [520, 412, 292, 220], [586, 450, 322, 250], [644, 504, 364, 280], [718, 560, 394, 310], [792, 624, 442, 338], [858, 666, 482, 382], [929, 711, 509, 403], [1003, 779, 565, 439], [1091, 857, 611, 461], [1171, 911, 661, 511], [1273, 997, 715, 535], [1367, 1059, 751, 593], [1465, 1125, 805, 625], [1528, 1190, 868, 658], [1628, 1264, 908, 698], [1732, 1370, 982, 742], [1840, 1452, 1030, 790], [1952, 1538, 1112, 842], [2068, 1628, 1168, 898], [2188, 1722, 1228, 958], [2303, 1809, 1283, 983], [2431, 1911, 1351, 1051], [2563, 1989, 1423, 1093], [2699, 2099, 1499, 1139], [2809, 2213, 1579, 1219], [2953, 2331, 1663, 1273]];

    function _isSupportCanvas() {
        return typeof CanvasRenderingContext2D != "undefined";
    }

    // android 2.x doesn't support Data-URI spec
    function _getAndroid() {
        var android = false;
        var sAgent = navigator.userAgent;

        if (/android/i.test(sAgent)) { // android
            android = true;
            var aMat = sAgent.toString().match(/android ([0-9]\.[0-9])/i);

            if (aMat && aMat[1]) {
                android = parseFloat(aMat[1]);
            }
        }

        return android;
    }

    var svgDrawer = (function () {

        var Drawing = function (el, htOption) {
            this._el = el;
            this._htOption = htOption;
        };

        Drawing.prototype.draw = function (oQRCode) {
            var _htOption = this._htOption;
            var _el = this._el;
            var nCount = oQRCode.getModuleCount();
            var nWidth = Math.floor(_htOption.width / nCount);
            var nHeight = Math.floor(_htOption.height / nCount);

            this.clear();

            function makeSVG(tag, attrs) {
                var el = document.createElementNS('http://www.w3.org/2000/svg', tag);
                for (var k in attrs)
                    if (attrs.hasOwnProperty(k)) el.setAttribute(k, attrs[k]);
                return el;
            }

            var svg = makeSVG("svg", { 'viewBox': '0 0 ' + String(nCount) + " " + String(nCount), 'width': '100%', 'height': '100%', 'fill': _htOption.colorLight });
            svg.setAttributeNS("http://www.w3.org/2000/xmlns/", "xmlns:xlink", "http://www.w3.org/1999/xlink");
            _el.appendChild(svg);

            svg.appendChild(makeSVG("rect", { "fill": _htOption.colorLight, "width": "100%", "height": "100%" }));
            svg.appendChild(makeSVG("rect", { "fill": _htOption.colorDark, "width": "1", "height": "1", "id": "template" }));

            for (var row = 0; row < nCount; row++) {
                for (var col = 0; col < nCount; col++) {
                    if (oQRCode.isDark(row, col)) {
                        var child = makeSVG("use", { "x": String(col), "y": String(row) });
                        child.setAttributeNS("http://www.w3.org/1999/xlink", "href", "#template")
                        svg.appendChild(child);
                    }
                }
            }
        };
        Drawing.prototype.clear = function () {
            while (this._el.hasChildNodes())
                this._el.removeChild(this._el.lastChild);
        };
        return Drawing;
    })();

    var useSVG = document.documentElement.tagName.toLowerCase() === "svg";

    // Drawing in DOM by using Table tag
    var Drawing = useSVG ? svgDrawer : !_isSupportCanvas() ? (function () {
        var Drawing = function (el, htOption) {
            this._el = el;
            this._htOption = htOption;
        };

		/**
		 * Draw the QRCode
		 * 
		 * @param {QRCode} oQRCode
		 */
        Drawing.prototype.draw = function (oQRCode) {
            var _htOption = this._htOption;
            var _el = this._el;
            var nCount = oQRCode.getModuleCount();
            var nWidth = Math.floor(_htOption.width / nCount);
            var nHeight = Math.floor(_htOption.height / nCount);
            var aHTML = ['<table style="border:0;border-collapse:collapse;">'];

            for (var row = 0; row < nCount; row++) {
                aHTML.push('<tr>');

                for (var col = 0; col < nCount; col++) {
                    aHTML.push('<td style="border:0;border-collapse:collapse;padding:0;margin:0;width:' + nWidth + 'px;height:' + nHeight + 'px;background-color:' + (oQRCode.isDark(row, col) ? _htOption.colorDark : _htOption.colorLight) + ';"></td>');
                }

                aHTML.push('</tr>');
            }

            aHTML.push('</table>');
            _el.innerHTML = aHTML.join('');

            // Fix the margin values as real size.
            var elTable = _el.childNodes[0];
            var nLeftMarginTable = (_htOption.width - elTable.offsetWidth) / 2;
            var nTopMarginTable = (_htOption.height - elTable.offsetHeight) / 2;

            if (nLeftMarginTable > 0 && nTopMarginTable > 0) {
                elTable.style.margin = nTopMarginTable + "px " + nLeftMarginTable + "px";
            }
        };

		/**
		 * Clear the QRCode
		 */
        Drawing.prototype.clear = function () {
            this._el.innerHTML = '';
        };

        return Drawing;
    })() : (function () { // Drawing in Canvas
        function _onMakeImage() {
            this._elImage.src = this._elCanvas.toDataURL("image/png");
            this._elImage.style.display = "block";
            this._elCanvas.style.display = "none";
        }

        // Android 2.1 bug workaround
        // http://code.google.com/p/android/issues/detail?id=5141
        if (this._android && this._android <= 2.1) {
            var factor = 1 / window.devicePixelRatio;
            var drawImage = CanvasRenderingContext2D.prototype.drawImage;
            CanvasRenderingContext2D.prototype.drawImage = function (image, sx, sy, sw, sh, dx, dy, dw, dh) {
                if (("nodeName" in image) && /img/i.test(image.nodeName)) {
                    for (var i = arguments.length - 1; i >= 1; i--) {
                        arguments[i] = arguments[i] * factor;
                    }
                } else if (typeof dw == "undefined") {
                    arguments[1] *= factor;
                    arguments[2] *= factor;
                    arguments[3] *= factor;
                    arguments[4] *= factor;
                }

                drawImage.apply(this, arguments);
            };
        }

		/**
		 * Check whether the user's browser supports Data URI or not
		 * 
		 * @private
		 * @param {Function} fSuccess Occurs if it supports Data URI
		 * @param {Function} fFail Occurs if it doesn't support Data URI
		 */
        function _safeSetDataURI(fSuccess, fFail) {
            var self = this;
            self._fFail = fFail;
            self._fSuccess = fSuccess;

            // Check it just once
            if (self._bSupportDataURI === null) {
                var el = document.createElement("img");
                var fOnError = function () {
                    self._bSupportDataURI = false;

                    if (self._fFail) {
                        self._fFail.call(self);
                    }
                };
                var fOnSuccess = function () {
                    self._bSupportDataURI = true;

                    if (self._fSuccess) {
                        self._fSuccess.call(self);
                    }
                };

                el.onabort = fOnError;
                el.onerror = fOnError;
                el.onload = fOnSuccess;
                el.src = "data:image/gif;base64,iVBORw0KGgoAAAANSUhEUgAAAAUAAAAFCAYAAACNbyblAAAAHElEQVQI12P4//8/w38GIAXDIBKE0DHxgljNBAAO9TXL0Y4OHwAAAABJRU5ErkJggg=="; // the Image contains 1px data.
                return;
            } else if (self._bSupportDataURI === true && self._fSuccess) {
                self._fSuccess.call(self);
            } else if (self._bSupportDataURI === false && self._fFail) {
                self._fFail.call(self);
            }
        };

		/**
		 * Drawing QRCode by using canvas
		 * 
		 * @constructor
		 * @param {HTMLElement} el
		 * @param {Object} htOption QRCode Options 
		 */
        var Drawing = function (el, htOption) {
            this._bIsPainted = false;
            this._android = _getAndroid();

            this._htOption = htOption;
            this._elCanvas = document.createElement("canvas");
            this._elCanvas.width = htOption.width;
            this._elCanvas.height = htOption.height;
            el.appendChild(this._elCanvas);
            this._el = el;
            this._oContext = this._elCanvas.getContext("2d");
            this._bIsPainted = false;
            this._elImage = document.createElement("img");
            this._elImage.alt = "Scan me!";
            this._elImage.style.display = "none";
            this._el.appendChild(this._elImage);
            this._bSupportDataURI = null;
        };

		/**
		 * Draw the QRCode
		 * 
		 * @param {QRCode} oQRCode 
		 */
        Drawing.prototype.draw = function (oQRCode) {
            var _elImage = this._elImage;
            var _oContext = this._oContext;
            var _htOption = this._htOption;

            var nCount = oQRCode.getModuleCount();
            var nWidth = _htOption.width / nCount;
            var nHeight = _htOption.height / nCount;
            var nRoundedWidth = Math.round(nWidth);
            var nRoundedHeight = Math.round(nHeight);

            _elImage.style.display = "none";
            this.clear();

            for (var row = 0; row < nCount; row++) {
                for (var col = 0; col < nCount; col++) {
                    var bIsDark = oQRCode.isDark(row, col);
                    var nLeft = col * nWidth;
                    var nTop = row * nHeight;
                    _oContext.strokeStyle = bIsDark ? _htOption.colorDark : _htOption.colorLight;
                    _oContext.lineWidth = 1;
                    _oContext.fillStyle = bIsDark ? _htOption.colorDark : _htOption.colorLight;
                    _oContext.fillRect(nLeft, nTop, nWidth, nHeight);

                    // 안티 앨리어싱 방지 처리
                    _oContext.strokeRect(
                        Math.floor(nLeft) + 0.5,
                        Math.floor(nTop) + 0.5,
                        nRoundedWidth,
                        nRoundedHeight
                    );

                    _oContext.strokeRect(
                        Math.ceil(nLeft) - 0.5,
                        Math.ceil(nTop) - 0.5,
                        nRoundedWidth,
                        nRoundedHeight
                    );
                }
            }

            this._bIsPainted = true;
        };

		/**
		 * Make the image from Canvas if the browser supports Data URI.
		 */
        Drawing.prototype.makeImage = function () {
            if (this._bIsPainted) {
                _safeSetDataURI.call(this, _onMakeImage);
            }
        };

		/**
		 * Return whether the QRCode is painted or not
		 * 
		 * @return {Boolean}
		 */
        Drawing.prototype.isPainted = function () {
            return this._bIsPainted;
        };

		/**
		 * Clear the QRCode
		 */
        Drawing.prototype.clear = function () {
            this._oContext.clearRect(0, 0, this._elCanvas.width, this._elCanvas.height);
            this._bIsPainted = false;
        };

		/**
		 * @private
		 * @param {Number} nNumber
		 */
        Drawing.prototype.round = function (nNumber) {
            if (!nNumber) {
                return nNumber;
            }

            return Math.floor(nNumber * 1000) / 1000;
        };

        return Drawing;
    })();

	/**
	 * Get the type by string length
	 * 
	 * @private
	 * @param {String} sText
	 * @param {Number} nCorrectLevel
	 * @return {Number} type
	 */
    function _getTypeNumber(sText, nCorrectLevel) {
        var nType = 1;
        var length = _getUTF8Length(sText);

        for (var i = 0, len = QRCodeLimitLength.length; i <= len; i++) {
            var nLimit = 0;

            switch (nCorrectLevel) {
                case QRErrorCorrectLevel.L:
                    nLimit = QRCodeLimitLength[i][0];
                    break;
                case QRErrorCorrectLevel.M:
                    nLimit = QRCodeLimitLength[i][1];
                    break;
                case QRErrorCorrectLevel.Q:
                    nLimit = QRCodeLimitLength[i][2];
                    break;
                case QRErrorCorrectLevel.H:
                    nLimit = QRCodeLimitLength[i][3];
                    break;
            }

            if (length <= nLimit) {
                break;
            } else {
                nType++;
            }
        }

        if (nType > QRCodeLimitLength.length) {
            throw new Error("Too long data");
        }

        return nType;
    }

    function _getUTF8Length(sText) {
        var replacedText = encodeURI(sText).toString().replace(/\%[0-9a-fA-F]{2}/g, 'a');
        return replacedText.length + (replacedText.length != sText ? 3 : 0);
    }

	/**
	 * @class QRCode
	 * @constructor
	 * @example 
	 * new QRCode(document.getElementById("test"), "http://jindo.dev.naver.com/collie");
	 *
	 * @example
	 * var oQRCode = new QRCode("test", {
	 *    text : "http://naver.com",
	 *    width : 128,
	 *    height : 128
	 * });
	 * 
	 * oQRCode.clear(); // Clear the QRCode.
	 * oQRCode.makeCode("http://map.naver.com"); // Re-create the QRCode.
	 *
	 * @param {HTMLElement|String} el target element or 'id' attribute of element.
	 * @param {Object|String} vOption
	 * @param {String} vOption.text QRCode link data
	 * @param {Number} [vOption.width=256]
	 * @param {Number} [vOption.height=256]
	 * @param {String} [vOption.colorDark="#000000"]
	 * @param {String} [vOption.colorLight="#ffffff"]
	 * @param {QRCode.CorrectLevel} [vOption.correctLevel=QRCode.CorrectLevel.H] [L|M|Q|H] 
	 */
    QRCode = function (el, vOption) {
        this._htOption = {
            width: 256,
            height: 256,
            typeNumber: 4,
            colorDark: "#000000",
            colorLight: "#ffffff",
            correctLevel: QRErrorCorrectLevel.H
        };

        if (typeof vOption === 'string') {
            vOption = {
                text: vOption
            };
        }

        // Overwrites options
        if (vOption) {
            for (var i in vOption) {
                this._htOption[i] = vOption[i];
            }
        }

        if (typeof el == "string") {
            el = document.getElementById(el);
        }

        if (this._htOption.useSVG) {
            Drawing = svgDrawer;
        }

        this._android = _getAndroid();
        this._el = el;
        this._oQRCode = null;
        this._oDrawing = new Drawing(this._el, this._htOption);

        if (this._htOption.text) {
            this.makeCode(this._htOption.text);
        }
    };

	/**
	 * Make the QRCode
	 * 
	 * @param {String} sText link data
	 */
    QRCode.prototype.makeCode = function (sText) {
        this._oQRCode = new QRCodeModel(_getTypeNumber(sText, this._htOption.correctLevel), this._htOption.correctLevel);
        this._oQRCode.addData(sText);
        this._oQRCode.make();
        this._el.title = sText;
        this._oDrawing.draw(this._oQRCode);
        this.makeImage();
    };

	/**
	 * Make the Image from Canvas element
	 * - It occurs automatically
	 * - Android below 3 doesn't support Data-URI spec.
	 * 
	 * @private
	 */
    QRCode.prototype.makeImage = function () {
        if (typeof this._oDrawing.makeImage == "function" && (!this._android || this._android >= 3)) {
            this._oDrawing.makeImage();
        }
    };

	/**
	 * Clear the QRCode
	 */
    QRCode.prototype.clear = function () {
        this._oDrawing.clear();
    };

	/**
	 * @name QRCode.CorrectLevel
	 */
    QRCode.CorrectLevel = QRErrorCorrectLevel;
})();